{"pageProps":{"article":{"title":"Under the Scope: 2018-19 Men’s Basketball Big West Preview","category":"Sports","subcategory":"Basketball","publish_date":"2019-01-09T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2019/01/Big-West-Image.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2019/01/Big-West-Image.png?resize=713%2C504&ssl=1","description":"Staff writer Max Kelton breaks down each team in the Big West, and why the Gauchos are going to have to fight hard this year to stay on top.","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_85074\" style=\"width: 910px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg\" data-slb-active=\"1\" data-slb-asset=\"1132226289\" data-slb-internal=\"0\" data-slb-group=\"85505\"><img aria-describedby=\"caption-attachment-85074\" data-attachment-id=\"85074\" data-permalink=\"https://dailynexus.com/2018-11-29/pivotal-non-conference-games-await-gauchos-thursday-saturday/siavash-ghadiri-daily-nexus-3/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?fit=2048%2C1367&amp;ssl=1\" data-orig-size=\"2048,1367\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Siavash Ghadiri/Daily Nexus\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?fit=888%2C593&amp;ssl=1\" class=\"wp-image-85074\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print-1024x684.jpg?resize=888%2C593\" alt=\"\" width=\"888\" height=\"593\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?resize=768%2C513&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?w=2048&amp;ssl=1 2048w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/11/MBasketball-vsMontanaSt-11172018-SiavashGhadiri-1-print.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-85074\" class=\"wp-caption-text\">Siavash Ghadiri/Daily Nexus</p></div>\n<p><span style=\"font-weight: 400;\">For the second consecutive year, the UCSB men’s basketball team enters Big West Conference play on a hot streak </span><span style=\"font-weight: 400;\">— this year </span><span style=\"font-weight: 400;\">with an 11-3 overall record and the top spot in the Big West with half of the season now in the books. </span></p>\n<p><span style=\"font-weight: 400;\">The Gauchos’ offense has been quarterbacked by dynamic backcourt duo sophomore guard JaQuori McLaughlin and sophomore captain point guard Devearl Ramsey. Ramsey has contributed 11.2 points per game while averaging 3.8 assists, which is sixth best in the conference — not to mention he shoots the fifth highest mark from deep in the Big West with a three-point percentage of 42 percent.  </span></p>\n<p><span style=\"font-weight: 400;\">McLaughlin compliments 10.9 points per contest with 3.5 assists per game, giving him the eighth highest number of average assists in the Big West conference. Ramsey and McLaughlin, a pair of sophomores, control the ball on the attack for the offense, but it is graduate guard Ar’Mond Davis who delivers the bulk of the scoring for the Gauchos with 14.2 points per game. Davis adds 5.4 rebounds per game as a multifaceted offensive threat that crashes the boards, along with freshman forward Amadou Sow.</span></p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p><span style=\"font-weight: 400;\">Speaking of Sow, the freshman won his first career Big West Men’s Basketball Player of the Week award after a 21-point, nine-rebound performance against mid-major No. 10 University of San Francisco. Sow is the most efficient shooter in the Big West Conference, shooting 58.2 percent on field goals. </span></p>\n<p><span style=\"font-weight: 400;\">There have been flashes of stardom from the other two freshmen on the team as guard Sékou Touré has the highest player efficiency rating in the Big West and as forward Jay Nagle owns the third best three-point percentage in the conference with 46.2 percent. </span></p>\n<p><span style=\"font-weight: 400;\">With such a well-rounded team for the Gauchos this season, the real question is who will face the wrath of Head Coach Joe Pasternack in his second season with Santa Barbara.</span></p>\n<p><span style=\"font-weight: 400;\">Take a look at all of the teams in the fight for the Big West crown:</span></p>\n<p><b>UC Irvine, 12-4</b></p>\n<p><span style=\"font-weight: 400;\">The Anteaters held the top spot in the conference for the majority of the first half of the season before losing a couple toward the end of their non-conference schedule. Neck and neck with the Gauchos, Irvine has earned the mid-major No. 15 spot with a 12-4 record, placing the team second in the Big West. </span></p>\n<p><span style=\"font-weight: 400;\">The Eaters opened the year up 7-0 with big wins against Texas A&amp;M and Santa Clara. They followed it up with another impressive victory of 80-75 over Saint Mary’s College in late November but finished off their non-conference season with a pair of losses a month later. </span></p>\n<p><span style=\"font-weight: 400;\">Still, this Irvine team has a remarkable rotation with a dangerous and experienced duo of guards in the backcourt in, thanks to junior guards Evan Leonard and Max Hazzard who bolster Irvine’s deadly three-point attacks. Irvine’s 36.2 percent from deep is ideal when competing against the first-place Gauchos, who allow just 28.1 percent from the three, the 13th best in the NCAA.</span></p>\n<p><span style=\"font-weight: 400;\">UCI’s graduate forward Jonathan Galloway sits in the No. 2 spot of the Big West in rebounding with 7.3 boards per game while senior forward Elston Jones supports with 7.1 rebounds per game, fifth in the conference. The pair of big men patrol the paint as well as any frontcourt in the Big West, allowing just 66.6 points against per contest which ranks slightly below UCSB’s top mark of 64.3 average points allowed.</span></p>\n<p><span style=\"font-weight: 400;\">The Anteaters, who surrender just 38 percent of field goals from opponents, thrive on the defensive end with the best defensive shooting percentage in the Big West. This makes the Eaters the most significant threat against UCSB which currently shoots a conference best of 48.1 percent from the field this year.</span></p>\n<p><b>University of Hawaii, 9-5</b></p>\n<p><span style=\"font-weight: 400;\">Winners of three games straight, the Rainbow Warriors have emerged as legitimate contenders to make a run for the title of Big West Champion as they currently sit in third place heading into the latter half of the year. </span></p>\n<p><span style=\"font-weight: 400;\">Hawaii has a solid collective of starters that can score the ball well, as four players average double-figures in points led by junior guard Eddie Stansberry who posts 13.2 points per game following a 26-point performance against Alabama A&amp;M.</span></p>\n<p><span style=\"font-weight: 400;\">While Stansberry delivers the most scoring on average, it is sophomore guard Drew Buggs who strikes with a pass-first mentality. Buggs owns the second highest assists per game in the Big West, averaging 5.0 per contest. </span></p>\n<p><span style=\"font-weight: 400;\">Buggs has an array of weapons at his disposal with Stansberry running the wing but when the Warriors look to move the ball inside, junior Zigmars Raimo is the likely recipient.</span></p>\n<p><span style=\"font-weight: 400;\">Raimo, a Latvia native, rebounds at the fifth highest rate in the Big West with 7.1 boards per game while shooting 57 percent from the field, placing him as third in the conference. </span></p>\n<p><span style=\"font-weight: 400;\">Hawaii recorded statement wins against University of Colorado at Boulder and Utah earlier in the non-conference half of the season to build up its resume and makes an underdog run for the Big West title come conference play. </span></p>\n<p><b>Cal State Northridge, 6-10</b></p>\n<p><span style=\"font-weight: 400;\">Following a 6-24 season, one of the most disappointing years in program history, Cal State Northridge wiped the slate clean with the hire of first year Head Coach Mark Gottfried, in addition to adding former NBA Champion Mo Williams to the assistant coaching staff. </span></p>\n<p><span style=\"font-weight: 400;\">The new-look leadership is certainly a huge reason why the Matadors rank among the best offenses in the Big West, but without freshman phenom Lamine Diane, CSUN could be in the same position as the season prior.</span></p>\n<p><span style=\"font-weight: 400;\">Diane has catapulted CSUN into fourth place in the conference through his Big West best of 24.3 points and 11.1 rebounds per game. The freshman also ranks among the top defenders with 1.7 steals per game while blocking 2.3 shots on average, both coming in first in the Big West as well. </span></p>\n<p><span style=\"font-weight: 400;\">However, the CSUN attack doesn’t just rely on Diane’s two-way ability. While the freshman tops out the Big West as the No. 1 scorer, it is sophomore guard Terrell Gomez who delivers 18.4 points on average for the third best mark among Big West players. </span></p>\n<p><span style=\"font-weight: 400;\">Complementing Gomez in the backcourt, freshman guard Darius Brown II produces a play-making boost with 5.1 assists per contest, another first place in the Big West.</span></p>\n<p><span style=\"font-weight: 400;\">While Irvine is UCSB’s biggest threat on the defensive end, the Matadors are certainly the top threat on offense with their harrowing attack. CSUN ties UCSB in first with 77.8 points per game while passing the ball better than any other team in the Big West. </span></p>\n<p><span style=\"font-weight: 400;\">The only thing holding CSUN back? Its sluggish defense. The Matadors are last in opponent field goal percentage, allowing a massive 82.9 points per contest.</span></p>\n<p><span style=\"font-weight: 400;\">There may be some kinks to smooth out but CSUN is a contender for the long hall with a trio of young, ambitious attackers and new leadership at the helm.</span></p>\n<p><b>Long Beach State, 6-10</b></p>\n<p><span style=\"font-weight: 400;\">Tied for fourth in the conference with two other squads, the 49ers look to turn their season around come conference play. </span></p>\n<p><span style=\"font-weight: 400;\">Beach has relied on the dynamic offensive production by senior guard Deishuan Booker who has posted 14.2 points per contest, the third most in the Big West.</span></p>\n<p><span style=\"font-weight: 400;\">In the paint, redshirt senior center Temidayo Yussuf drags down 7.2 rebounds per game for the Niners as he contributes 12.9 points on average. Yussuf shoots at the seventh best rate in the Big West, knocking down 49.7 percent on field goals, but Long Beach still struggles offensively.</span></p>\n<p><span style=\"font-weight: 400;\">The Niners have shot just 41.7 percent from the field this season, the lowest mark in the Big West, while they fail to take care of the ball as well, with conference-high 16.0 turnovers per game. </span></p>\n<p><span style=\"font-weight: 400;\">While CSUN appears to be in first-place contention for years to come with a trio of talented young players, Long Beach seems to be searching for its next generation of studs as all three of its top leading scorers are seniors and will depart from the program next year.</span></p>\n<p><b>UC Riverside, 5-10</b></p>\n<p><span style=\"font-weight: 400;\">Talk about a team that can shoot the three well. Between junior guard Dikymbe Martin and sophomore forward Ajani Kennedy, the Highlanders have one of the most dangerous three-point duos in the Big West.</span></p>\n<p><span style=\"font-weight: 400;\">Martin is the only double-digit scorer on the Highlanders with 15.9 points per game as the fifth best scorer in the conference, but he also hits on 44.8 percent from behind the arc.</span></p>\n<p><span style=\"font-weight: 400;\">As for Kennedy, the sophomore out of Moreno Valley owns the most efficient three-point percentage in the conference, shooting 56.3 percent from deep along with his 7.5 points per game which is second on the Riverside roster. </span></p>\n<p><span style=\"font-weight: 400;\">Just a hundredth of a percent behind UC Irvine, Riverside is second in the Big West in shooting from the perimeter with 37 percent but struggles to get second chance opportunities on misses. </span></p>\n<p><span style=\"font-weight: 400;\">Nobody on the Highlanders roster brings down over 4.5 rebounds per game as UCR is the second worst rebounding team in the Big West, solely in front of last-place UC Davis.</span></p>\n<p><span style=\"font-weight: 400;\">Expect minimal post play while jumpers are hoisted from deep since the Highlanders shoot the most three-pointers in the Big West. But who can blame them? With a pair of spot-up shooters like Martin and Kennedy, all eyes should be around the perimeter. </span></p>\n<p><b>Cal Poly, 4-9</b></p>\n<p><span style=\"font-weight: 400;\">The Mustangs have hit a metaphorical wall in the world of Big West basketball. The last time Cal Poly had a winning team was during the 2012-13 season and coming off a 9-22 year, Poly showed that this season is more of the same. </span></p>\n<p><span style=\"font-weight: 400;\">It’s not all bad for the Mustangs who have a leader in senior point guard Donovan Fields who posts 15.8 points per game to go along with 4.3 assists.</span></p>\n<p><span style=\"font-weight: 400;\">Similarly, sophomore wing Mark Crowe is a dynamic threat from virtually anywhere on the floor as he shoots the fifth best rate from the field in the Big West while also splashing 51.6 percent from range, No. 2 in the conference. </span></p>\n<p><span style=\"font-weight: 400;\">However, much like the Highlanders, Cal Poly doesn’t have a solid facilitator to protect the restricted area in its strife to get rebounds. </span></p>\n<p><span style=\"font-weight: 400;\">Only two of Cal Poly’s four wins have come against Division I programs </span><span style=\"font-weight: 400;\">— </span><span style=\"font-weight: 400;\">one of those schools is playing its first season in Division I.</span></p>\n<p><b>Cal State Fullerton, 4-10</b></p>\n<p><span style=\"font-weight: 400;\">Coming off of a Cinderella Big West Tournament last season that ultimately landed them in March Madness, Fullerton loaded its front half of the season with difficult matchups throughout. </span></p>\n<p><span style=\"font-weight: 400;\">The Titans have a pair of two of the most effective scorers in the Big West as seniors [[senior guards]] Kyle Allman Jr. and Khalil Ahmad pose significant threats to any defense. Allman Jr. adds 18.5 points per game while Ahmad follows close behind with 18.2 on average. </span></p>\n<p><span style=\"font-weight: 400;\">With junior forward Jackson Rowe averaging 7.2 rebounds per game in the post, the third most in the Big West, Fullerton seems to have all the bases covered.</span></p>\n<p><span style=\"font-weight: 400;\">So, the lingering question remains: what the heck is this team doing wrong? My answer: playing teams that are, quite simply, better than them. Fullerton gets little to no production from its offense, barring the three aforementioned starters. </span></p>\n<p><span style=\"font-weight: 400;\">Yet, with a dangerous offense, don’t count out the Titans. CSUF looks like the ideal team to impede a playoff-hopeful team with its dynamic scoring duo, so make sure to remember the Titans when they face off against top teams in the Big West. </span></p>\n<p><b>UC Davis, 4-10</b></p>\n<p><span style=\"font-weight: 400;\">Sitting in dead last, the Aggies have suffered a heartbreaking year. Heading into 2018-19, Davis had eyed a repeat crown as Big West regular season champions.</span></p>\n<p><span style=\"font-weight: 400;\">The Aggies returned every starter from last year’s first place roster, but the results are drastically different. Davis hasn’t won a game on the road this season, going a shocking 0-7 when playing away this year. </span></p>\n<p><span style=\"font-weight: 400;\">With senior forward AJ John out with an injury halfway through the season, senior guard and 2017-18 Big West MVP TJ Shorts II is left to bear the scoring burden. His 14.2 points per game just haven’t been enough to carry the Aggies’ struggling offense, which scores only 62.9 points each contest, the least in the Big West.</span></p>\n<p><span style=\"font-weight: 400;\">The Aggies have trouble shooting from deep and have been unable to match teams on the boards with a -3.6 rebounding margin, another Big West Conference low. </span></p>\n<p><span style=\"font-weight: 400;\">On paper, the Aggies should be a fierce competitor with 2017-18 Coach of the Year Jim Les at the helm but on the hardwood, finding points have been slim pickings, something they hope will turn around come Big West play. </span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-85505\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-01-09/under-the-scope-2018-19-mens-basketball-big-west-preview/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-85505\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-01-09/under-the-scope-2018-19-mens-basketball-big-west-preview/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-01-09/under-the-scope-2018-19-mens-basketball-big-west-preview/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-01-09/under-the-scope-2018-19-mens-basketball-big-west-preview/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2019-01-09/under-the-scope-2018-19-mens-basketball-big-west-preview/","id":1070,"author":{"id":36,"name":"Max Kelton"},"related":[1069,1068,1067],"comments":[],"followers":[]},"author":{"id":36,"name":"Max Kelton","biography":"Not available","articles":[55,91,93,98,106,977,998,1001,1007,1009,1035,1038,1041,1042,1044,1045,1046,1064,1070,1077,1081,1083,1117,1125,1126,1154,1244,1247,1250,1252,1265,1270,1271,1328,1339,1341,1345,1350,1354,1355,1358,3396,4830,4833],"portrait":"Not available"},"related":[{"title":"Gauchos Sweep, Now Tied for First Place","category":"Sports","subcategory":"Softball","publish_date":"2014-05-05T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2014/05/softball2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2014/05/softball2.jpg?resize=980%2C647&ssl=1","description":"UCSB moves into tie for first place after sweeping UC Riverside.","content":"<div class=\"single-post-content\">\n            <p>This past weekend could not have gone any better for the UCSB softball team.</p>\n<p>Going into the weekend, the Gauchos knew they needed a sweep to stay in contention for a Big West Championship. Santa Barbara answered the call, winning all three games over UC Riverside in its last road trip of the season.</p>\n<p>In addition, UCSB received help from first-place Long Beach State, which dropped all three games at home to Cal Poly. As a result, the Gauchos move into a tie with the 49ers for first place. UCSB will host Long Beach next weekend in a series that will determine which team wins the title and an automatic berth to the NCAA Tournament.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p>Santa Barbara improves to 33-18 overall and 13-5 in conference while Riverside remains in the cellar of the Big West standings at 22-29 overall and 3-15 in league.</p>\n<p>“[This weekend] was critical,” junior pitcher Shelby Wisdom said. “We had to win, but we were also banking on Cal Poly beating Long Beach to have a better chance. So now that we’ve swept Riverside, we’re tied with Long Beach in first, so it’s pretty big.”</p>\n<p>After giving up 19 runs last weekend to Hawaii, Wisdom was back on her game. Wisdom gave up just four runs over the weekend, three earned, improving to 21-13 on the season. The win was the 62nd of her career, which ties Sandy Ortigies’ record set in 1987 for the most wins in Gaucho history.</p>\n<p>“Hawaii is a really strong hitting team, so I expected them to score off of me, but this weekend I worked on keeping the ball low,” Wisdom said.</p>\n<p>In yesterday’s 5-3 victory to clinch the series, UCSB jumped out to a 5-1 lead. However, in the closest game of the series, Riverside wasn’t going to allow the Gauchos an easy victory.</p>\n<p>With one out in the seventh inning, junior shortstop Kris DeAnda doubled to score freshman right fielder Sommer Wilson and cut the deficit to two runs. UCR continued to rally, putting two runners in scoring position, but could not come up with the hit to tie the game.</p>\n<p>Sophomore catcher MeShalon “Meme” Moore anchored Santa Barbara offensively, hitting 4-4 with two runs and two RBI. Wisdom also scored two runs on 2-3 hitting.</p>\n<p>“We know we can hit the ball and string in hits and have a strong defense,” Wisdom said. “That helped us having a really good defense this weekend.”</p>\n<p>Game two of Saturday’s double header saw a 3-0 victory for UCSB as the entire team got involved offensively. Wisdom went 3-4 at the plate while senior second baseman Kathryn Pilpil hit 2-3 with one run and one RBI. Senior first baseman Lauren Boser also went 1-2 with 2 RBI, and freshman left fielder Kristen Clark, who broke the single season hits record last weekend, hit 3-4.</p>\n<p>UCSB first got on the board in the third inning when Pilpil singled to score the eventual game-winning run. In the fifth, the Gauchos were able to get numerous runners on base due to Riverside sophomore pitcher Sophie Slagle walking batters. Three of her five walks came in this inning. With the bases loaded once again, Boser singled to center field, scoring two runners and clinching the game.</p>\n<p>Winning the first game 4-1, seven of 10 players in the Gauchos’ rotation got a hit and five had at least two hits as they outhit UCR 13-5.</p>\n<p>“It’s really important that all of us were hitting, moving runners and scoring them,” Wisdom said. “It helps a lot and helps us score more easily.”</p>\n<p>Unlike the final two games, the Highlanders got on the board first. Their best hitter, senior center fielder Dionne Anderson, singled and stole second before junior first baseman Karina Romero singled up the middle to score Anderson. During Saturday’s double header, Anderson was 4-5 with one run while Romero hit 4-6 with one RBI.</p>\n<p>The lead was short-lived, however, as UCSB evened the score in the second inning. Pilpil singled, Boser was hit by a pitch and freshman shortstop Emily Brucelas walked to load the bases. Then, freshman center fielder Stacy Cavazos was also hit by a pitch to score Pilpil.</p>\n<p>The Gauchos added two additional runs in the fourth and fifth innings before putting the Highlanders away in the sixth inning with a home run from Wisdom, her sixth of the year.</p>\n<p>UCSB will play its final series of the season next weekend at home against Long Beach.</p>\n<p> </p>\n<p><em>A version of this article appeared on page 6 of May 4th’s print edition of The Daily Nexus.</em></p>\n<p><em>Photo by Dustin Harris of The Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-55145\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-05/gauchos-sweep-now-tied-for-first-place/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-55145\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-05/gauchos-sweep-now-tied-for-first-place/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-05/gauchos-sweep-now-tied-for-first-place/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-05/gauchos-sweep-now-tied-for-first-place/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2014-05-05/gauchos-sweep-now-tied-for-first-place/","id":1067,"author":{"id":71,"name":"Kristen Henneman"},"related":[1066,1065,1064],"comments":[],"followers":[]},{"title":"Same Blood, Same Team, Opposite Personalities","category":"Sports","subcategory":"Softball","publish_date":"2014-05-07T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/05/softball-sisters.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/05/softball-sisters.jpg?resize=610%2C450&ssl=1","description":"Sisters DeJanee and Meme Moore Work Together For UCSB, Bringing Different Styles to the Field.","content":"<div class=\"single-post-content\">\n            <p>Taking a quick glance at the UCSB softball roster, you might notice there are two players with the last name of Moore.</p>\n<p>Don’t worry, you’re not seeing double. This season, the Gauchos feature a pair of sisters on their roster: DeJanee and Meme Moore.</p>\n<p>Although DeJanee is a junior and Meme a sophomore, this year marks the first time the sisters are playing together in a UCSB uniform as both redshirted last year.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p>“I really like playing with my sister because your team is your family and I literally have that,” DeJanee said. “It’s a really special thing to be able to play by my sister and see her do well. No one really gets to say they’ve played with their sister at the DI level.”</p>\n<p>The two are nearly inseparable. Not only do they go to school and play together, but they live together as well.</p>\n<p>“There’s only one time we’ve been apart and that’s when I was a senior in high school and she was a freshman in college,” Meme said. “That was actually really hard for me because she’s always been with me. For the first week she was gone, I slept in her bed.”</p>\n<p>As Sacramento natives, DeJanee and Meme have played softball together their entire lives and in 2011, won a Sac-Joaquin Section Division I Championship together at Sheldon High School.</p>\n<p>“I think we batted back-to-back (in high school), so it was the Moore duo,” DeJanee said. “It was cool to share that moment with her. [Playing together isn’t] new to us. Over the years, we’ve gotten closer. I don’t think when we were younger we liked it very much.”</p>\n<p>The sisters even committed to UCSB at the same time, deciding to play softball in Santa Barbara when DeJanee was 15 and Meme was 14.</p>\n<p>“She wanted to go to the same school as me, but I [originally] didn’t, being with her all the time,” Meme said. “Plus, we committed early, so we weren’t as close as we are now. I wanted to go to a different school and branch out and get my space, but it worked out.”</p>\n<p>Nevertheless, despite their closeness and genetics, the Moore sisters have very different personalities and are extremely different players.</p>\n<p>“Their personalities are so different; that’s what makes it even more fun,” Head Coach Brie Galicinao said. “They live together and to hear them talk with each other, there’s a mutual respect and love, but they also give each other a hard time. It’s fun to see.”</p>\n<p>DeJanee is energetic and the leader of the two sisters while Meme is more calm and laid-back.</p>\n<p>Their personality differences are exhibited through their choice of majors too. DeJanee is a communication major while Meme is pursing art.</p>\n<p>“I can remember back to when they came to one of our camps. They had already committed and this was the first time really working them,” Galicinao said. “I think Dej was at third and Meme was at shortstop and [DeJanee] was on [Meme] about not talking enough. She was like, ‘You need to be talking loud enough. Coach Brie wants someone who’s loud.’ And [Meme] just looked at her and was like, ‘See how mean she is to me?’ It was funny.”</p>\n<p>These differences also translate onto the softball field. Meme will be found behind home plate as Santa Barbara’s catcher while DeJanee is listed as a utility player for UCSB, mostly playing different positions in the infield.</p>\n<p>DeJanee is known as a quicker player offensively, ranking second on the team in on-base percentage. She is often used as a designated hitter for the Gauchos as well.</p>\n<p>Meanwhile, Meme is more of a power-hitter, ranking second on the team in runs, third on team in hits and leading the team in doubles. This past week, Meme was named Big West Field Player of the Week after posting an .800 slugging percentage, .600 batting average and four runs in UCSB’s sweep over UC Riverside. She also hit 4-4 in Sunday’s game to clinch the series and move into a tie with Long Beach State.</p>\n<p>“Meme is a more relaxed player,” DeJanee said. “She’s super calm and I’m a person that gets really nervous and anxious. We’re totally opposites, especially hitting.”</p>\n<p>While siblings who are on the same team have the potential to create drama, playing different positions has allowed the Moore sisters to avoid any rivalry.</p>\n<p>“I just remember the one time my child ball coach tried to make my sister a catcher,” Meme said. “I was like, ‘No. She can’t play my position.’”</p>\n<p>Playing the same position didn’t last long. DeJanee quickly returned to the infield, allowing the Moore sisters to support each other in a way only a sibling bond can. With such different personalities, DeJanee and Meme play off each other well. They know how to support and complement each other on the field.</p>\n<p>“We know each other the best, so when I tell her something, it’s because I know what she’s doing and I know I can help her,” DeJanee said. “That’s what I like about having my sister on the team. She knows me and she’s that person I can go to no matter what.”</p>\n<p>This weekend, UCSB has the opportunity to win a Big West Championship. Building off the Moore sisters’ energy and belief in each other might just give UCSB the edge it needs to take it all.</p>\n<p> </p>\n<p><em>A version of this article appeared on page 9 of May 7th’s print edition of The Daily Nexus.</em></p>\n<p><em>Photos by Dustin Harris and Anna Kodelashvili of The Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-55182\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-07/same-blood-same-team-opposite-personalities/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-55182\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-07/same-blood-same-team-opposite-personalities/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-07/same-blood-same-team-opposite-personalities/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-07/same-blood-same-team-opposite-personalities/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2014-05-07/same-blood-same-team-opposite-personalities/","id":1068,"author":{"id":71,"name":"Kristen Henneman"},"related":[1067,1066,1065],"comments":[],"followers":[]},{"title":"Gauchos Face Long Beach State With NCAA Tournament Berth at the Line","category":"Sports","subcategory":"Softball","publish_date":"2014-05-08T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2014/05/Softball_vsHawaii-DustinHarris-04272014-09.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2014/05/Softball_vsHawaii-DustinHarris-04272014-09.jpg?resize=980%2C647&ssl=1","description":"UCSB battles Long Beach State as both teams are tied atop the Big West Conference standings entering the last week of the season.","content":"<div class=\"single-post-content\">\n            <p>The long-awaited showdown is finally here.</p>\n<p>The top two teams in the Big West square off this weekend at Campus Diamond in a battle for the Big West Championship and a ticket to the NCAA tournament.</p>\n<p>For the UCSB softball team, the math is simple. Entering the final series of the year at 33-18 overall and 13-5 in the Big West, Santa Barbara is tied for first in the league standings. If the Gauchos win the series, they win their first-ever conference title. If not, they go home with nothing.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p>“It’s a better feeling that it’s on us to win instead of having to rely on other teams to lose or to beat other teams,” junior pitcher Shelby Wisdom said. “It’s in our hands. It’s our last weekend at home and it’s our last series in conference, so we’re going to play with our hearts and go all out. We just to have to know that we’re better and that we can do it.”</p>\n<p>Long Beach travels to Santa Barbara at 36-16 overall and 13-5 in conference. Third-place Cal Poly also figures into the mix, just one game behind both the Gauchos and 49ers. The Mustangs play last-place UC Riverside this weekend.</p>\n<p>While both Santa Barbara and CSULB stand atop the standings, it is the Gauchos that carry the momentum as winners of 12 of their last 14 games. UCSB will also have the advantage of playing at home for its seniors with Senior Day on Sunday. Long Beach, on the other hand, was swept by Cal Poly last weekend to lose control of its lead in the conference standings.</p>\n<p>“We’re all really excited. Even at practice today, we had a big team talk about how we want to see our name on that selection show on Sunday,” junior third baseman Jenessa Jeppesen said. “We have to take it one game at a time.”</p>\n<p>After sweeping Riverside last weekend, sophomore catcher Meme Moore was named Big West Field Player of the Week. Moore had an incredible series, tallying a slugging percentage of .800 and a batting average of .600. In the series finale, she hit 4-4 with two runs and two RBI. Moore is currently tied for first in the Big West in doubles with 13.</p>\n<p>Last weekend, Wisdom was on her game as well, as she gave up just three earned runs in the circle while hitting 6-10 from the plate with three runs and one RBI on the offensive end.</p>\n<p>At 21-13, Wisdom is approaching an important milestone this weekend. Currently tied with Sandy Ortigies for most career wins at 62, Wisdom could etch her name into the UCSB record books with a win against Long Beach. Ortigies’ record has stood since 1987.</p>\n<p>“Honestly, the record doesn’t really matter to me unless we get those two wins,” Wisdom said. “I’m only a win away and that one win won’t matter. We need [two].”</p>\n<p>One thing these two teams have in common is that offense can come from anyone. Last weekend, the Gauchos’ offensive success was a team effort. In game one, for example, seven of 10 players in the Santa Barbara lineup got a hit and five had at least two hits.</p>\n<p>One of Santa Barbara’s biggest offensive weapons is freshman left fielder Kristen Clark, who leads the league in batting average (.432) and in hits (83). The lead-off hitter leads the league in hits by a large margin with the second-ranked player with 67, 16 less than Clark. Two weekends ago against Hawaii, she broke the single-season UCSB hits record previously owned by Assistant Coach Christine Ramos.</p>\n<p>“It helps a lot when we get our bunts down and move runners around,” Wisdom said. “Hitting is contagious, so once one person gets a hit, the next person can get a hit easier.”</p>\n<p>The 49ers’ success also relies on offensive production from multiple players. Senior second baseman Cya Neal is tied for third in the Big West in runs and ranks fifth in hits, while sophomore left fielder Darian Tautalafua sits in fifth in conference in runs. Furthermore, junior shortstop Shayna Kimbrough ranks fourth in conference in hits and third in batting average. Teammate and senior right fielder Sarah Carrasco is tied for first with Meme Moore in doubles. Senior catcher Karli Sandoval and senior first baseman Ashlynn Booker sit in third and fifth in league in RBI, respectively. Booker also ranks sixth in home runs.</p>\n<p>As a team, Long Beach leads the league in runs, hits, RBI, batting average and on-base percentage.</p>\n<p>“They can read the defense well, so we need to make sure we don’t let them read us,” Wisdom said. “[Long Beach wants] exactly what we want, so they’re going to come out and compete and we need to be ready for it.”</p>\n<p>Defensively, senior Erin Jones-Wesley is LBSU’s top-pitcher. Her ERA of 2.96 ranks third in the Big West. UCSB, meanwhile, will counter with Wisdom, who ranks fifth at 3.17.</p>\n<p>The 49ers also have depth in their bullpen and will look to junior Amanda Hansen as well, who ranks just behind Wisdom in ERA at 3.17.</p>\n<p>“The biggest thing for us is taking it one pitch at a time,” Jeppesen said. “We need to not get too excited and stay composed and play our best.”</p>\n<p>First pitch is set for noon tomorrow. After tomorrow’s double-header, the series will wrap up Saturday with game three beginning at noon.</p>\n<p> </p>\n<p><em>A version of this article appeared on pages 1 and 6 of May 8, 2014’s print edition of </em>The Daily Nexus.</p>\n<p><em>Photo by Dustin Harris of </em>The Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-55214\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-08/gauchos-face-long-beach-state-with-ncaa-tournament-birth-at-the-line/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-55214\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-08/gauchos-face-long-beach-state-with-ncaa-tournament-birth-at-the-line/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-08/gauchos-face-long-beach-state-with-ncaa-tournament-birth-at-the-line/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-05-08/gauchos-face-long-beach-state-with-ncaa-tournament-birth-at-the-line/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2014-05-08/gauchos-face-long-beach-state-with-ncaa-tournament-birth-at-the-line/","id":1069,"author":{"id":71,"name":"Kristen Henneman"},"related":[1068,1067,1066],"comments":[],"followers":[]}]},"__N_SSG":true}