{"pageProps":{"article":{"title":"UCSB Ready to Reclaim Big West Crown","category":"Sports","subcategory":"Soccer","publish_date":"2013-08-28T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2013/08/JakeCollins_MSoccer_100512_302.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2013/08/JakeCollins_MSoccer_100512_302.jpg?resize=980%2C647&ssl=1","description":"After missing the postseason for the first time in six seasons after injuries rattled the squad, the UCSB men’s soccer team looks to once again return to its place atop the Big West Conference this ...","content":"<div class=\"single-post-content\">\n            <p>After missing the postseason for the first time in six seasons after injuries rattled the squad, the UCSB men’s soccer team looks to once again return to its place atop the Big West Conference this season. Picked to finish first in the Big West North Division by the media, the Gauchos enter this season with one goal in mind: Improvement.<br>\n“We have high expectations, but I feel like the expectations are based off of getting the players back who were hurt and the addition of some very, very good young players who I think are going to help us right away,” Head Coach Tim Vom Steeg said. “I think those two ingredients are going to help us do very well this year.”<br>\nHeadlining the returning Gauchos is senior defensive midfielder Fifi Baiden who garnered All-Big West First Team honors last season. Once again picked by the media as All-Big West in the preseason, Baiden will anchor a defensive backline that will be the strength of the Gauchos this season.<br>\n“Our back line is our strength. We have experience and we’ve played in so many games together,” Baiden said. “It’s actually really good for the team in terms of communicating and helping the new players to settle in with the team. It’s going to be the key for us this year.”<br>\nAlso named as the No. 38 player in the entire country by TopDrawerSoccer.com, Baiden will look to lead the Gauchos this season with his usual defensive oriented play.<br>\n“It’s fun to be recognized and it shows that you’re doing something good,” Baiden said. “My philosophy, personally, I see myself as a team guy. I don’t want to force myself to do anything to hurt the team. Being recognized nationally also gives me the hope that I am not doing a bad job.”<br>\nJoining Baiden on the preseason list for top players nationwide includes senior forward Achille Campion at No. 100. Campion missed much of last year due to injury but will be the focus of the offensive attack this season for Santa Barbara.<br>\n“Our leading goal scorer literally would have been Campion, and of course, he got hurt some games in the season,” Vom Steeg said. “We anticipate him having a real big season for us. [Senior midfielder] Goffin Boyoko is another player who played hurt all last year. He’s another player who will give us goals.”<br>\nWhile defense certainly seems to be the strength for the Gauchos, it will be up to the pair of seniors in Boyoko and Campion, along with a talented group of newcomers to give the offensive attack some new life that was missing last season.<br>\nIncluded in the list of newcomers expected to contribute immediately are junior forward Reed McKenna, a transfer from UCLA, and a pair of freshman in midfielder Paul Ehmann and forward Ismaila Jome.<br>\n“We’re a bigger team (than last season),” Vom Steeg said. “We have a couple of players who can serve the ball very well and I think when you put that mix together, we’re going to be able to get some goals off of set pieces.”<br>\nUCSB plays its first regular season game against No. 19 Northwestern University on Friday in Evanston, Illinois. Kickoff is scheduled for 5 p.m. Pacific Time.</p>\n<p><em>This article is an online exclusive and did not appear in the print edition of </em>The Daily Nexus.</p>\n<p><em>Photo by Jake Collins of</em>The Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-51812\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/ucsb-ready-to-reclaim-big-west-crown/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-51812\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/ucsb-ready-to-reclaim-big-west-crown/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/ucsb-ready-to-reclaim-big-west-crown/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/ucsb-ready-to-reclaim-big-west-crown/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2013-08-28/ucsb-ready-to-reclaim-big-west-crown/","id":1626,"author":{"id":72,"name":"Paul-Michael Ochoa"},"related":[1625,1624,1623],"comments":[],"followers":[]},"author":{"id":72,"name":"Paul-Michael Ochoa","biography":"Not available","articles":[254,318,354,366,518,519,527,533,535,538,539,546,548,551,554,555,558,561,567,570,574,576,577,578,589,592,594,596,605,609,613,618,623,630,633,638,640,647,650,651,653,654,656,660,661,668,670,673,677,683,694,700,703,706,708,710,717,719,724,727,798,809,814,828,833,847,849,851,853,854,856,857,858,863,867,868,870,874,877,879,880,882,884,886,887,889,892,894,899,900,902,904,905,915,920,1259,1565,1566,1567,1568,1569,1570,1571,1575,1578,1581,1583,1584,1587,1590,1591,1594,1599,1601,1603,1606,1607,1608,1611,1623,1626,1652,1666,1668,1669,1670,1674,1675,1685,1689,1691,1692,1697,1762,1763,1765,2063,2069,2095,2142,2158,3169,3185,3190,3226,3229,3231,3232,3238,3244,3249,3256,4448,4494,4522,4523,4524,4526,4531,4539,4541,4544,4545,4546,4549,4550,4551,4554,4567,5189,5193,5194,5209,5396,5399,5400,5402,5403,5404,5405,5406,5407,5409,5417,5418,5419,5420,5421,5422,5423,5424,5425,5426,5427,5428,5429,5430,5431,5436,5448,5449,5450,5502,5530,5536],"portrait":"Not available"},"related":[{"title":"Friday Night: It’s Going to Be Loco","category":"Sports","subcategory":"Soccer","publish_date":"2013-09-26T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2013/09/M-Soccer-by-Cedar-Lay.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2013/09/M-Soccer-by-Cedar-Lay.jpg?resize=980%2C647&ssl=1","description":"Don't miss the Gauchos take on Stanford this Friday night in the first home game of the year.","content":"<div class=\"single-post-content\">\n            <p>UCSB is an exciting place to go to school, but there are few events every year that really get the students going, more so than usual. Friday night is going to be one of those eventful nights as the UCSB men’s soccer team is set to face Stanford at Harder Stadium where record crowds are expected.<br>\nTraditionally, the first soccer home game after students move in is always a must-go event. This year is no exception as the Gauchos take on a prominent opponent in the Cardinal, and all of campus is abuzz in anticipation of Friday night’s match.<br>\n“Everyone is fired up for this game,” senior midfielder Fifi Baiden said. “Anytime we have a game at Harder Stadium it’s like we have this switch on. We receive most of our energy from the crowd.”<br>\nEntering the contest with a 4-3 record, UCSB must face a tough Stanford squad (4-1-1 on the season) that is set to spoil what looks to be one of the marquee matchups for the Gauchos this season.<br>\nThe last time UCSB faced such a well-known team on the first game following student move in was back in 2010 when the Gauchos set an NCAA on-campus record with 15,896 fans in attendance in a 2-0 victory against UCLA. Record crowds make sense when factoring in that UCSB has led the nation in attendance for six consecutive seasons.<br>\n“Friday is a huge game for us, and it’s one of the games that we need to have to keep our season going forward,” Baiden said. “Looking back on the UCLA game, it was really, really great to play under that crowd and it gives us that extra edge to go extra hard and play well. It’s going to be good for us in terms of energy, in terms of confidence, in terms of giving it all on the field.”                                                  Despite falling to New Mexico 1-0 and allowing a goal with 12 seconds left to play in overtime, the Gauchos are playing well and that all starts on the defensive side of the ball. Baiden stars alongside a trio of senior defenders in Peter Schmetz, Daniel Welsh and Matt Glodack to form a stingy backline that has allowed seven goals in seven games this season.<br>\nWith freshman goalkeeper Josh McNeely in between the posts, UCSB’s defense has allowed one goal each of the last four games, with McNeely allowing a mere four goals in five starts.<br>\nWhile defense has been key for the Gauchos, the offensive production has seen rocky moments at times this season. Despite the efforts of a pair of seniors in forward Achille Campion and Goffin Boyoko, the Gaucho offense has failed to score in three separate occasions, the team’s only losses of the year. Campion and Boyoko are tied for the team lead in goals with three apiece.<br>\n“We have five freshmen who have been starting. We lost a lot of the goals that were scored last year, those players graduated or became professional players,” Head Coach Tim Vom Steeg said. “We’re having to find a different way of scoring this year and it has just taken some time. The younger players have gotten better every single game and we’re hoping that our seniors start to become consistently dangerous in front of the net.”<br>\nStanford, meanwhile, has won four straight, allowing one goal during that span. The Cardinal are led by senior goalkeeper Drew Hutchins who has allowed six goals in six starts, and are paced on the offensive end by junior forward Zach Batteer, as he has scored an impressive four of Stanford’s nine goals.<br>\nEven when considering Stanford’s talent on both sides of the ball, UCSB seems less dependent on talent and more so on energy that will fuel the team’s confidence entering Friday night.<br>\n“There’s just very few events that happen at UCSB where everyone can show up to one place,” Vom Steeg said. “It’s the one event where everyone at UCSB can come out and throw on a yellow shirt and cheer on our team. I think that makes the event special, it’s what makes UCSB special.”<br>\nOne thing is clear about the UCSB men’s soccer team entering Friday night. They want every single member of the UCSB community in attendance when they take the field against Stanford. It is, after all, another chance to make history.<br>\n“This is one of those moments where everyone can come together and cheer for our school and cheer for us to win the game. I would basically tell everyone don’t miss it,” Vom Steeg said. “Anyone who was at the UCLA game three years ago probably wishes there were more events like that because obviously that was a real special night. You want to be a part of that.”<br>\nFriday’s epic match is scheduled to begin at 7 p.m. at Harder.</p>\n<p><em>A version of this article appeared on pages 1 and 8 of September 26, 2013’s print edition of </em>The Daily Nexus.</p>\n<p><em>Photo by Cedar Lay of </em>The Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-52051\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-09-26/friday-night-its-going-to-be-loco/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-52051\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-09-26/friday-night-its-going-to-be-loco/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-09-26/friday-night-its-going-to-be-loco/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-09-26/friday-night-its-going-to-be-loco/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2013-09-26/friday-night-its-going-to-be-loco/","id":1623,"author":{"id":72,"name":"Paul-Michael Ochoa"},"related":[1622,1621,1620],"comments":[],"followers":[]},{"title":"Gauchos Look Strong on the Backline","category":"Sports","subcategory":"Soccer","publish_date":"2013-08-28T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2013/08/CedarLay_WSoccer_8_24_2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2013/08/CedarLay_WSoccer_8_24_2.jpg?resize=980%2C647&ssl=1","description":"A new season with a different attitude brings a new motto: Believe. That is the saying going around the UCSB women’s soccer team this year and that which the players have embraced as they prepare fo...","content":"<div class=\"single-post-content\">\n            <p>A new season with a different attitude brings a new motto: Believe. That is the saying going around the UCSB women’s soccer team this year and that which the players have embraced as they prepare for the start of the season.<br>\nAn aggressive mentality and gritty play on the field, as well as the new motto, will be the backbone for this UCSB team.<br>\n“I think we have as reasonable a shot as everyone else,” Head Coach Paul Stumpf said. “All the big teams in the Big West are so close that on any given day one person can kind of turn the other over. I think we have just as good of a shot as anyone just as long as we stay healthy.”<br>\nUCSB comes in with the goal of qualifying for the Big West Conference Tournament for the first time since 2009. Last season, Santa Barbara finished in ninth place in the league with only seven points earned in total.<br>\nThis season UCSB was picked to finish sixth in the Big West Conference Coach’s Poll. However, the Gauchos will have to stay healthy and overcome a lack of goal scoring that plagued the team last season. Although four players underwent offseason surgery and will not be ready for the early part of the season, the majority of the team enters in strong shape and focused on avoiding injury.<br>\n“We don’t want to have as many injuries as we did last year,” senior defender Lindsay Gankema said. “We all came in fit, which helped and we’re going to work in the weight room.”<br>\nSanta Barbara managed only 19 goals last season, the fewest in the entire league. Because of an inability to finish on many scoring opportunities, 13 new players were brought in this year with the intention of creating plays on offense and putting the ball on frame.<br>\n“A lot of them have different personalities on the field, meaning they have different styles of play,” junior midfielder Indiana Mead said. “I think they’re really technical, so they bring a new spark on the team we definitely needed.”<br>\nAdded playing time will also give experience to the freshman and add depth to offset potential injury down the stretch. Although the new freshman will try to make an impact early on, team chemistry is still something that the Gauchos have to develop in the first month of their non-conference schedule as they prepare for league play beginning in October.<br>\n“We’re working on [chemistry] because chemistry is important,” Gankema said. “I wouldn’t say it is necessarily hard but it’s going to take a little bit of time.”<br>\nThe blueprint for the Gauchos’ success this season centers primarily on the defensive end of the pitch. Four seniors will play defense for the Gauchos including twin sisters Paige and Lindsay Gankema and center back Taylor Gehring, who returns from injury this season. Four-year starting goalkeeper Makenna Henry, who played injured for a large portion of last season, will command the posts again this year.<br>\n“Defensively we will be very strong …  most of us have been really close on and off the field and we already have that chemistry,” Gankema said. “We all work really well together, we read each other very well and get back for each other and that makes us strong.”<br>\nUCSB plays 11 non-conference matches with its first conference game at home against UC Irvine on Oct 4.</p>\n<p><em>A version of this article appeared on page 16 of August 28, 2013’s print edition of </em>The Daily Nexus.</p>\n<p><em>Photo by Cedar Lay of </em>The Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-51807\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/gauchos-look-strong-on-the-backline/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-51807\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/gauchos-look-strong-on-the-backline/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/gauchos-look-strong-on-the-backline/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2013-08-28/gauchos-look-strong-on-the-backline/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2013-08-28/gauchos-look-strong-on-the-backline/","id":1624,"author":{"id":65,"name":"Mark Salay"},"related":[1623,1622,1621],"comments":[],"followers":[]},{"title":"UCSB to Play First Big West Home Games","category":"Sports","subcategory":"Soccer","publish_date":"2012-10-05T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"This weekend holds a couple of firsts for the No. 4 UCSB men’s soccer team. Not only will the Gauchos play their first games at home since the arrival of students for fall quarter, but they will als...","content":"<div class=\"single-post-content\">\n            <p>This weekend holds a couple of firsts for the No. 4 UCSB men’s soccer team. Not only will the Gauchos play their first games at home since the arrival of students for fall quarter, but they will also play their first conference home matches when they host UC Irvine tonight and Cal State Northridge Sunday.</p>\n<p>At 7-0-3 overall, and 1-0-1 in the Big West, Santa Barbara ranks second in the Big West behind Sacramento State. The perfect start is the best since 2004 when the Gauchos went 12 games without a loss.</p>\n<p>“We’re happy to be undefeated, but we have two big games at home and we need two wins,” junior midfielder Fifi Baiden said.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p>UCSB will also be defending a near-perfect home record of 3-0-1. With six of its next seven games at home, the Gauchos should take advantage of playing at Harder Stadium.</p>\n<p>“It’s always fun to play on your home soil,” Baiden said. “You get the fans behind you. Whatever you have to do to get a win, you do.”</p>\n<p>In tonight’s matchup against rival UC Irvine, Santa Barbara will once again be looking for redemption. The Anteaters won both matches last season and are back-to-back Big West Champions, stealing the title from the Gauchos both times.</p>\n<p>Yet this year the Anteaters are struggling. The team holds a 3-7-1 overall record and is currently 0-2 in conference. Having lost five straight games, the Anteaters are hungry for a win, desperately needing to gain some type of momentum. “They’re a team that I think is fighting for their season on Friday night,” Head Coach Tim Vom Steeg said. “They’ve lost two league games and they’re hoping in one game they can turn things around. For them, that has to happen on Friday night.”</p>\n<p>This week, the focus has returned to the offense for the Gauchos. While UCSB was shut out for the fifth time this season last weekend against Cal State Fullerton, Santa Barbara has plenty of offensive weapons.</p>\n<p>Senior midfielder Nic Ryan ranks second in the Big West in game-winning goals with three and junior forward Dom Sarle is tied for second in conference in assists with four.</p>\n<p>“The key [against Irvine] is our offense,” Baiden said. “This week’s practice was about getting chances in the final third and being aggressive. We also have to play to our playmakers.”</p>\n<p>On Sunday, UCSB will see one of the tougher teams in conference. Northridge begins the weekend at 7-4 overall and ranks third in the Big West with a 1-1 conference record.</p>\n<p>Like the Gauchos, the Matadors are an offensive-minded team. Northridge puts up the most shots in the Big West with nearly 19 per game. They also average 2.18 goals per game, just slightly behind UCSB, which scores 2.3 goals per game.</p>\n<p>“The key to their success has been their ability to score goals,” Vom Steeg said. “They have at least two players that if you give them an open shot, they can hit the ball very well and they’re comfortable around the net.”</p>\n<p>In fact, Northridge currently holds two of the best scorers in the Big West. Sophomore forward Sagi Lev-Ari leads the Big West in goals with nine and sophomore forward Edwin Rivas is tied for second in points with six goals and one assist.</p>\n<p>“If those players get isolated or are left open, then they can hurt you,” Vom Steeg said. “Defensively, our emphasis will be on knowing where they are and [making sure] they’re picked up so that they have to work hard to get the ball and create opportunities.”</p>\n<p>Kickoff against UC Irvine is set for 7 p.m. tonight. Sunday’s game against Northridge is scheduled for 5 p.m.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-47968\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2012-10-05/ucsb-play-big-west-home-games/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-47968\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2012-10-05/ucsb-play-big-west-home-games/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2012-10-05/ucsb-play-big-west-home-games/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2012-10-05/ucsb-play-big-west-home-games/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2012-10-05/ucsb-play-big-west-home-games/","id":1625,"author":{"id":71,"name":"Kristen Henneman"},"related":[1624,1623,1622],"comments":[],"followers":[]}]},"__N_SSG":true}