{"pageProps":{"article":{"title":"Blast From the Past: Rookie Flashbacks of Today’s NBA Stars","category":"Sports","subcategory":"Columns/Features","publish_date":"2017-10-19T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?resize=980%2C623&ssl=1","description":"The 2017-18 NBA season is among us. With there being a slew of rookie talents making their debuts this season, it was only right to look back at the first time today's superstars stepped onto the cour...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_79184\" style=\"width: 1657px\" class=\"wp-caption aligncenter\"><a href=\"http://dailynexus.com/?attachment_id=79184\" rel=\"attachment wp-att-79184\"><img aria-describedby=\"caption-attachment-79184\" data-attachment-id=\"79184\" data-permalink=\"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/nbablogbig/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?fit=2048%2C623&amp;ssl=1\" data-orig-size=\"2048,623\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"nbablogbig\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?fit=250%2C76&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?fit=888%2C271&amp;ssl=1\" class=\" wp-image-79184\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig-1024x312.jpg?resize=888%2C271\" alt=\"\" width=\"888\" height=\"271\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?resize=1024%2C312&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?resize=250%2C76&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?resize=768%2C234&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?w=2048&amp;ssl=1 2048w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/10/nbablogbig.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-79184\" class=\"wp-caption-text\">Kevin Chan / Daily Nexus</p></div>\n<p>An essence of nostalgia permeated my mind a day before the 2017-18 NBA season tipped off Tuesday night. The initial thought was to join the wave of “bold predictions” concerning who would be this year’s NBA champion, MVP, scoring champion, Rookie of the Year, etc.<br>\nBut then it hit me.<br>\n“How did today’s NBA stars fare in each of their debuts?”<br>\nThe talent of current NBA rookies Lonzo Ball, Markelle Fultz, Jayson Tatum, De’Aaron Fox, Ben Simmons and others has brought about one of the most hyped draft classes in years, possibly since the 2003 NBA Draft. Now, it’s time to explore the journeys of players who were once in their shoes and are now at the top of the game.<br>\nIn honor of the return of NBA basketball, here is a list of today’s biggest names and how they did in their introductions to the league.</p>\n<p><strong>LeBron James: Oct. 29, 2003 – Cleveland Cavaliers vs. Sacramento Kings</strong><br>\nIt was during LeBron James’s senior year of high school at St. Vincent-St. Mary’s that he tattooed “Chosen 1” on his upper back after being featured on the cover of Sports Illustrated. Getting such ink is likely something many would deem as risky, but “King James” has lived up to the moniker as one of the best ever, as he just began his 15th NBA season.<br>\nStill, to this day, we have yet to see any other high school player with the buzz LeBron had leading up to his NBA arrival.<br>\nLeBron didn’t disappoint in his first NBA game, finishing with a stat line of 25 points, nine assists, six rebounds and four steals in 42 minutes of play, but was defeated 106-92.<br>\nThe chase for ring No. 4 has begun. With no Kyrie Irving and the additions of Dwyane Wade, Isaiah Thomas, Derrick Rose and others, another tough journey lies ahead for King James and the Cavs, as it’s logical to assume that they have one thing on their minds: to find a way to defeat the Golden State Warriors.</p>\n<p><strong>Steph Curry: Oct. 28, 2009 – GS Warriors vs. Houston Rockets</strong><br>\nAt the core of the Warriors’ dethronement of the King and co. in two of the last three NBA Finals series is Stephen Curry. It’s no question that Curry is the greatest shooter of all time. From breaking the NBA’s single-game record of three-pointers made with 13 last season to surpassing the NBA’s single-season record for three-pointers made a total of three times, in addition to becoming the only player to ever make 300 and 400-plus threes in a season, Curry’s numbers need no explanation.<br>\nKnown for his sharpshooter ability at Davidson College, Curry’s first NBA game was a convincing performance. It was an efficient game by Curry, as he went 7-of-12 from the field to score 14 points, dished out seven assists and snagged four steals in a narrow 108-107 loss. Most surprisingly, he went 0-1 from beyond the arc. Aren’t we grateful that the world of analytics wasn’t as prevalent then as it is today? Boy, would they have been proven wrong.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p><strong>Giannis Antetokounmpo: Oct. 30, 2013 – Milwaukee Bucks vs. NY Knicks</strong><br>\nThe youngest player of the 2013 NBA Draft, the then 18-year-old Giannis Antetokounmpo was a mystery for most coming out of the Greek professional basketball club Filathlitikos.<br>\nHis body and build showed signs of a stretch forward who had the length yet lacked the bulk. Uncertainty loomed even more after Antetokounmpo played just 4:43 minutes and scored one point from the free-throw line with no shot attempts in his NBA debut, which concluded with a 90-83 defeat.<br>\nBut that performance wasn’t the end of the tale for Antetokounmpo.<br>\nIt was the start of a star whom we all know as “The Greek Freak.”<br>\n“The Greek Freak, I think, is a force. I’ve never seen anything like him. His ceiling is probably … he could end up being the best player to ever play if he really wanted to. That’s pretty scary to think about. He’s by far my most favorite player to watch.”<br>\nThose are the words of Golden State’s Kevin Durant, who made such claims in a video on his YouTube channel.<br>\nThey’re words that were earned, as Antetokounmpo is coming off his best career year after becoming a first-time NBA All-Star and the first player ever to finish a regular season in the top 20 in all major stats (points, rebounds, assists, steals and blocks).<br>\nKD is right; Antetokounmpo’s ceiling has no limits at the ripe, pre-prime age of 22. Who knows, the Greek Freak just might fulfill Kobe Bryant’s challenge of winning the NBA MVP award.</p>\n<p><strong>Kevin Durant: Oct. 31, 2007 – Seattle Supersonics vs. Denver Nuggets</strong><br>\nThe first glimpse into the current wave of stretch forwards begins with Kevin Durant. While the impact of length had been witnessed with legends like Kareem Abdul-Jabbar and Wilt Chamberlain, and the ability to handle the ball with craft was displayed by players such Earvin “Magic” Johnson and Allen Iverson, Durant introduced an unorthodox skillset — a near seven-foot stature with the ability to do it all on the court.<br>\nRight out the gates in his first career game, the then 19-year-old was looking to make an immediate impact as he ended with 22 shot attempts. He finished with 18 points with seven made field goals, five rebounds, three steals and a block in a 120-103 loss to a Denver team that had both Carmelo Anthony and Allen Iverson record a combined 57 points.<br>\nThe current state of KD’s career is at its full peak after his decision to join the Golden State Warriors last offseason. Despite the critics, Durant is now an NBA champion and NBA Finals MVP and has convinced many that he is the league’s best player.</p>\n<p><strong>James Harden: Oct. 28, 2009 – OKC Thunder vs. Sacramento Kings</strong><br>\nWhether it be from long range or a quick hesi-eurostep, Harden is one the NBA’s most lethal offensive players.<br>\nUpon entering the league, he was drafted into one of the best situations possible with his teammates being Russell Westbrook and Kevin Durant.<br>\nHow Harden would fit within that puzzle was a concern.<br>\nBefore becoming the star player we know today as “The Beard,” his growth began with his transition to the pros.<br>\nIt was a slow start for Harden, whose playing time was capped at 13 minutes and included five points on 2-of-2 shooting, 1-of-1 from behind the three-point line and two rebounds in a 102-89 win.<br>\nSince joining the Houston Rockets, Harden has become one of the NBA’s ultimate stars and is coming off a year during which he averaged 29.1 points, 11.2 assists and 8.1 rebounds per game — all career highs.<br>\nClaims that Harden has been snubbed twice for the NBA MVP award still ring, but after helping lead the Rockets to their 122-121 win over the Warriors, he and Houston could possibly be a true contender in the West.</p>\n<p><strong>Kawhi Leonard: Dec. 26, 2011 – SA Spurs vs. Memphis Grizzlies</strong><br>\nThe late start was a result of the 2011 NBA lockout that took place. Most notably, the Indiana Pacers must regret trading Kawhi Leonard to the Spurs.<br>\nOverlooked in his draft class due to questions surrounding his offensive potential, Leonard turned out to be the biggest steal of the draft and is now within the conversation of being the game’s next best player.<br>\nSimilar to some others on this list, his first game didn’t make a profound statement.<br>\nComing off the bench in the Spurs’ 95-82 defeat of Memphis, Leonard concluded his debut with six points on 2-of-9 shooting along with six rebounds, two steals and an assist.<br>\nA reserved, humble spirit who lets his play do all the talking, Leonard remained low on many fans’ and experts’ radars until his emergence in the 2014 NBA Finals. He ended the championship series averaging 17.8 points, 6.4 rebounds and 1.6 assists per game to win the NBA Finals MVP award.<br>\nHis postseason performance was the birth of a star, as he went on to embrace a bigger role for the Spurs and is now the team’s No. 1 option after putting up a career-high scoring average of 25.5 PPG last season.<br>\nIn spite of being ruled out of the Spurs’ Wednesday season opener, “The Klaw” seems to be on a path to greatness as he prepares for another year as San Antonio’s leading man.</p>\n<p><strong>Russell Westbrook: Oct. 29, 2008 – OKC Thunder vs. Milwaukee Bucks</strong><br>\nSince day one, Westbrook has been known for his relentless, Looney Tunes “Tasmanian Devil” motor. His first full season without KD left many favoring the likelihood of the Thunder plummeting to the bottom half of the Western Conference.<br>\nRather than sink, Westbrook made history and won the NBA MVP award after breaking NBA legend Oscar Robertson’s single-season triple double-record of 41 by finishing last season with 42 and becoming the first player since Robertson to average a triple-double (31.6 PPG, 10.4 APG, 10.7 RPG).<br>\nRewinding back to the first game of his rookie year, he had 13 points, four assists, four rebounds and one block in a 98-87 loss.<br>\nWestbrook can produce for a team on his own, but he did need more help. That help has arrived with OKC’s additions of stars Paul George and Carmelo Anthony.</p>\n<p><strong>Anthony Davis: Oct. 31, 2012 – New Orleans Hornets vs. SA Spurs</strong><br>\nThe process of being drafted by a rebuilding franchise has been a long, challenging journey for Anthony Davis, who has one playoff appearance under his belt.<br>\nHowever, “The Brow” has proven that he belongs in the NBA and showcased this in his career debut.<br>\nHe made the most of his 29 minutes, having tallied 21 points on a 6-of-12 shooting performance all while collecting seven rebounds, one steal and one block apiece, but the team still lost 99-95.</p>\n<p><strong>Damian Lillard: Oct. 31, 2012 – Portland Trailblazers vs. LA Lakers</strong><br>\nComing out of Weber State, Damian Lillard has and still does rock a chip on his shoulder as he embraces the underdog role of being underrated throughout his career.<br>\nHe and the Trailblazers hosted the Lakers, who at the time had Kobe Bryant, Pau Gasol, Dwight Howard and Steve Nash on their team.<br>\nDame showed no fear and managed to overcome six turnovers as he broke out for a night that consisted of scoring 23 points, 11 assists, three rebounds and one steal. His strong performance helped lead Portland to a 116-106 victory.</p>\n<p><strong>Kyrie Irving: Dec. 26, 2011 – Cleveland Cavaliers vs. Toronto Raptors</strong><br>\nFollowing “The Decision” of LeBron James to leave Cleveland for the Miami Heat, the Cavaliers were in search of their next superstar.<br>\nWith the No. 1 pick in the 2011 NBA Draft, Kyrie Irving was the team’s selection to be the face of its franchise.<br>\nThe pressure may have gotten to Irving in his debut as he finished with six points on 2-of-12 shooting, seven assists, three rebounds and one steal in the Cavs’ 104-96 loss.<br>\nJames’s return in 2014 led to the pairing of him and Irving, which resulted in their success of winning one NBA title in three years of playing with each other prior to Irving having his trade request granted this past summer, landing him in Boston.<br>\nTuesday night was just the beginning of the “Uncle Drew-King James” saga that will continue to build hype as the season progresses.</p>\n<p><em>A version of this story appeared on p. 8 of the Oct. 19, 2017, edition of the Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-79181\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-79181\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-10-19/blast-from-the-past-rookie-flashbacks-of-todays-nba-stars/","id":1881,"author":{"id":45,"name":"Sean White"},"related":[1880,1879,1878],"comments":[],"followers":[]},"author":{"id":45,"name":"Sean White","biography":"Not available","articles":[163,251,282,290,292,293,300,302,311,312,314,315,316,327,328,329,337,338,340,341,343,345,347,349,350,351,353,356,357,361,362,363,364,365,368,370,372,373,375,376,379,381,382,385,387,389,391,392,393,395,396,398,401,406,407,408,414,426,447,452,453,455,468,471,487,488,492,504,506,507,513,517,528,529,530,583,585,601,674,975,1208,1363,1415,1428,1430,1443,1473,1775,1776,1777,1872,1873,1881,1886,1889,1890,1893,1908,1911,1914,1971,1974,1984,1993,2005,2020,2021,2025,2849,3280,3283,3284,3290,3298,3299,3304,3306,3310,3322,3323,3325,3338,3381,4102,4954,4981,4988,4991,4996,5041,5044,5049,5055,5070,5071,5072,5073,5074,5075,5076,5077,5079,5080,5081,5082,5088,5089,5097,5098,5120,5121,5151,5152,5317,5340,5342,5343,5345,5347,5349,5365,5367,5368,5369,5371,5384,5387,5388,5389,5390,5391,5393,5394,5395,5401,5479,5509,5543],"portrait":"Not available"},"related":[{"title":"New App Allows Students To Check Library Floor Occupancy","category":"News","subcategory":"Campus","publish_date":"2019-10-24T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=980%2C647&ssl=1","description":"The app will allow students to check occupancy rates on the library floors.","content":"<div class=\"single-post-content\">\n            <p><span style=\"font-weight: 400;\">UC Santa Barbara’s Davidson Library has partnered with Waitz — a new app that monitors occupancy levels on library floors — in order to give students the ability to check how busy the library is throughout the day.</span></p>\n<div id=\"attachment_90651\" style=\"width: 2058px\" class=\"wp-caption alignnone\"><a href=\"http://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/waitz-4/\" rel=\"attachment wp-att-90651\"><img aria-describedby=\"caption-attachment-90651\" data-attachment-id=\"90651\" data-permalink=\"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/waitz-4/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?fit=2048%2C1620&amp;ssl=1\" data-orig-size=\"2048,1620\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"waitz\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?fit=250%2C198&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?fit=888%2C702&amp;ssl=1\" class=\"size-full wp-image-90651\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=888%2C702\" alt=\"\" width=\"888\" height=\"702\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?w=2048&amp;ssl=1 2048w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=250%2C198&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=768%2C608&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?resize=1024%2C810&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/10/waitz.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-90651\" class=\"wp-caption-text\"><em>Sam Rankin / Daily Nexus</em></p></div>\n<p><span style=\"font-weight: 400;\">Using custom sensors, Waitz is able to monitor Bluetooth and Wi-Fi signals, which it converts into occupancy data. The app calculates the number of students active on each floor and is constantly updated, refreshed every 10 minutes. It is 90% accurate, according to the app’s website.</span></p>\n<p><span style=\"font-weight: 400;\">The Waitz app is currently only available for iOS download, but Android users can still access occupancy rates online through the library’s website. Librarians have promoted the app through their website, UCSB’s subreddit r/UCSantaBarbara and on special monitor screens that display the occupancy rates in the library. </span></p>\n<p><span style=\"font-weight: 400;\">Developer of Waitz and former UC San Diego alumni, Max Topolsky, first thought of creating an app that could monitor occupancy when he was a senior at UC San Diego. The app first launched at UCSD in August 2017, making UCSB the second UC to use Waitz’s services.</span></p>\n<p><span style=\"font-weight: 400;\">“We developed this when we were students at UC San Diego, and [at] UCSD we have a really big library and walking around when it was crowded was always a pain,” Topolosky said. </span></p>\n<p><span style=\"font-weight: 400;\">“So myself and two other people thought that … we can actually do something, so we started experimenting with some different technology and we found something that actually worked,” he added.</span></p>\n<p><span style=\"font-weight: 400;\">The library has been searching for products to help students with space occupancy and the library’s head of communications, Hanna Rael, shared that she has been approached several times by students “looking for some way to see online how busy the library is at any given time”; so, when she “received a direct email from Waitz,” she felt “super excited about it.”</span></p>\n<p><span style=\"font-weight: 400;\">The librarians are also using the data collected by Waitz to understand why certain floors are used more than others and to find ways to improve the use of floors are utilized at lower rates. </span></p>\n<p><span style=\"font-weight: 400;\">“We’ll be able to see historical data about space occupancy … [and] we can see if there’s parts of the library that over time seem underutilized and that might point to other issues that we could look into. Like maybe there’s not enough power in that area, maybe there’s not enough light or maybe the temperature control is not good in that area,” UCSB librarian Rebecca Metzger said. </span></p>\n<p><span style=\"font-weight: 400;\">The Waitz app is currently only used at the library, but plans are in place to expand to other locations around campus in the future, Metzger added.</span></p>\n<p><span style=\"font-weight: 400;\">“If students like it, we will probably be looking at ways to see if we can share the funding with other partners on campus who are interested in seeing it continue after the first year.”</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-90611\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-90611\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2019-10-24/new-app-allows-students-to-check-library-floor-occupancy/","id":1878,"author":{"id":238,"name":"Crystal Martinez"},"related":[1877,1876,1875],"comments":[],"followers":[]},{"title":"Interfraternity Council Bans Hard Alcohol, Implements Sober Party Monitors In Sweeping Changes","category":"News","subcategory":"Campus","publish_date":"2020-02-04T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=980%2C647&ssl=1","description":"The IFC implemented a series of new policies for all fraternity social events at the beginning of Winter Quarter 2020.","content":"<div class=\"single-post-content\">\n            <p><span style=\"font-weight: 400;\">The UC Santa Barbara Interfraternity Council implemented a series of new policies — including a ban on hard alcohol — for all fraternity social events at the beginning of Winter Quarter 2020, which council president Jason Stone detailed at the <a href=\"http://dailynexus.com/2020-02-04/task-force-for-safer-social-events-in-i-v-meets-for-second-time-to-hear-updates-about-new-ifc-regulations-university-communications/\">second Task Force for Safer Social Events in Isla Vista meeting</a> on Monday. </span></p>\n<div id=\"attachment_92573\" style=\"width: 2058px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-92573\" data-attachment-id=\"92573\" data-permalink=\"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/dsc_7685/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?fit=2048%2C1363&amp;ssl=1\" data-orig-size=\"2048,1363\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"DSC_7685\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-full wp-image-92573\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=888%2C591\" alt=\"\" width=\"888\" height=\"591\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?w=2048&amp;ssl=1 2048w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=250%2C166&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=768%2C511&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?resize=1536%2C1022&amp;ssl=1 1536w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2020/02/DSC_7685.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-92573\" class=\"wp-caption-text\"><span style=\"font-weight: 400;\">The policies apply to all Interfraternity Council organizations. </span><em>Max Abrams/Daily Nexus</em></p></div>\n<p><span style=\"font-weight: 400;\">The task force was initially formed in Fall Quarter 2019 in response to a </span><a href=\"http://dailynexus.com/2019-10-28/rape-reported-at-sigma-pi-house-third-sexual-assault-allegation-in-past-month/\"><span style=\"font-weight: 400;\">series of reports</span></a><span style=\"font-weight: 400;\"> of sexual assault allegations involving fraternities during the quarter. Much of the discussion at the Monday meeting, which included representatives from various campus offices and student organizations, centered around the recent regulations and how they were being enforced.</span></p>\n<p><span style=\"font-weight: 400;\">“[The policies were] generated through a lot of really collaborative conversations among all of our IFC organizations along with Panhellenic organizations, and [by] communicating amongst all Greek leadership as well as discussing and considering input from other community members,” Stone began. </span></p>\n<p><span style=\"font-weight: 400;\">“We’re really hopeful that some of this can be translated to all community and campus organizations so that all of those events can become safer.”</span></p>\n<p><span style=\"font-weight: 400;\">The policies apply to all Interfraternity Council (IFC) organizations, which include Alpha Gamma Omega, Alpha Tau Omega, Delta Tau Delta, Kappa Sigma, Sigma Chi, Sigma Nu, Sigma Phi Epsilon, Sigma Pi, Zeta Beta Tau and Zeta Psi. </span></p>\n<p><span style=\"font-weight: 400;\">The first policy Stone introduced, and the one he described as the biggest change, was the addition of mandatory “sober hosts” at all IFC events. </span></p>\n<p><span style=\"font-weight: 400;\">“Essentially what that means is the hosting organization, or organizations… [have] a collection of sober host monitors who are there to take charge, take the lead, make sure that everything is running as it should be. If there were any concerns or any issues that came up, those would be the first points of contact,” Stone said. </span></p>\n<p><span style=\"font-weight: 400;\">“In addition to just having those people present at the events, we also have outlined ways for them to be very clearly identifiable,” he added. </span></p>\n<p><span style=\"font-weight: 400;\">Stone also clarified later in the discussion that all sober hosts are required to wear neon vests, similar to those construction workers wear, so they can be easily recognized. </span></p>\n<p><span style=\"font-weight: 400;\">“It’s one thing, especially at a crowded event, to be sober or to be in charge. It’s entirely another for other people to know that that [a] person is in charge and capable of handling anything that may come up,” he said. </span></p>\n<p><span style=\"font-weight: 400;\">Stone said the neon vest requirement is consistent across all IFC fraternities, so that if an individual attends multiple IFC events in one night, they would still be able to find a sober host easily. </span></p>\n<p><span style=\"font-weight: 400;\">The current required ratio is three sober hosts for the first 50 guests, and then an additional sober host for every 25 additional guests, Stone said. </span></p>\n<p><span style=\"font-weight: 400;\">In addition to mandating sober hosts at all IFC events, Stone said that fraternities are beginning to set up sober stations that would serve water and act as an area for attendees to step away from the party. Stone added that the station would also serve as a “centralized location” for the sober hosts. </span></p>\n<p><span style=\"font-weight: 400;\">The IFC is also requiring that a sober host be stationed at the entrance of each social event, in order to ensure there is a “competent entry process going on,” Stone said, and so sober hosts can introduce themselves to anyone coming in who might not be aware of their presence. </span></p>\n<p><span style=\"font-weight: 400;\">Another significant change the IFC implemented was the banning of hard alcohol — all alcohol above 15% ABV — which Stone said was a policy adopted from the council’s </span><a href=\"https://nicfraternity.org/nic-fraternities-vote-to-ban-hard-alcohol/?fbclid=IwAR1TaN_dwv3g5NTXg_UhsN-lkzek0IewPHSVJRlAJlXjf2kz1wbD8cBLMO4\"><span style=\"font-weight: 400;\">national organization</span></a><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">“That has been a really important shift, especially when it comes to our discussion of blackout culture and the effect that that has in Isla Vista in general,” he said. </span></p>\n<p><span style=\"font-weight: 400;\">Stone also added that the IFC is now mandating that water be served at all social events. He also clarified that these policies would apply for all social events, not just those held in I.V., but also for off-site events like in downtown Santa Barbara when organizations might rent out a venue. </span></p>\n<p><span style=\"font-weight: 400;\">Jennifer Selvidge, a representative from the Graduate Student Association, noted during the Q&amp;A portion that she wanted the committee to discuss developing a policy that would address the issue of date-rape drugs, the use of which is often premeditated, particularly since an individual would likely purchase them while sober, she said. </span></p>\n<p><span style=\"font-weight: 400;\">Ally van Dorsten, the Collegiate Panhellenic Council president, noted that the hard alcohol ban essentially means that there will be no open containers at IFC social events now. </span></p>\n<p><span style=\"font-weight: 400;\">“There’s not a lot of opportunity at these events for people to be drugging, because it’s all closed, individual, single container alcohol that is being served to people of age,” van Dorsten said. </span></p>\n<p><span style=\"font-weight: 400;\">“I don’t know if the rules that IFC has implemented [are] capable of that reach of trying to prevent people from roofie-ing other people.”</span></p>\n<p><span style=\"font-weight: 400;\">“Maybe this is just beyond the scope of what I think is tangible and possible right now for improvement right now. I don’t know if it’s possible to use these rules to stop people who have a sober intent of hurting someone else,” van Dorsten added. </span></p>\n<p><span style=\"font-weight: 400;\">Vince Matthew Feliciano, the vice president for Students Against Sexual Assault, pressed Stone about how the sober hosts would be held accountable. </span></p>\n<p><span style=\"font-weight: 400;\">Stone said the council had purchased breathalyzers, and has been dropping in on various IFC events to breathalyze the sober hosts. If someone is found to not have a 0.00 blood alcohol level, Stone said the event would immediately be shut down. </span></p>\n<p><span style=\"font-weight: 400;\">All IFC fraternities are now required to register their events with the IFC ahead of time, Stone added, so that the council would be able to check on all the sober hosts. </span></p>\n<p><span style=\"font-weight: 400;\">Briana Conway, director for Campus Advocacy, Resources and Education, asked Stone about how fraternity members reacted to the hard alcohol ban.</span></p>\n<p><span style=\"font-weight: 400;\">“I would love to hear how members are feeling about a hard alcohol ban — not leaders, members,” Conway said. </span></p>\n<p><span style=\"font-weight: 400;\">Stone acknowledged that he faced pushback when first introducing the idea, but said IFC spent time talking to not just fraternity leadership, but with general body members at chapter meetings about all the changes the IFC was introducing.</span></p>\n<p><span style=\"font-weight: 400;\">“At first, it was definitely not an easy sort of conversation, it was not something that everyone was super excited to sort of take on,” Stone said. </span></p>\n<p><span style=\"font-weight: 400;\">In response, Conway noted that many students might drink more heavily before the event if they know they won’t have access to hard alcohol at the event.</span></p>\n<p><span style=\"font-weight: 400;\">“I wanna make sure we’re not moving the problem maybe earlier in the night,” Conway said. </span><span style=\"font-weight: 400;\">Stone said the sober hosts would play a role in this as well, making sure that people entering the event aren’t too intoxicated. </span></p>\n<p><span style=\"font-weight: 400;\">van Dorsten added that she’s noticed that even if people are drinking heavily before attending a fraternity event, it’s typically easier to notice — and take care of someone — at a pregame, as opposed to if someone is binge-drinking at a fraternity event. </span></p>\n<p><span style=\"font-weight: 400;\">Stone stressed at the Monday meeting that these regulations were just the first step in trying to reduce harm, or the potential for harm, at fraternity social events. </span></p>\n<p><span style=\"font-weight: 400;\">“The one thing I do want to emphasize is that this is absolutely an ongoing process for us, as I think it should be for everyone. Risk prevention doesn’t end after you change one rule, it’s ongoing, and it’s to continue to create a safer and safer environment.”</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\"><img src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2019/05/sanya-kamidi-profile-pic-.jpg?w=888&amp;ssl=1\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Sanya Kamidi</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Sanya Kamidi serves as the Deputy News Editor and before that was a Social Media Manager. Loves coffee and will find any excuse to miss class for the Nexus.</p>\n<p>She can be reached at skamidi@dailynexus.com or @skamidi on Twitter.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_self\" href=\"mailto:skamidi144@gmail.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-92563\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-92563\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2020-02-04/interfraternity-council-bans-hard-alcohol-implements-sober-party-monitors-in-sweeping-changes/","id":1880,"author":{"id":15,"name":"Sanya Kamidi"},"related":[1879,1878,1877],"comments":[],"followers":[]},{"title":"Gauchos Hold 6-Stroke Lead Heading into Final Round of Big West Tournament","category":"Sports","subcategory":"Golf","publish_date":"2017-05-03T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2013/05/Golf2_CourtesyOfTonyMastres.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2013/05/Golf2_CourtesyOfTonyMastres.jpg?resize=500%2C377&ssl=1","description":"The Gauchos are now one day away from securing its first Big West championship since 1998 and just its second conference championship overall.","content":"<div class=\"single-post-content\">\n            <p>The UCSB golf team is now only one day away from hoisting the Big West trophy after taking over the conference tournament today carding 9-under par 279 to take a six-stroke lead heading into tomorrow’s final round in an attempt to win its first league championship since 1998.</p>\n<p>“A six-stroke lead is great, but what’s more important is that all five of our guys are playing well,” Head Coach Steve Lass said.</p>\n<p>Santa Barbara came into the day tied with both Cal Poly and Long Beach State at 6-under 282, but the only the Gauchos were able to outshine their performance from the last day with the Mustangs only carding 3-under 285 and LBSU now tied for third with CSUN after carding 1-under par 287.</p><!--Ad Injection:random--><script type=\"text/javascript\"> \r\n\r\nfunction myAdDoneFunction(spotx_ad_found) { if(spotx_ad_found) {} else {}}; \r\n\r\n\r\n\r\nfunction mobileAndTabletcheck() { \r\n\r\nvar check = false; \r\n\r\n (function(a){if(/(android|bb\\d+|meego).+mobile|avantgo|bada\\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\\.(browser|link)|vodafone|wap|windows ce|xda|xiino|android|ipad|playbook|silk/i.test(a)||/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\\-(n|u)|c55\\/|capi|ccwa|cdm\\-|cell|chtm|cldc|cmd\\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\\-s|devi|dica|dmob|do(c|p)o|ds(12|\\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\\-|_)|g1 u|g560|gene|gf\\-5|g\\-mo|go(\\.w|od)|gr(ad|un)|haie|hcit|hd\\-(m|p|t)|hei\\-|hi(pt|ta)|hp( i|ip)|hs\\-c|ht(c(\\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\\-(20|go|ma)|i230|iac( |\\-|\\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\\/)|klon|kpt |kwc\\-|kyo(c|k)|le(no|xi)|lg( g|\\/(k|l|u)|50|54|\\-[a-w])|libw|lynx|m1\\-w|m3ga|m50\\/|ma(te|ui|xo)|mc(01|21|ca)|m\\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\\-2|po(ck|rt|se)|prox|psio|pt\\-g|qa\\-a|qc(07|12|21|32|60|\\-[2-7]|i\\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\\-|oo|p\\-)|sdk\\/|se(c(\\-|0|1)|47|mc|nd|ri)|sgh\\-|shar|sie(\\-|m)|sk\\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\\-|v\\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\\-|tdg\\-|tel(i|m)|tim\\-|t\\-mo|to(pl|sh)|ts(70|m\\-|m3|m5)|tx\\-9|up(\\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\\-|your|zeto|zte\\-/i.test(a.substr(0,4)))check = true})(navigator.userAgent||navigator.vendor||window.opera); \r\n\r\nreturn check; \r\n\r\n} \r\n\r\nvar bMobile = mobileAndTabletcheck(), \r\n\r\naScriptAttributes = [\r\n\r\n'type=\"text/javascript\" src=\"http://search.spotxchange.com/js/spotx.js\" data-spotx_ad_done_function=\"myAdDoneFunction\" data-spotx_ad_unit=\"incontent\" data-spotx_autoplay=\"1\" data-spotx_ad_volume=\"0\" data-spotx_loop=\"0\" data-spotx_collapse=\"1\" data-spotx_unmute_on_mouse=\"1\"'\r\n\r\n];\r\n\r\nif (bMobile) \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"304\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"171\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"128967\"');\r\n\r\n} \r\n\r\nelse \r\n\r\n{ \r\n\r\naScriptAttributes.push('data-spotx_content_width=\"608\"'); \r\n\r\naScriptAttributes.push('data-spotx_content_height=\"342\"'); \r\n\r\naScriptAttributes.push('data-spotx_unmute_on_mouse=\"1\"');\r\n\r\naScriptAttributes.push('data-spotx_channel_id=\"108869\"');\r\n\r\n} \r\n\r\ndocument.write('<scr' + 'ipt ' + aScriptAttributes.join(\" \") + '></scr' + 'ipt>'); \r\n</script> \n<p>Early in the day, the Gauchos struggles were evident as they once fell behind by five strokes dropping them to as low as fourth place in the tournament. However, Santa Barbara turned it around and took a lead as high as nine strokes once it finally settled down.</p>\n<p>“I was a little concerned early, but this team has been pretty resilient all year and I don’t think any of them panicked so I wasn’t going to either,” Lass said.</p>\n<p>As it stands, UCSB is 15-under par 561 with CP sitting at second place at 9-under par 567 and Cal State Northridge and Long Beach State round out the top three with a 7-under par 569.</p>\n<p>UCSB received yet another big performance from sophomore Nick Swanson who followed up his 3-under par performance in the first round with the same line on Tuesday.</p>\n<p>The sophomore is currently tied for third in the individual title, dropping one spot after a solid day from LBSU’s redshirt sophomore Joe Fryer who carded 6-under par today to jump eight spots. CSUN’s junior Felix Mory still leads the individual with an overall 8-under par.</p>\n<p>Junior Zach Smith was also huge for the Gauchos today, converting an Eagle on the par-5 13<sup>th</sup> hole. Six players have now Eagled on that hole.  Smith finished the day carding 3-under to now stand at 4-under overall and is currently in fifth place in the individual jumping up five spots.</p>\n<p>Last years’ champion of the individual tournament, junior Brandon Bauman, also continued his solid stretch carding 3-under as well to be at 5-under overall and hold the fourth rank down after the second round of the tournament.</p>\n<p>Brett Bennett jumped up two spots and is now tied for 15<sup>th</sup> in the individual after again carding even par. The freshman also Eagled on par-5 fifth hole and is one of 11 golfers to do so in this tournament. Rounding out the team, Willy Moffly continues his share of struggles again carding over par today, however, the junior will look to turn it around in the final stretch tomorrow.</p>\n<p>Now one day away from celebrating a tournament championship, the Gauchos are in prime position to take home the trophy back to Santa Barbara in nearly 20 years. Along with that, UCSB would also receive the automatic bid to the NCAA tournament allowing them to continue what has been a successful year.</p>\n<p>Despite all this being in sight, UCSB is aware it must stay in control and card well tomorrow before it can celebrate anything.</p>\n<p>“I’ll try to help them stay loose in the morning, but the good thing they have won four tournaments this year so its not like we are in uncharted territory,” Lass said.</p>\n<p>The Big West tournament will conclude today with the first tee off beginning at 7:30 a.m. Santa Barbara will tee off at approximately 8:20 a.m.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/jorge-mercado/\"><img src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2019/05/IMG_1458.jpg?w=888\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/jorge-mercado/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Jorge Mercado</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Jorge Mercado is the current Editor in Chief and was a Sports Editor before that since freshman year. He prefers to be called Merk as that was his nickname given to him by the gods. Sometimes, his evil twin Mork appears. Clear eyes, full hearts, can’t lose.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_blank\" href=\"https://twitter.com/Merk_43\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-twitter\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M459.37 151.716c.325 4.548.325 9.097.325 13.645 0 138.72-105.583 298.558-298.558 298.558-59.452 0-114.68-17.219-161.137-47.106 8.447.974 16.568 1.299 25.34 1.299 49.055 0 94.213-16.568 130.274-44.832-46.132-.975-84.792-31.188-98.112-72.772 6.498.974 12.995 1.624 19.818 1.624 9.421 0 18.843-1.3 27.614-3.573-48.081-9.747-84.143-51.98-84.143-102.985v-1.299c13.969 7.797 30.214 12.67 47.431 13.319-28.264-18.843-46.781-51.005-46.781-87.391 0-19.492 5.197-37.36 14.294-52.954 51.655 63.675 129.3 105.258 216.365 109.807-1.624-7.797-2.599-15.918-2.599-24.04 0-57.828 46.782-104.934 104.934-104.934 30.213 0 57.502 12.67 76.67 33.137 23.715-4.548 46.456-13.32 66.599-25.34-7.798 24.366-24.366 44.833-46.132 57.827 21.117-2.273 41.584-8.122 60.426-16.243-14.292 20.791-32.161 39.308-52.628 54.253z\"></path></svg></a><a target=\"_blank\" href=\"https://www.linkedin.com/in/jorge-mercado-47613b117/\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-linkedin\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 448 512\"><path fill=\"currentColor\" d=\"M100.3 480H7.4V180.9h92.9V480zM53.8 140.1C24.1 140.1 0 115.5 0 85.8 0 56.1 24.1 32 53.8 32c29.7 0 53.8 24.1 53.8 53.8 0 29.7-24.1 54.3-53.8 54.3zM448 480h-92.7V334.4c0-34.7-.7-79.2-48.3-79.2-48.3 0-55.7 37.7-55.7 76.7V480h-92.8V180.9h89.1v40.8h1.3c12.4-23.5 42.7-48.3 87.9-48.3 94 0 111.3 61.9 111.3 142.3V480z\"></path></svg></a><a target=\"_self\" href=\"mailto:merk34@yahoo.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77550\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-05-03/gauchos-hold-6-stroke-lead-heading-into-final-round-of-big-west-tournament/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77550\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-05-03/gauchos-hold-6-stroke-lead-heading-into-final-round-of-big-west-tournament/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-05-03/gauchos-hold-6-stroke-lead-heading-into-final-round-of-big-west-tournament/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-05-03/gauchos-hold-6-stroke-lead-heading-into-final-round-of-big-west-tournament/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-05-03/gauchos-hold-6-stroke-lead-heading-into-final-round-of-big-west-tournament/","id":1879,"author":{"id":41,"name":"Jorge Mercado"},"related":[1878,1877,1876],"comments":[],"followers":[]}]},"__N_SSG":true}