{"pageProps":{"article":{"title":"UCSB Professor Leads Summer Course for Incarcerated Teens","category":"News","subcategory":"Campus","publish_date":"2018-05-31T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?resize=900%2C600&ssl=1","description":"UC Santa Barbara Theater and Dance Professor Michael Morgan’s program The Odyssey Project, which aims to rehabilitate incarcerated teenagers in Santa Barbara, will run for the eighth time this summe...","content":"<div class=\"single-post-content\">\n            <p>UC Santa Barbara Theater and Dance Professor Michael Morgan’s program <em>The Odyssey Project</em>, which aims to rehabilitate incarcerated teenagers in Santa Barbara, will run for the eighth time this summer.</p>\n<div id=\"attachment_83396\" style=\"width: 910px\" class=\"wp-caption alignnone\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg\" data-slb-active=\"1\" data-slb-asset=\"618602869\" data-slb-internal=\"0\" data-slb-group=\"83392\"><img aria-describedby=\"caption-attachment-83396\" data-attachment-id=\"83396\" data-permalink=\"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/the-odyssey-project/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?fit=900%2C600&amp;ssl=1\" data-orig-size=\"900,600\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"the odyssey project\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?fit=888%2C592&amp;ssl=1\" class=\"size-full wp-image-83396\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?resize=888%2C592\" alt=\"\" width=\"888\" height=\"592\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?w=900&amp;ssl=1 900w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/05/the-odyssey-project.jpg?resize=768%2C512&amp;ssl=1 768w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-83396\" class=\"wp-caption-text\">The students and incarcerated teenagers that participate in this program write stories about the struggles they currently deal with. They also draw pictures that convey their emotions in a healthy and metaphorical way, Morgan said. <em>Courtesy of Michael Morgan</em></p></div>\n<p>For the program, Morgan brings together eight UCSB students and eight incarcerated teenagers from Los Prietos Boys’ Camp (LPBC), a juvenile detention facility in Santa Barbara County. He uses theater, dance and art techniques to address issues related to class and culture.</p>\n<p>The class spends six weeks rehearsing their own rendition of Homer’s <em>Odyssey </em>from June 25 to August 4. At the end of the course, participants perform at Center Stage Theater in downtown Santa Barbara, according to Morgan.</p>\n<p>The program grew out of a class called “The People’s Voice,” which is also taught by Morgan and is offered during Summer Session A.</p>\n<p>“The purpose of the class was to create a partnership between UCSB undergraduates and the community,” Morgan said. “It’s theater with a social justice bent.”</p>\n<p>The class is six weeks long and meets Tuesday through Thursday for about four hours each day, according to Morgan.</p>\n<p>This program, which is the first and only of its kind, was started in 2011 when Morgan was looking for a way to bridge the gap between “privileged” and “non-privileged” people in the community.</p>\n<p>He said he wanted to create a space where they could interact in a way that promoted deeper communication and understanding between both sides, which is the basis for<em> The Odyssey Project</em>.</p>\n<p>“Coming from … my own background, I understand some of the difficulties people have to face if they’re not always privileged,” Morgan said.</p>\n<p>Morgan, who has been a lecturer at UCSB since1992, said he chose to focus on <em>The Odyssey </em>for his program because he felt it had a storyline that both students and troubled teens could relate to.</p>\n<p>“They become the heroes and heroines in their journey home to Ithaca,” he said.</p>\n<p>The students and incarcerated teenagers that participate in this program write stories about the struggles they currently deal with. They also draw pictures that convey their emotions in a healthy and metaphorical way, Morgan said.</p>\n<p>Morgan is the primary professor of the course, but also gets help from a mime teacher, mask maker, hip-hop choreographer, rap artist and costume designer.</p>\n<p>The location of the class alternates between UCSB and LPBC, which is located in Los Padres National Forest. This allows UCSB students to receive more context about the world and what the life of an incarcerated teenager is like, Morgan said.</p>\n<p>“There’s this location exchange, but also there’s a kind of cultural exchange because we have … the free and the incarcerated in a dialogue,” he explained. “The UC students benefit from [the program] because … [the teens and students] start to bond with each other.”</p>\n<p>Youth who are admitted into LPBC stay there for either 120 or 180 days, according to the LPBC website.</p>\n<p>“The goal of LPBC is to return youth to the community as responsible and productive members of society,” the website states.</p>\n<p>Boys between the ages of 14 and 18 are admitted into LPBC and are expected to attend the camp’s school while they are there, according to the website.</p>\n<p>Morgan said one of his main hopes is that the theater program will inspire teens who graduate from LPBC to go to college afterwards.</p>\n<p>“I usually take youth age 16 to 17. It’s an important transition in their life because … if they continue to violate [the law] basically they go to adult prisons,” Morgan said.</p>\n<p>There have been numerous accounts in which incarcerated teens work toward getting into college after completing the <em>The Odyssey Project,</em> according to Morgan.</p>\n<p>“[This program] show[ed] me that we could mature ourselves. We could work, not be lazy. We can go to college, have a good job and get good money instead of being on the streets and selling drugs. That’s not going to get you anywhere,” said Diego, a youth who attended the program in 2015.</p>\n<p>Morgan said he believes the performance the students and teenagers put on at the end of the course encourages community members and political leaders in Santa Barbara to address these teenagers in a more compassionate way.</p>\n<p>Relatives and friends of the actors, as well as community groups and leaders, attend this typically sold-out show, according to Morgan.</p>\n<p>The people in the crowd can “really make a difference” in the lives of the teenagers who perform, Morgan said.</p>\n<p>“Once [the students and teenagers] do that show… they’re throwing a ball to the public saying … ‘They also need to step up to us, we’re a part of that society,’” he said.</p>\n<p>This year, Morgan expanded this project to a maximum security correctional facility in Ventura County. The men at this facility range in age from 17 to 22. Due to safety concerns, the practices and performance are held within the correctional grounds.</p>\n<p>This “abbreviated” version of the program is four weeks long and is currently underway, according to Morgan.</p>\n<p>The biggest challenge in organizing the class and performance is “getting the word out” and getting students from UCSB to participate in this kind of work, according to Morgan.</p>\n<p>Morgan has begun to write up a “training manual” for this course that includes the strategies employed so that other people can start similar programs as well. He is also producing a documentary to spread awareness about the project.</p>\n<p>The possibility of continuation for the project will be determined in following years by enrollment numbers, funding and the amount of help from other staff members, according to Morgan.</p>\n<p>The next performance of <em>The Odyssey Project </em>at the Ventura location is scheduled for June 8.</p>\n<p><em>A version of the article appeared on p.4 of the May 31 print edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-83392\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-83392\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2018-05-31/ucsb-professor-leads-summer-course-for-incarcerated-teens/","id":2249,"author":{"id":88,"name":"Katie Wolf"},"related":[2248,2247,2246],"comments":[],"followers":[]},"author":{"id":88,"name":"Katie Wolf","biography":"Not available","articles":[2222,2239,2249,2266,2268,2308,2311,2769,3653,3769,3948,4329,4331],"portrait":"Not available"},"related":[{"title":"Judicial Council Slots Remain Unfilled as Senate Postpones Chair Vote","category":"News","subcategory":"Campus","publish_date":"2018-10-04T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=980%2C647&ssl=1","description":"The Judicial Council is made up of one chairman, four members and one advisor. ","content":"<div class=\"single-post-content\">\n            <p>The Associated Students Judicial Council is still unable to meet quorum after a Senate meeting Wednesday night, during which the 69th Senate voted to table Associated Students President Brooke Kopel’s appointment for a week.</p>\n<div id=\"attachment_84192\" style=\"width: 2058px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-84192\" data-attachment-id=\"84192\" data-permalink=\"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/img_3782/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?fit=2048%2C1365&amp;ssl=1\" data-orig-size=\"2048,1365\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?fit=888%2C592&amp;ssl=1\" class=\"size-full wp-image-84192\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=888%2C592\" alt=\"\" width=\"888\" height=\"592\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?w=2048&amp;ssl=1 2048w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=768%2C512&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/IMG_3782.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-84192\" class=\"wp-caption-text\">After moving the item into discussion, senators debated the merits of questioning the presidential appointments, a practice Kopel said was historically unprecedented. Sanya Kamidi / Daily Nexus</p></div>\n<p>Kopel selected Justin Nilsen, former solicitor general for the attorney general’s office, to fill the position of chairman.</p>\n<p>The Judicial Council is made up of one chairman, four members and one advisor, the latter of who does not vote on decisions, according to its website.</p>\n<p>At the end of last year, two of the three members, Matthew Lanthier and Roshni Sopariwalla, graduated, leaving Raymond Alonso, a current second-year political science and history of public policy major, as the only member on the council.</p>\n<p>Currently, the council has one active petition and one order of business to address relating to the position of EVPSA as well as allegations of campaign violations committed by Campus United (CU) that could disqualify all CU senators as well as Kopel.</p>\n<p>At the Senate meeting Wednesday night, Kopel said she had been holding off on appointing students to the council for several reasons. For one, she is charged with filling four seats for positions that students hold until they graduate.</p>\n<p>“Once you’re on, you’re making decisions for potentially four years, and that’s why I don’t take it lightly,” Kopel said. “That’s why I want to make sure that since I’ve been in the random situation that four new seats have opened when I’ve become president, I want to make sure that the best people and the fairest people are appointed, and that comes with time.”</p>\n<p>She also stated that of previous applicants, none of the students she reached out to had responded, leaving her no choice but to start up another round of applications during the summer.</p>\n<p>Currently the Committee on Committees (COC) is reviewing the applications. Once they conduct interviews they will make their recommendations to Kopel, who plans on conducting her own set of interviews as well.</p>\n<p>As for Nilsen, Kopel said she has known him since his freshman year through their involvement with mock trial.</p>\n<p>“I worked with him a lot, and saw how smart that dang kid is,” she said. “Really the drive he has for advocacy, and just judiciary in general, and so when he expressed interest to me in being on judicial council, I really considered him, knowing already what I knew about him and also looking at his answers to the questions that everybody else filled out.”</p>\n<p>Kopel stressed the importance of filling up the Judicial Council so that any open cases could be properly addressed.</p>\n<p>At the Senate meeting, Letters and Science Senator Ricardo Uribe requested that the Senate be allowed to question Kopel’s appointments before approving them, referencing the fact that Nilsen was unable to be present at the meeting.</p>\n<p>After moving the item into discussion, senators debated the merits of questioning the presidential appointments, a practice Kopel said was historically unprecedented.</p>\n<p>Marisela Marquez, Associated Students (A.S.) executive director, said that while in recent history, presidential appointments have not been scrutinized as heavily, there has been a past of senators questioning the selections.</p>\n<p>As Senate moved into discussion regarding Nilsen’s appointment, many agreed that they would like the opportunity to get to know him before making decisions that would affect their constituents.</p>\n<p>“I really want to respect Brooke and her appointments, [but] we should be able to ask questions…we should just be 100% confident that they will be able to do their job, nonbiased,” said Senator Christian Ornelas. “I just think it would be irresponsible not to ask questions.”</p>\n<p>As they took their vote to table the appointment until they would be able to question Nilsen, Proxy Rose Ettleson asked the Senate to commit themselves to the same process for future candidates.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\"><img src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2019/05/sanya-kamidi-profile-pic-.jpg?w=888&amp;ssl=1\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Sanya Kamidi</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Sanya Kamidi serves as the Deputy News Editor and before that was a Social Media Manager. Loves coffee and will find any excuse to miss class for the Nexus.</p>\n<p>She can be reached at skamidi@dailynexus.com or @skamidi on Twitter.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_self\" href=\"mailto:skamidi144@gmail.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-84188\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-84188\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2018-10-04/judicial-council-slots-remain-unfilled-as-senate-postpones-chair-vote/","id":2246,"author":{"id":15,"name":"Sanya Kamidi"},"related":[2245,2244,2243],"comments":[],"followers":[]},{"title":"Increase in Reports of On-Campus Rapes, Domestic Violence, Other Crimes in 2017","category":"News","subcategory":"Campus","publish_date":"2018-10-04T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-04-at-3.24.05-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-04-at-3.24.05-PM.png?resize=980%2C647&ssl=1","description":"Most crimes that were reported on campus occurred in student housing facilities.","content":"<div class=\"single-post-content\">\n            <p>UCSB has experienced an increase in reports of rapes, domestic and dating violence, stalking and fondling on and near campus since 2015.</p>\n<p><iframe id=\"datawrapper-chart-p8vHl\" style=\"width: 0; min-width: 100% !important;\" src=\"//datawrapper.dwcdn.net/p8vHl/3/\" height=\"400\" frameborder=\"0\" scrolling=\"no\"></iframe><script type=\"text/javascript\">if(\"undefined\"==typeof window.datawrapper)window.datawrapper={};window.datawrapper[\"p8vHl\"]={},window.datawrapper[\"p8vHl\"].embedDeltas={\"100\":508,\"200\":427,\"300\":427,\"400\":400,\"500\":400,\"700\":400,\"800\":400,\"900\":400,\"1000\":400},window.datawrapper[\"p8vHl\"].iframe=document.getElementById(\"datawrapper-chart-p8vHl\"),window.datawrapper[\"p8vHl\"].iframe.style.height=window.datawrapper[\"p8vHl\"].embedDeltas[Math.min(1e3,Math.max(100*Math.floor(window.datawrapper[\"p8vHl\"].iframe.offsetWidth/100),100))]+\"px\",window.addEventListener(\"message\",function(a){if(\"undefined\"!=typeof a.data[\"datawrapper-height\"])for(var b in a.data[\"datawrapper-height\"])if(\"p8vHl\"==b)window.datawrapper[\"p8vHl\"].iframe.style.height=a.data[\"datawrapper-height\"][b]+\"px\"});</script></p>\n<h6 style=\"text-align: center;\">Data courtesy of the UCSB Police Department. <em>Hayley Tice / Daily Nexus</em></h6>\n<p>These statistics, from the UC Santa Barbara’s <a href=\"https://www.police.ucsb.edu/files/docs/annual-clery-act-campus-security-report-2018.pdf\">2018 Annual Security Report</a>, include crimes committed on the UCSB campus, public property adjacent to the campus and other campus affiliated properties.</p>\n<p>The report includes crimes reported to UC Police Department and other campus security agencies, including the UCSB Clery Act Compliance Coordinator, the Office of Judicial Affairs, the Residential Student Conduct, the Title IX &amp; Sexual Harassment Compliance Office and Employee Labor Relations – Human Resources.</p>\n<p>The UCSB Police Department is required to publish these statistics to comply with the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act (Clery Act), according to the report.</p>\n<p>Most crimes are reported to UCPD, while a “small number” of reports are sent to the Clery Coordinator to be included in crime statistics, said Lieutenant Robert Romero, UCSB Police Department spokesperson, in an email.</p>\n<p><span style=\"font-weight: 400;\">A total of 32 rapes were reported in 2017, compared to 27 in 2016 and 17 in 2015. Reports of domestic violence increased from 6 in 2015 and 2016 to 25 in 2017. Reports of dating violence increased steadily within the past two years, from 6 in 2015, to 11 in 2016 and 13 in 2017.</span></p>\n<p><span style=\"font-weight: 400;\">The increase could reflect an increase in the number of victims and survivors reporting crimes, according to Briana Conway, the director of the Campus Advocacy, Resources &amp; Education (C.A.R.E.) at UCSB.</span></p>\n<p><span style=\"font-weight: 400;\">“When survivors feel supported by advocates and law enforcement, and when they are able to make informed decisions regarding their rights and options, they are more likely to engage in formal reporting systems,” she said in an email.</span></p>\n<p><span style=\"font-weight: 400;\">Emily Montalvo-Telford, a fourth-year philosophy and sociology double major and the director of Students Against Sexual Assault, a committee of the UCSB Human Rights Board, said that while “any amount of increase is very important to recognize,” these numbers “nowhere represent the actual numbers of assaults that happen in Isla Vista and on the UCSB campus.”</span></p>\n<p><span style=\"font-weight: 400;\">Most on-campus crimes that were reported occurred in student housing facilities.</span></p>\n<p><iframe id=\"datawrapper-chart-xmcxP\" style=\"width: 0; min-width: 100% !important;\" src=\"//datawrapper.dwcdn.net/xmcxP/3/\" height=\"439\" frameborder=\"0\" scrolling=\"no\"></iframe><script type=\"text/javascript\">if(\"undefined\"==typeof window.datawrapper)window.datawrapper={};window.datawrapper[\"xmcxP\"]={},window.datawrapper[\"xmcxP\"].embedDeltas={\"100\":601,\"200\":493,\"300\":466,\"400\":439,\"500\":439,\"700\":412,\"800\":412,\"900\":412,\"1000\":412},window.datawrapper[\"xmcxP\"].iframe=document.getElementById(\"datawrapper-chart-xmcxP\"),window.datawrapper[\"xmcxP\"].iframe.style.height=window.datawrapper[\"xmcxP\"].embedDeltas[Math.min(1e3,Math.max(100*Math.floor(window.datawrapper[\"xmcxP\"].iframe.offsetWidth/100),100))]+\"px\",window.addEventListener(\"message\",function(a){if(\"undefined\"!=typeof a.data[\"datawrapper-height\"])for(var b in a.data[\"datawrapper-height\"])if(\"xmcxP\"==b)window.datawrapper[\"xmcxP\"].iframe.style.height=a.data[\"datawrapper-height\"][b]+\"px\"});</script></p>\n<h6 style=\"text-align: center;\">Data courtesy of the UCSB Police Department. <em>Hayley Tice / Daily Nexus</em></h6>\n<p><span style=\"font-weight: 400;\">In 2017, 19 of the 24 reported rapes and 10 of the 12 reported instances of dating violence on campus took place in student housing.</span></p>\n<p><span style=\"font-weight: 400;\">Most of the stalking, burglary, domestic violence, aggravated assault and fondling crimes reported on-campus also occurred in student housing.</span></p>\n<p><span style=\"font-weight: 400;\">Two hate crimes were reported in 2017, an “intimidation incident” and an aggravated assault. Both crimes were characterized by national origin bias and occurred on public property, according to the report.</span></p>\n<p><span style=\"font-weight: 400;\">Zero hate crimes were reported in 2016 and 2015.</span></p>\n<p><span style=\"font-weight: 400;\">The report also showed a decrease in liquor and drug law violations referred for disciplinary action. 417 people were referred for disciplinary action due to liquor law violations in 2016 while 370 people were referred in 2017.</span></p>\n<p><iframe id=\"datawrapper-chart-nd8S9\" style=\"width: 0; min-width: 100% !important;\" src=\"//datawrapper.dwcdn.net/nd8S9/6/\" height=\"400\" frameborder=\"0\" scrolling=\"no\"></iframe><script type=\"text/javascript\">if(\"undefined\"==typeof window.datawrapper)window.datawrapper={};window.datawrapper[\"nd8S9\"]={},window.datawrapper[\"nd8S9\"].embedDeltas={\"100\":562,\"200\":454,\"300\":427,\"400\":400,\"500\":400,\"700\":373,\"800\":373,\"900\":373,\"1000\":373},window.datawrapper[\"nd8S9\"].iframe=document.getElementById(\"datawrapper-chart-nd8S9\"),window.datawrapper[\"nd8S9\"].iframe.style.height=window.datawrapper[\"nd8S9\"].embedDeltas[Math.min(1e3,Math.max(100*Math.floor(window.datawrapper[\"nd8S9\"].iframe.offsetWidth/100),100))]+\"px\",window.addEventListener(\"message\",function(a){if(\"undefined\"!=typeof a.data[\"datawrapper-height\"])for(var b in a.data[\"datawrapper-height\"])if(\"nd8S9\"==b)window.datawrapper[\"nd8S9\"].iframe.style.height=a.data[\"datawrapper-height\"][b]+\"px\"});</script></p>\n<h6 style=\"text-align: center;\">Data courtesy of the UCSB Police Department. <em>Hayley Tice / Daily Nexus</em></h6>\n<p><span style=\"font-weight: 400;\">Drug law violations referred for disciplinary action have decreased from 210 in 2015 to 120 and 118 in 2016 and 2017, respectively.</span></p>\n<p><span style=\"font-weight: 400;\">“Continual education and outreach may be the contributing factor” for these decreases, according to Romero. </span></p>\n<p><em>Updated [Oct. 5]: This article was updated to include further information about SASA.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/hayleytice/\"><img src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2020/07/image.jpg?w=888\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/hayleytice/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Hayley Tice</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Hayley Tice serves as data editor for the 2020-21 school year. She can be reached at hayleytice@dailynexus.com or data@dailynexus.com.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_self\" href=\"mailto:Hayleytice@dailynexus.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-84202\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/increase-in-reports-of-on-campus-rapes-domestic-violence-other-crimes-in-2017/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-84202\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/increase-in-reports-of-on-campus-rapes-domestic-violence-other-crimes-in-2017/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/increase-in-reports-of-on-campus-rapes-domestic-violence-other-crimes-in-2017/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-04/increase-in-reports-of-on-campus-rapes-domestic-violence-other-crimes-in-2017/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2018-10-04/increase-in-reports-of-on-campus-rapes-domestic-violence-other-crimes-in-2017/","id":2247,"author":{"id":26,"name":"Hayley Tice"},"related":[2246,2245,2244],"comments":[],"followers":[]},{"title":"BSU and Black Studies Dept. 50 Years Later","category":"News","subcategory":"Campus","publish_date":"2018-10-25T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.03.41-AM-1.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.03.41-AM-1.png?resize=980%2C647&ssl=1","description":"While progress has been made over the years, many demands remain unresolved.","content":"<div class=\"single-post-content\">\n            <p>In 1968 and 2012, black students at UC Santa Barbara put forth a list of demands to the administration, calling for inclusivity and additional resources on campus.</p>\n<p>While progress has been made over the years, many of those demands remain unresolved.</p>\n<div id=\"attachment_84522\" style=\"width: 628px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-84522\" data-attachment-id=\"84522\" data-permalink=\"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/screen-shot-2018-10-25-at-12-04-39-am/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?fit=878%2C1188&amp;ssl=1\" data-orig-size=\"878,1188\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Screen Shot 2018-10-25 at 12.04.39 AM\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?fit=185%2C250&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?fit=757%2C1024&amp;ssl=1\" class=\"wp-image-84522 \" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?resize=618%2C836\" alt=\"\" width=\"618\" height=\"836\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?w=878&amp;ssl=1 878w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?resize=185%2C250&amp;ssl=1 185w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?resize=768%2C1039&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-25-at-12.04.39-AM.png?resize=757%2C1024&amp;ssl=1 757w\" sizes=\"(max-width: 618px) 100vw, 618px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-84522\" class=\"wp-caption-text\">BSU students are currently working to update the demands from 2012. <em>Courtesy of Alexandra Gessesse</em></p></div>\n<p>The North Hall Takeover of 1968 led to the creation of the Black Studies department, which now offers a diverse set of courses encompassing traditional subjects like the history of black Americans as well as more specialized courses detailing Caribbean studies, the black radical tradition and the history of jazz music.</p>\n<p>Professor Jeffrey Stewart, who works in the department and helped organize the North Hall Takeover: 50 Years After conference that took place at UC Santa Barbara earlier this month, is proud of the growth the department has seen since its creation.</p>\n<p>“We feel that our very existence here is due to their vision and their activism, so we try to honor that with these anniversary celebrations,” Stewart said.</p>\n<p>The creation of the Black Studies department also set the groundwork for other departments such as the Chicanx Studies department, the Feminist Studies department and the Asian American Studies department.</p>\n<p>“There’s a body of knowledge that’s come out of the black experience of America that all students can benefit from and there’s a body of knowledge that’s come out of the Chicano experience of America that can be useful for all students,” Stewart said.</p>\n<p>Stewart cites a “critical apparatus” and activism as the two leading tenets of the Black Studies department.</p>\n<p>Not only does the department teach its students to be critical consumers of the information presented to them, but it also emphasizes the need for activism and the role it’s played in creating the America we live in today, he said.</p>\n<p>“Activism sometimes is looked down on in the larger political landscape but I think if you look at change in America, much of it has come about because people have been activists,” he said.</p>\n<p>Despite its growth, the department is currently struggling with a shortage of professors.</p>\n<p>While Stewart said the problem is mostly temporary due to professors who have passed away or recently left, he said the larger problem is the lack of attention to the humanities as a whole.</p>\n<p>“The university is internationally known for its science and engineering, so that’s kind of what they’re always emphasizing,” said Stewart said.</p>\n<p>“When it comes to interdisciplinary departments like black studies, feminist studies… sometimes it’s a struggle to get administrators to see that part of the education here is not just getting technical education, it’s education to become a citizen, and to be a globally aware citizen.”</p>\n<p>UCSB has a long history of activism, particularly within the Black Student Union (BSU).</p>\n<p>BSU students are currently working to update the demands from 2012 and cite their two biggest concerns as the resources available for black educators and the “recruitment and retention of black students,” according to BSU Chair Mariyah Lewis.</p>\n<p>“Seeing how the office engages with the retention and recruitment of black students… is one of the indicative efforts of how strong and how serious the demands are, ranging from 1968 all the way to 2012,” said Alexandra Gessesse, whose position in the Office of Admissions as diversity intern was a direct result of previous BSU demands.</p>\n<p>Dalton Nezey, one of the original members of the North Hall Takeover, echoed similar sentiments in establishing strong, consistent professors in the Black Studies department.</p>\n<p>“I wanted [the professors] to be caretakers of the history of black studies and the history of blacks on this campus,” Nezey said.</p>\n<p>Samantha Sanchez, who is leading the seven-member BSU demands team, says most of the demands have received money allocated toward their completion.</p>\n<p>The team is now responsible for making sure the money is used correctly.</p>\n<p>The demands are constantly evolving, as the needs of black students at UCSB evolve, and Sanchez says the main goal of the demands team is to “assess the state of the black community on campus.”</p>\n<p>“What we have left right now is just to ensure the overall well-being of black students and black people on campus,” she added.</p>\n<p>The addition of two black psychologists in Counseling and Psychological Services and the creation of the diversity intern position in the Admissions Office are two of the demands from 2012 that have already been met.</p>\n<p>There are still many demands left incomplete, however, including one asking for a display in North Hall memorializing the North Hall Takeover and a database of contact information for black students to allow for faculty or BSU leaders to “extend resources to our community more systematically and rigorously,” according to the 2012 demands.</p>\n<p>“I think that the things that we’re implementing will allow for us to see change happen in a very institutional and lasting way,” Sanchez said. “I’m excited to see where it goes after I graduate.”</p>\n<p><i>A version of the article appeared on p.4 of the Oct. 25 print edition of the</i> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\"><img src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2019/05/sanya-kamidi-profile-pic-.jpg?w=888&amp;ssl=1\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/sanya-kamidi/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Sanya Kamidi</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Sanya Kamidi serves as the Deputy News Editor and before that was a Social Media Manager. Loves coffee and will find any excuse to miss class for the Nexus.</p>\n<p>She can be reached at skamidi@dailynexus.com or @skamidi on Twitter.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_self\" href=\"mailto:skamidi144@gmail.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-84520\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-84520\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2018-10-25/bsu-and-black-studies-dept-50-years-later/","id":2248,"author":{"id":15,"name":"Sanya Kamidi"},"related":[2247,2246,2245],"comments":[],"followers":[]}]},"__N_SSG":true}