{"pageProps":{"article":{"title":"BLM Co-Founder Alicia Garza To Speak at UCSB","category":"News","subcategory":"Campus","publish_date":"2017-04-25T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-Shot-2017-05-01-at-5.38.44-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-Shot-2017-05-01-at-5.38.44-PM.png?resize=778%2C451&ssl=1","description":"Black Lives Matter co-founder Alicia Garza will be the keynote speaker for the “Black Liberation: The Rose That Grew From Concrete” event on Wednesday evening, during which she will be sharing her...","content":"<div class=\"single-post-content\">\n            <p>Black Lives Matter co-founder Alicia Garza will be the keynote speaker for the “Black Liberation: The Rose That Grew From Concrete” event on Wednesday evening, during which she will be sharing her thoughts about the BLM movement and addressing discrimination in the United States.</p>\n<p>The free event will be in Campbell Hall and is part of UC Santa Barbara’s BLM Week organized by the Resource Center for Sexual and Gender Diversity, the Black Student Engagement Program and Queer Commission. The week’s events aim to address the nature of institutionalized racism and its effect on society.</p>\n<p>Garza, current special projects director for the National Domestic Workers Alliance, will share her call-to-action against discrimination in the U.S. and urge individuals to join the fight for justice for all black lives.</p>\n<p>Garza will also be featured in a sustainability workshop at 12 p.m. Wednesday in the Associated Students (A.S.) Pardall Center to discuss student activism, strategizing and movement.</p>\n<p>The BLM movement started in 2012 after 17-year-old Trayvon Martin was posthumously put on trial for his own murder and the shooter, George Zimmerman, was acquitted of the murder charges.</p>\n<p>Martin’s death and Zimmerman’s acquisition sparked outrage across the country. Racial tension became the center of protests much like those in Ferguson, Missouri, in 2014 after Michael Brown, an unarmed black teenager, was shot and killed by then police officer Darren Wilson.</p>\n<p>These cases prompted grassroots community organizing like BLM in response to the rising number of police shootings across the country.</p>\n<p>The internet responded to the growing tensions with #BlackLivesMatter.</p>\n<p>Opal Tometi, Patrisse Cullors and Garza, the BLM founders, transformed the viral hashtag into a movement that is now a chapter-based national organization working for the validity of black life.</p>\n<p>According to their website, BLM strives to broaden the conversation around state violence to include all of the ways in which black people are intentionally left powerless at the hands of the state.</p>\n<p>“It was a response to the anti-Black racism that permeates our society and also, unfortunately, our movements,” wrote Garza in the “herstory” section of their website.</p>\n<p>Critics of the movement visited UCSB earlier this year and stirred controversy over free speech.</p>\n<p>Ben Shapiro, conservative political commentator and author, visited Campbell Hall in February for an event titled “The Regressive Left, ‘Social Justice’ and #BlackLivesMatter.” The lecture was previously entitled “Lies, Prejudice and Division: The Legacy of the #BLM Movement.”</p>\n<p>The event was preempted by a <a href=\"http://dailynexus.com/2016-11-03/a-s-senate-approves-funding-for-ben-shapiro-event-after-six-hour-meeting/\">six-hour-long A.S. Senate forum</a> in October during which several student groups, including the Black Students Union, expressed concern of hateful rhetoric rising from his speech. <a href=\"http://dailynexus.com/2017-02-23/ben-shapiro-packs-campbell-hall-for-controversial-lecture/\">Shapiro later called the opposition “sort of fascist.”</a></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77324\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77324\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/","id":2393,"author":{"id":87,"name":"Stephany Rubio"},"related":[2392,2391,2390],"comments":[],"followers":[]},"author":{"id":87,"name":"Stephany Rubio","biography":"Not available","articles":[2295,2312,2322,2324,2328,2330,2357,2358,2388,2393,2394,2395,2397,2399,2408,2718,2720,2772,3572,3612,3654,3768,3803,3822,3826,3923,3924,3929,3959,4360,4444],"portrait":"Not available"},"related":[{"title":"‘Green-Efficient’ Off-Campus Housing To Be Ready This Fall","category":"News","subcategory":"Campus","publish_date":"2017-04-20T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?resize=980%2C647&ssl=1","description":"Ongoing renovations of the San Joaquin apartment buildings are scheduled to be completed this coming fall, with an emphasis on sustainable and green energy as a focus for the renewal of the off-campus...","content":"<div class=\"single-post-content\">\n            <p>Ongoing renovations of the San Joaquin apartment buildings are scheduled to be completed this coming fall, with an emphasis on sustainable and green energy as a focus for the renewal of the off-campus dorms.</p>\n<div id=\"attachment_77138\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-77138\" data-attachment-id=\"77138\" data-permalink=\"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/san-joaquin-by-matthew-wu/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?fit=2048%2C1365&amp;ssl=1\" data-orig-size=\"2048,1365\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"San Joaquin by Matthew Wu\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?fit=888%2C592&amp;ssl=1\" class=\"size-large wp-image-77138\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu-1024x683.jpg?resize=888%2C592\" alt=\"\" width=\"888\" height=\"592\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?w=2048&amp;ssl=1 2048w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/San-Joaquin-by-Matthew-Wu.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-77138\" class=\"wp-caption-text\"><em>Matthew Wu / Daily Nexus</em></p></div>\n<p>Construction leads hope that the ambitious proceedings of these renovations can set forth a precedent in creating a more environmentally friendly setting within the campus and improving the quality and health of the lives of students who will be living in these off-campus dorms next year.</p>\n<p>The San Joaquin apartment renovations are one of the largest projects underway at UC Santa Barbara, with a proposed amount of $122 million going toward construction and an estimated 670,000 hours worked to date.</p>\n<p>Upon completion, it will accommodate 186 units, housing a total of 1,019 beds for potential students living on campus over 14 acres of site development, all while including new sustainable and energy-saving features.</p>\n<p>The apartments will use the standards of Leadership in Energy and Environmental Design (LEED), a global green building certification program, in addition to current campus green building goals in measuring their environmental efficiency.</p>\n<p>Such certifications are based on the various components of the apartment complex and how efficiently these different factors contribute to a more environmentally friendly site, according to the LEED construction certification requirements.</p>\n<p>Many of the buildings featured within the San Joaquin apartment complexes will be able to reach the LEED Gold standard, the second highest green-efficiency level behind Platinum.</p>\n<p>Among the new features of San Joaquin apartment complexes is a revamped version of the Portola Dining Commons, a marketplace at which students can buy groceries, as well as various outdoor recreational facilities such as basketball and volleyball courts.</p>\n<p>“It’s almost like a mini-campus away from campus,” said Marc Rousseau, the energy and environmental manager for residential operations. “[The marketplace] will make it easier for students to not have to go all the way down to Costco to shop for groceries.”</p>\n<p>Rousseau said the original intent behind making these apartments more environmentally friendly was in response to student demands at UC meetings in pushing for greener construction as well as sustainability in the buildings.</p>\n<p>“I like to say that it’s student-driven why we’re here,” he said.</p>\n<p>Brian Graham, project manager for the construction site, said in addition to the apartment buildings being more environmentally friendly, such installments will help save costs of maintenance and repair in the future.</p>\n<p>“A lot of the sustainable buildings do cost more upfront, but they do have a somewhat higher payback,” Graham said.</p>\n<p>Features such as sensor-based lights, which remotely turn off when not being used, as well as the use of recycled water, help alleviate the costs of energy consumption.</p>\n<p>Rousseau said while the environmental aspects of San Joaquin are major highlights in its construction, it is only one small project in the larger view of environmental conservation efforts.</p>\n<p>“This project isn’t going to save the world,” he said. “But it’s a great example of things that operators and building owners can do when they make a change.”</p>\n<p>Rousseau said such environmental efforts are created in the hopes of improving both the lives of students and workers within the community. Greater understanding of these environmental aspects can lead to more awareness of the topic of environmental conservation, he said.</p>\n<p>“It’s to build an environmentally friendly building and a building which students can live safely and learn in,” Rousseau said. “That’s why we’re here. And to live in a community that’s comfortable and healthy.”</p>\n<p><em>A version of this story appeared on p. 3 of the Thursday, April 20, 2017, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77184\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77184\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-20/san-joaquin-dorms-update/","id":2390,"author":{"id":97,"name":"Matthew Wu"},"related":[2389,2388,2387],"comments":[],"followers":[]},{"title":"SJP Proposes Bill to Divest from Alleged Palestinian Human Rights Abuses","category":"News","subcategory":"Campus","publish_date":"2017-04-27T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-27-at-12.37.21-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-27-at-12.37.21-PM.png?resize=770%2C548&ssl=1","description":"The student group UC Santa Barbara Students for Justice in Palestine (SJP) released a resolution this Sunday calling for Associated Students to divest from companies that contribute to what SJP calls ...","content":"<div class=\"single-post-content\">\n            <p align=\"JUSTIFY\">The student group UC Santa Barbara Students for Justice in Palestine (SJP) released a resolution this Sunday calling for Associated Students to divest from companies that contribute to what SJP calls an occupation of Palestine.</p>\n<p align=\"JUSTIFY\">The resolution calls for the university to examine and promptly disinvest from its assets that provide support for “occupying” Palestinian territories, building a wall in a highly disputed area, the West Bank, or developing Israeli settlements on “annexed” territories.</p>\n<p align=\"JUSTIFY\">SJP called for A.S., UCSB and the Regents to divest from Raytheon, Northrop Grumman, Caterpillar and Hewlett Packard in particular, though it said these are not the only companies contributing to Palestinian oppression, and the UC should divest from any of its assets profiting from such actions.</p>\n<p align=\"JUSTIFY\">The resolution was released on the night of Holocaust Remembrance Day in Israel. Critics believed the resolution’s timing was purposefully malicious. SJP released a statement on their Facebook page denouncing the implication that the post was anti-Semitic.</p>\n<p align=\"JUSTIFY\">The proposal was endorsed by 25 other student organizations including the A.S. Student Commission on Racial Equality, El Congreso and the Student Activist Network.</p>\n<p align=\"JUSTIFY\">Anumita Kaur, SJP member and fourth-year sociology major, sponsored the resolution, which she said SJP plans to place on the A.S. Senate agenda next week.</p>\n<p align=\"JUSTIFY\">Kaur said the student organization had two goals in creating the resolution, the first being the “tangible ask” of demanding UCSB and the UC system to remove funds from corporations that allegedly assist in violence against the Palestinian people.</p>\n<p align=\"JUSTIFY\">Kaur said the resolution was also meant to be a way for the UC system to be held accountable and to focus on making ethical investments at all times.</p>\n<p align=\"JUSTIFY\">Kaur said the organization’s second goal was to educate people.</p>\n<p align=\"JUSTIFY\">“A lot of people can’t even point to where Palestine is on the map, and it’s so important that people understand that this is a violence occurring on our globe,” she said.</p>\n<p align=\"JUSTIFY\">In an accompanying press release made public on Sunday, SJP said its resolution “is in no way intended to alienate students on campus; it is intended to create a critical dialogue about regimes participating in human rights violations.”</p>\n<p align=\"JUSTIFY\">The statement added that students were critical to social movements in the past and that UCSB must answer its duty as a top-level institution.</p>\n<p align=\"JUSTIFY\">“Students have historically been at the forefront of social justice movements, from the Civil Rights Movement to South African Apartheid, student power has been an integral part of progress and change,” the statement read.</p>\n<p align=\"JUSTIFY\">“Belonging to a top tier research institution, it is our duty to combat racism, patriarchy, homophobia, transphobia, imperialism, colonization and global inequality. We cannot exceptionalize Israel.”</p>\n<p align=\"JUSTIFY\">Sunday’s resolution and press release are part of a years-long student effort to call for Boycott, Divestment and Sanctions (BDS), a “nonviolent movement that was called for by Palestinian Civil Society in 2005 in response to Israel’s disregard for international law,” as the statement describes it.</p>\n<p align=\"JUSTIFY\">Kaur said she believes if people were more understanding of SJP’s perspective, they might have less “volatile opinions.”</p>\n<p align=\"JUSTIFY\">“I think the biggest thing to understand about this movement and this resolution is that it’s really just premised on love; it’s premised on, you know, a desire for global humanity,” Kaur said.</p>\n<p align=\"JUSTIFY\">“All it is in its inherent nature is asking the university to remove funds from American corporations that assist in violence against a people.”</p>\n<p align=\"JUSTIFY\"><em>A version of this story appeared on p.1 of the Thursday, April 26, 2017, print edition of the</em> Daily Nexus.</p>\n<div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77403\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77403\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/","id":2392,"author":{"id":86,"name":"Jose Ochoa"},"related":[2391,2390,2389],"comments":[],"followers":[]},{"title":"On-Campus Senator Silva Drops Out of IVP Race, Sandhu Now Runs Unopposed","category":"News","subcategory":"Campus","publish_date":"2017-04-23T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=768%2C512&ssl=1","description":"On-campus Senator Lesly Silva ended her campaign for internal vice president on Friday, leaving Jasmine Sandhu unopposed in her bid for the position.","content":"<div class=\"single-post-content\">\n            <p>On-campus Senator Lesly Silva ended her campaign for internal vice president on Friday, leaving Jasmine Sandhu, College of Letters and Science senator, unopposed in her bid for the position.</p>\n<p><img data-attachment-id=\"76545\" data-permalink=\"https://dailynexus.com/?attachment_id=76545\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=768%2C512&amp;ssl=1\" data-orig-size=\"768,512\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Lesly Silva\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=768%2C512&amp;ssl=1\" class=\"aligncenter size-full wp-image-76545\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=768%2C512\" alt=\"\" width=\"768\" height=\"512\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?w=768&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 768px) 100vw, 768px\" data-recalc-dims=\"1\"></p>\n<p>Silva announced she was dropping out of the race on Friday evening through a Facebook post.</p>\n<p>In an interview with the <i>Nexus, </i>Silva said she felt she had completed what she wanted while working as a senator and felt she could “best serve [her] community” in other positions.</p>\n<p>“I just really feel that I can do that in other positions more effectively,” Silva said. “I don’t have to compromise the power that comes with an executive A.S. position, and I can still get the work done that I want to do and collaborate with the groups I want to work with.”</p>\n<p>Silva said she is interested in working for the Division of Student Affairs, which she said is an “underrated” department on campus. Silva said she is interested in “bridging the gap” between administration and students and would like to involve more students in communicating with university officials.</p>\n<p>“I would like to invite more students to have a seat at the table,” Silva said.</p>\n<p>Now that Silva will not be serving in A.S., she said she would like the Senate to focus on accepting criticism because “it’s from a good place.”</p>\n<p>“In the coming year, I’d really like the Senate to really focus on serving folks who have always been underrepresented in this community and to actually be receptive to the criticism that they may receive,” she said.</p>\n<p>Silva said she is currently exploring her opportunities at UC Santa Barbara, but has not “necessarily shut out” the possibility of returning to A.S.</p>\n<p>Silva said she had no comment in regards to regarding Sandhu’s campaign.</p>\n<p>Sandhu declined to comment on Silva’s exit.</p>\n<p>Campaigning for A.S. elections will continue until Thursday night, when A.S. Elections Board will announce voting results.</p>\n<p>Profiles of all 51 A.S. candidates can be found <a href=\"http://dailynexus.com/interactives/aselections2017/\">here</a>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77257\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77257\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/","id":2391,"author":{"id":86,"name":"Jose Ochoa"},"related":[2390,2389,2388],"comments":[],"followers":[]}]},"__N_SSG":true}