{"pageProps":{"article":{"title":"A.S. Food Bank Begins Facility Expansion, Renovation","category":"News","subcategory":"Campus","publish_date":"2017-04-01T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2014/01/Ucen-Stock-JohnClow_1.14.2014-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2014/01/Ucen-Stock-JohnClow_1.14.2014-1.jpg?resize=520%2C300&ssl=1","description":"During construction, a temporary location will open up on the second floor of the UCen in the study space, across from Subway, where the old faculty lounge used to be.","content":"<div class=\"single-post-content\">\n            <p>The Associated Students Food Bank is currently in the process of expanding its facility to accommodate the growing number of students who seek its services.</p>\n<p>Construction for the expansion of the food bank, which is located on the third floor of the UCen, began during Spring Break and will continue into Spring Quarter.</p>\n<p>During construction, a temporary location will open up on the second floor of the UCen in the study space, across from Subway, where the old faculty lounge used to be. Days and hours of operation will remain the same.</p>\n<p>Breanna Jones, A.S. Food Bank committee chair, said food bank organizers are expanding into half of the neighboring study space, which will serve as the new lobby.</p>\n<p>Jones said they are removing the carpet in the current space to “get in line” with the university’s Environmental Health &amp; Safety codes.</p>\n<p>Food bank organizers are also renovating their current space and adding a new refrigerator to accommodate more produce.</p>\n<p>The total cost of the expansion will be $46,134.98, but of the total cost, $11,259.98 is still needed.</p>\n<p>Funding will come from the UCSB Food Security Task Force, the A.S. Environmental Affairs Board and the A.S. Food Bank budget. The remaining $11,259.98 that is still needed will come directly from A.S. funds, according to A.S. President Austin Hechler.</p>\n<p>Aside from the additional A.S. funding, the Class of 2017 will be giving a donation to the A.S. food bank as its class gift, as the <i><span style=\"font-weight: 400;\">Nexus</span></i><span style=\"font-weight: 400;\"> previously <a href=\"http://dailynexus.com/2016-10-11/2017-senior-class-gift-announced/\" target=\"_blank\">reported</a> in October 2016.</span></p>\n<p>“The senior class gift is focused on funding for more food in the future while the money that A.S. came up with is to help with the expansion cost,” said Hechler.</p>\n<p><span style=\"font-weight: 400;\">The A.S. Food Bank was founded in 2011 in response to rising tuition costs that left students in financial need.</span></p>\n<p><span style=\"font-weight: 400;\">The food bank currently receives approximately 500 visits a day and 1,200 visits a week. </span></p>\n<p><span style=\"font-weight: 400;\">On Mondays and Wednesdays, the food bank has fresh produce that it purchases from the Santa Barbara County Food Bank, but organizers mostly provide dry foods. </span></p>\n<p><span style=\"font-weight: 400;\">Jones said organizers hope to get fresh produce for all three days after the facility expansion. They plan to receive produce donations from Edible Campus, a student-run farm that is going to launch within the next year.</span></p>\n<p><span style=\"font-weight: 400;\">The expansion is happening at the same time that the UC Student Association picked student food and housing insecurities as their new initiative to focus on within the UC system. Hechler said 48 percent of students within the UCs identify as “food insecure.” </span></p>\n<p><span style=\"font-weight: 400;\">“I feel like our food bank is humbly tucked away in the UCen and no one really knows about it, but we serve about 1,200 students a week, and that’s unreal compared to others,” he said.</span></p>\n<p><span style=\"font-weight: 400;\">Hechler said he was the only one at the UC Council of Presidents who was able to say their campus had a successful food bank. He said UCSB is “way ahead” of other campuses in fighting student food insecurities. </span></p>\n<p><span style=\"font-weight: 400;\">Jones said that, aside from the food bank team, Hechler has “really pushed things forward to have things settled and made sure that the expansion happened.”</span></p>\n<p><span style=\"font-weight: 400;\">She also said the whole food bank team got together to fight for the expansion, and she hopes to see it completed before she graduates in June.</span></p>\n<p><span style=\"font-weight: 400;\">“Hopefully with the work that we’re doing, we can destigmatize the desire and need to get food aid when you need it,” Jones said.</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-76597\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-01/a-s-food-bank-begins-facility-expansion-renovation/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-76597\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-01/a-s-food-bank-begins-facility-expansion-renovation/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-01/a-s-food-bank-begins-facility-expansion-renovation/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-01/a-s-food-bank-begins-facility-expansion-renovation/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-01/a-s-food-bank-begins-facility-expansion-renovation/","id":2394,"author":{"id":87,"name":"Stephany Rubio"},"related":[2393,2392,2391],"comments":[],"followers":[]},"author":{"id":87,"name":"Stephany Rubio","biography":"Not available","articles":[2295,2312,2322,2324,2328,2330,2357,2358,2388,2393,2394,2395,2397,2399,2408,2718,2720,2772,3572,3612,3654,3768,3803,3822,3826,3923,3924,3929,3959,4360,4444],"portrait":"Not available"},"related":[{"title":"BLM Co-Founder Alicia Garza To Speak at UCSB","category":"News","subcategory":"Campus","publish_date":"2017-04-25T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-Shot-2017-05-01-at-5.38.44-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-Shot-2017-05-01-at-5.38.44-PM.png?resize=778%2C451&ssl=1","description":"Black Lives Matter co-founder Alicia Garza will be the keynote speaker for the “Black Liberation: The Rose That Grew From Concrete” event on Wednesday evening, during which she will be sharing her...","content":"<div class=\"single-post-content\">\n            <p>Black Lives Matter co-founder Alicia Garza will be the keynote speaker for the “Black Liberation: The Rose That Grew From Concrete” event on Wednesday evening, during which she will be sharing her thoughts about the BLM movement and addressing discrimination in the United States.</p>\n<p>The free event will be in Campbell Hall and is part of UC Santa Barbara’s BLM Week organized by the Resource Center for Sexual and Gender Diversity, the Black Student Engagement Program and Queer Commission. The week’s events aim to address the nature of institutionalized racism and its effect on society.</p>\n<p>Garza, current special projects director for the National Domestic Workers Alliance, will share her call-to-action against discrimination in the U.S. and urge individuals to join the fight for justice for all black lives.</p>\n<p>Garza will also be featured in a sustainability workshop at 12 p.m. Wednesday in the Associated Students (A.S.) Pardall Center to discuss student activism, strategizing and movement.</p>\n<p>The BLM movement started in 2012 after 17-year-old Trayvon Martin was posthumously put on trial for his own murder and the shooter, George Zimmerman, was acquitted of the murder charges.</p>\n<p>Martin’s death and Zimmerman’s acquisition sparked outrage across the country. Racial tension became the center of protests much like those in Ferguson, Missouri, in 2014 after Michael Brown, an unarmed black teenager, was shot and killed by then police officer Darren Wilson.</p>\n<p>These cases prompted grassroots community organizing like BLM in response to the rising number of police shootings across the country.</p>\n<p>The internet responded to the growing tensions with #BlackLivesMatter.</p>\n<p>Opal Tometi, Patrisse Cullors and Garza, the BLM founders, transformed the viral hashtag into a movement that is now a chapter-based national organization working for the validity of black life.</p>\n<p>According to their website, BLM strives to broaden the conversation around state violence to include all of the ways in which black people are intentionally left powerless at the hands of the state.</p>\n<p>“It was a response to the anti-Black racism that permeates our society and also, unfortunately, our movements,” wrote Garza in the “herstory” section of their website.</p>\n<p>Critics of the movement visited UCSB earlier this year and stirred controversy over free speech.</p>\n<p>Ben Shapiro, conservative political commentator and author, visited Campbell Hall in February for an event titled “The Regressive Left, ‘Social Justice’ and #BlackLivesMatter.” The lecture was previously entitled “Lies, Prejudice and Division: The Legacy of the #BLM Movement.”</p>\n<p>The event was preempted by a <a href=\"http://dailynexus.com/2016-11-03/a-s-senate-approves-funding-for-ben-shapiro-event-after-six-hour-meeting/\">six-hour-long A.S. Senate forum</a> in October during which several student groups, including the Black Students Union, expressed concern of hateful rhetoric rising from his speech. <a href=\"http://dailynexus.com/2017-02-23/ben-shapiro-packs-campbell-hall-for-controversial-lecture/\">Shapiro later called the opposition “sort of fascist.”</a></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77324\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77324\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-25/blm-cofounder-to-speak-at-ucsb/","id":2393,"author":{"id":87,"name":"Stephany Rubio"},"related":[2392,2391,2390],"comments":[],"followers":[]},{"title":"SJP Proposes Bill to Divest from Alleged Palestinian Human Rights Abuses","category":"News","subcategory":"Campus","publish_date":"2017-04-27T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-27-at-12.37.21-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-27-at-12.37.21-PM.png?resize=770%2C548&ssl=1","description":"The student group UC Santa Barbara Students for Justice in Palestine (SJP) released a resolution this Sunday calling for Associated Students to divest from companies that contribute to what SJP calls ...","content":"<div class=\"single-post-content\">\n            <p align=\"JUSTIFY\">The student group UC Santa Barbara Students for Justice in Palestine (SJP) released a resolution this Sunday calling for Associated Students to divest from companies that contribute to what SJP calls an occupation of Palestine.</p>\n<p align=\"JUSTIFY\">The resolution calls for the university to examine and promptly disinvest from its assets that provide support for “occupying” Palestinian territories, building a wall in a highly disputed area, the West Bank, or developing Israeli settlements on “annexed” territories.</p>\n<p align=\"JUSTIFY\">SJP called for A.S., UCSB and the Regents to divest from Raytheon, Northrop Grumman, Caterpillar and Hewlett Packard in particular, though it said these are not the only companies contributing to Palestinian oppression, and the UC should divest from any of its assets profiting from such actions.</p>\n<p align=\"JUSTIFY\">The resolution was released on the night of Holocaust Remembrance Day in Israel. Critics believed the resolution’s timing was purposefully malicious. SJP released a statement on their Facebook page denouncing the implication that the post was anti-Semitic.</p>\n<p align=\"JUSTIFY\">The proposal was endorsed by 25 other student organizations including the A.S. Student Commission on Racial Equality, El Congreso and the Student Activist Network.</p>\n<p align=\"JUSTIFY\">Anumita Kaur, SJP member and fourth-year sociology major, sponsored the resolution, which she said SJP plans to place on the A.S. Senate agenda next week.</p>\n<p align=\"JUSTIFY\">Kaur said the student organization had two goals in creating the resolution, the first being the “tangible ask” of demanding UCSB and the UC system to remove funds from corporations that allegedly assist in violence against the Palestinian people.</p>\n<p align=\"JUSTIFY\">Kaur said the resolution was also meant to be a way for the UC system to be held accountable and to focus on making ethical investments at all times.</p>\n<p align=\"JUSTIFY\">Kaur said the organization’s second goal was to educate people.</p>\n<p align=\"JUSTIFY\">“A lot of people can’t even point to where Palestine is on the map, and it’s so important that people understand that this is a violence occurring on our globe,” she said.</p>\n<p align=\"JUSTIFY\">In an accompanying press release made public on Sunday, SJP said its resolution “is in no way intended to alienate students on campus; it is intended to create a critical dialogue about regimes participating in human rights violations.”</p>\n<p align=\"JUSTIFY\">The statement added that students were critical to social movements in the past and that UCSB must answer its duty as a top-level institution.</p>\n<p align=\"JUSTIFY\">“Students have historically been at the forefront of social justice movements, from the Civil Rights Movement to South African Apartheid, student power has been an integral part of progress and change,” the statement read.</p>\n<p align=\"JUSTIFY\">“Belonging to a top tier research institution, it is our duty to combat racism, patriarchy, homophobia, transphobia, imperialism, colonization and global inequality. We cannot exceptionalize Israel.”</p>\n<p align=\"JUSTIFY\">Sunday’s resolution and press release are part of a years-long student effort to call for Boycott, Divestment and Sanctions (BDS), a “nonviolent movement that was called for by Palestinian Civil Society in 2005 in response to Israel’s disregard for international law,” as the statement describes it.</p>\n<p align=\"JUSTIFY\">Kaur said she believes if people were more understanding of SJP’s perspective, they might have less “volatile opinions.”</p>\n<p align=\"JUSTIFY\">“I think the biggest thing to understand about this movement and this resolution is that it’s really just premised on love; it’s premised on, you know, a desire for global humanity,” Kaur said.</p>\n<p align=\"JUSTIFY\">“All it is in its inherent nature is asking the university to remove funds from American corporations that assist in violence against a people.”</p>\n<p align=\"JUSTIFY\"><em>A version of this story appeared on p.1 of the Thursday, April 26, 2017, print edition of the</em> Daily Nexus.</p>\n<div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77403\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77403\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-27/26-student-groups-support-bds-resolution/","id":2392,"author":{"id":86,"name":"Jose Ochoa"},"related":[2391,2390,2389],"comments":[],"followers":[]},{"title":"On-Campus Senator Silva Drops Out of IVP Race, Sandhu Now Runs Unopposed","category":"News","subcategory":"Campus","publish_date":"2017-04-23T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=768%2C512&ssl=1","description":"On-campus Senator Lesly Silva ended her campaign for internal vice president on Friday, leaving Jasmine Sandhu unopposed in her bid for the position.","content":"<div class=\"single-post-content\">\n            <p>On-campus Senator Lesly Silva ended her campaign for internal vice president on Friday, leaving Jasmine Sandhu, College of Letters and Science senator, unopposed in her bid for the position.</p>\n<p><img data-attachment-id=\"76545\" data-permalink=\"https://dailynexus.com/?attachment_id=76545\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=768%2C512&amp;ssl=1\" data-orig-size=\"768,512\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Lesly Silva\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?fit=768%2C512&amp;ssl=1\" class=\"aligncenter size-full wp-image-76545\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=768%2C512\" alt=\"\" width=\"768\" height=\"512\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?w=768&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/03/Lesly-Silva.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 768px) 100vw, 768px\" data-recalc-dims=\"1\"></p>\n<p>Silva announced she was dropping out of the race on Friday evening through a Facebook post.</p>\n<p>In an interview with the <i>Nexus, </i>Silva said she felt she had completed what she wanted while working as a senator and felt she could “best serve [her] community” in other positions.</p>\n<p>“I just really feel that I can do that in other positions more effectively,” Silva said. “I don’t have to compromise the power that comes with an executive A.S. position, and I can still get the work done that I want to do and collaborate with the groups I want to work with.”</p>\n<p>Silva said she is interested in working for the Division of Student Affairs, which she said is an “underrated” department on campus. Silva said she is interested in “bridging the gap” between administration and students and would like to involve more students in communicating with university officials.</p>\n<p>“I would like to invite more students to have a seat at the table,” Silva said.</p>\n<p>Now that Silva will not be serving in A.S., she said she would like the Senate to focus on accepting criticism because “it’s from a good place.”</p>\n<p>“In the coming year, I’d really like the Senate to really focus on serving folks who have always been underrepresented in this community and to actually be receptive to the criticism that they may receive,” she said.</p>\n<p>Silva said she is currently exploring her opportunities at UC Santa Barbara, but has not “necessarily shut out” the possibility of returning to A.S.</p>\n<p>Silva said she had no comment in regards to regarding Sandhu’s campaign.</p>\n<p>Sandhu declined to comment on Silva’s exit.</p>\n<p>Campaigning for A.S. elections will continue until Thursday night, when A.S. Elections Board will announce voting results.</p>\n<p>Profiles of all 51 A.S. candidates can be found <a href=\"http://dailynexus.com/interactives/aselections2017/\">here</a>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77257\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77257\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-23/on-campus-senator-silva-drops-out-of-ivp-race-sandhu-now-unapposed/","id":2391,"author":{"id":86,"name":"Jose Ochoa"},"related":[2390,2389,2388],"comments":[],"followers":[]}]},"__N_SSG":true}