{"pageProps":{"article":{"title":"Regents Address Tuition","category":"News","subcategory":"Campus","publish_date":"2017-01-26T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-18-at-2.27.21-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-18-at-2.27.21-PM.png?resize=980%2C647&ssl=1","description":"The UC Board of Regents met in San Francisco Wednesday to discuss a proposal to raise tuition for the first time since 2011.","content":"<div class=\"single-post-content\">\n            <p>The UC Board of Regents met in San Francisco Wednesday to discuss a proposal to raise tuition for the first time since 2011.</p>\n<p>UC President Janet Napolitano presented in early January the proposal to raise tuition by 2.5 percent for the 2017-18 academic year. In-state tuition has remained at $11,220 since the 2011-12 academic year, and this proposed hike will increase tuition by $282.</p>\n<p>During the public forum, the Regents received several remarks on the tuition increase, which will be voted on during Thursday morning’s meeting. Commenters also critiqued some of the logistical problems with the UC’s intended expansion, as the UC intends to enroll an additional 10,000 students over the next three years.</p>\n<p>Susan Willats, an employee at UC Santa Cruz for 30 years, said the University’s increased student population has caused practical issues for the school, as the amount of students it admitted increased in the fall.</p>\n<p>“Because there was neither time nor funding to create a corresponding increase in infrastructure, we have far exceeded our resources,” she said.</p>\n<p>Several double rooms have been converted into triples, she said, and the residential lounges have been eliminated to provide more bed space, leaving students with not enough spaces to study.</p>\n<p>“This over-enrollment has not only added to the unsustainable workload of faculty and staff, but it has absolutely diminished the quality of the educational experience that the university provides,” Willats said.</p>\n<p>While concerns over growth were prevalent at the public forum, many also chose to focus on the upcoming vote on Thursday to increase tuition. President of the Council of UC Faculty Associations (CUCFA) and UCSF Professor Stanton Glantz was among several who spoke out against the decision.</p>\n<p>“I appreciate the fact that it costs money to run this place and the only real two places to get it is from the taxpayers or from the students and their families,” he said. “It’s very disappointing that you are going to be continuing Arnold Schwarzenegger’s failed policy of privatization which has generated over $12 billion in student debt since 2000.”</p>\n<p>Glantz also mentioned a report endorsed by faculty, students and staff organizations from all across UC, CSU and the community colleges that shows “the effect of the privatization and the fact that this could be fixed.” He held up the report at the public forum and encouraged that Regents use it to reform the current tuition system.</p>\n<p>Undergraduate students as well as faculty spoke at the forum. One UC Riverside undergraduate student criticized the tuition hike, saying the UC system takes pride in its “pillars of accessibility, affordability and quality” but is “sorely deficient” on all three. She said students’ wages could not be expected to cover rising costs.</p>\n<p>“If we place the burden of the cost of education on students who aren’t able to make above minimum wage on a part-time income to supplement the tuition costs that are already increasing, how do we reasonably expect any of them to be able to afford the increasing costs that you are trying to implement now?” she said.</p>\n<p>Alex Lee, the president of Associated Students of UC Davis (ASUCD), also asked the Regents to reject the proposed hike.</p>\n<p>“We as UC students are constantly the ones being harmed and taxed … I ask you, the Regents, to seek alternative sources of funding as well as maximize the money we currently have by cutting unnecessary expenses at the campus level and prioritize the educational experience,” Lee said. “On behalf of UC Davis and UC students, I ask you not to raise tuition.”</p>\n<p>In reference to tomorrow’s tuition vote, Monica Lozano, the chair of the board, said she looks forward to tomorrow’s discussion in action.</p>\n<p>The Regents plan to vote on the contentious issue of tuition hikes on Thursday morning after another session of public comment.</p>\n<p><em>A version of this story appeared on p. 1 of the Thursday, Jan. 26, 2017 edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-75244\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-75244\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-01-26/regents-address-tuition/","id":2425,"author":{"id":86,"name":"Jose Ochoa"},"related":[2424,2423,2422],"comments":[],"followers":[]},"author":{"id":86,"name":"Jose Ochoa","biography":"Not available","articles":[2286,2364,2385,2391,2392,2400,2404,2416,2419,2421,2424,2425,2429,2430,2443,3574,3584,3601,3737,3749,3756,3757,3763,3786,3801,3806,3908,3910,3920,3925,3926,3952,4280,4291,4313,4352,4357,4386,4387,4388,4389,4392,4393,4394,4395,4403,4404,4406,4408,4409,4423,4426,4435,4442,4449,4465,4489,7780],"portrait":"Not available"},"related":[{"title":"Inspiring Student, Role Model Passes at Age 25","category":"News","subcategory":"Campus","publish_date":"2017-04-06T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-10-at-5.55.05-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-10-at-5.55.05-PM.png?resize=635%2C368&ssl=1","description":"Ismael Hernandez transferred from SBCC and was prepared to graduate from UCSB in June with a degree in biology. ","content":"<div class=\"single-post-content\">\n            <p>A UC Santa Barbara student died on March 7 due to natural causes.</p>\n<p>Ismael Hernandez, 25, was a Santa Barbara native and a transfer student from Santa Barbara City College (SBCC). He was set to graduate in June with a degree in biological sciences.</p>\n<div id=\"attachment_76671\" style=\"width: 802px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-76671\" data-attachment-id=\"76671\" data-permalink=\"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/ismael/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?fit=1583%2C2048&amp;ssl=1\" data-orig-size=\"1583,2048\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"ismael\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?fit=193%2C250&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?fit=792%2C1024&amp;ssl=1\" class=\"size-large wp-image-76671\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael-792x1024.jpg?resize=792%2C1024\" alt=\"\" width=\"792\" height=\"1024\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?resize=792%2C1024&amp;ssl=1 792w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?resize=193%2C250&amp;ssl=1 193w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?resize=768%2C994&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/ismael.jpg?w=1583&amp;ssl=1 1583w\" sizes=\"(max-width: 792px) 100vw, 792px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-76671\" class=\"wp-caption-text\"><em>Courtesy of Kathy Lopez</em></p></div>\n<p>“He was really proud of the education that he worked really hard for,” said Marilyn Rodriguez, who became a close friend to Hernandez at SBCC. “Getting his degree at UCSB was the biggest thing. It was a dream come true.”</p>\n<p>Hernandez had a “wakeup call” at the age of 17, she said, when his mother passed away around the same time he faced incarceration in juvenile hall. He attended his mother’s funeral in handcuffs, and he realized soon after that he needed to change his life for the sake of his three younger siblings.</p>\n<p>“He knew that if he continued on the path of delinquency or anything like that, it wouldn’t lead him to be a great role model for his siblings,” Rodriguez said. “At the end of the day, that’s what his mom wanted him to be; she wanted him to go to school and do great things.”</p>\n<p>Hernandez later graduated from a continuation high school and went on to enroll in Transitions, a program at SBCC which seeks to provide educational opportunities to individuals released from the criminal justice system.</p>\n<p>Noel Gomez, a Transitions program counselor, remembers Hernandez telling the class on the first day that he was going to graduate from SBCC with a degree in biological sciences, go on to UCSB and become a doctor.</p>\n<p>“I can’t tell you how many times I hear that from a lot of students. Within a semester, students drop out or they don’t carry on with their goals. He actually went on and did it,” Gomez said.<br>\nFrom then on, everyone in the class started calling him “the doctor,” Gomez said. Hernandez valued hard work and would often study in the library for hours on end.</p>\n<p>“He couldn’t understand why people would come to SBCC and not focus on school,” Gomez said. “He took that as an opportunity that a lot of people don’t have, and he wanted to use it.”</p>\n<p>After five years at SBCC, Hernandez became the first in his family to graduate from college. He applied and got accepted into his dream school, UCSB, where he continued his studies in biology.</p>\n<p>His classmate and close friend Kathy Lopez said he kept to his diligent study habits, which he had maintained at SBCC. He volunteered in the emergency room at Santa Barbara Cottage Hospital, and he had plans to go to nursing school after graduation.</p>\n<p>Lopez said she and Hernandez would often hang out together after their biology classes. She said he would always want to stop by Root 217 in the UCen so that he could get “that fish sandwich he always wanted.”</p>\n<p>Lopez said one of the fondest memories she has with Hernandez is when they were reflecting on graduation by the UCSB Lagoon.</p>\n<p>“We were walking over past the lagoon — it was a really nice day, actually, and the lagoon didn’t smell so bad either — and he just looked over at the lagoon and was like, ‘Kathy, we actually did this; we’re actually here and we’re actually graduating. We made it,’” she said, adding that the two of them paid a visit to Root 217 soon after.</p>\n<p>Hernandez worked as a cashier at a liquor store to support his education and family. His sister, Karinna Hernandez, said he often told customers that he would take care of them when he became a doctor.</p>\n<p>His sister also said he greatly valued his family and that he especially loved his nieces.</p>\n<p>“He used to love being with my kids,” she said. “Every time he saw them, he would always give them kisses, and he’d always hold my oldest daughter and tell her he could bless her. He would always kiss her hand and tell her it was his blessing.”</p>\n<p>Karinna Hernandez said her brother became a role model for the family. She said he often encouraged her to prioritize her education, helping her pick her classes at SBCC and advising her to sit at the front of her classes.</p>\n<p>“He was a caring person with a big heart,” she said. “His smile was something that I think nobody can forget. He was such a loving person.”</p>\n<p>Friends and family held a funeral service for Hernandez on March 16 at Our Lady of Guadalupe in Santa Barbara. He was buried with his bachelor’s degree in biological sciences.</p>\n<p><em>A version of this story appeared on p. 7 of the Thursday, April 6, 2017, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-76689\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-76689\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-06/ismael-hernandez-obit/","id":2422,"author":{"id":30,"name":"Josh Ortiz"},"related":[2421,2420,2419],"comments":[],"followers":[]},{"title":"Embattled Student’s Suspension Lifted","category":"News","subcategory":"Campus","publish_date":"2017-04-06T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/09/campus.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/09/campus.jpg?resize=740%2C325&ssl=1","description":"A judge has ruled that a UC Santa Barbara freshman who sued the university may now return to school after over 200 days of indefinite suspension.","content":"<div class=\"single-post-content\">\n            <p>A judge has ruled that a UC Santa Barbara freshman who sued the university may now return to school after over 200 days of indefinite suspension.</p>\n<p>The student, listed in court documents as John Doe, was initially barred from attending school after UCSB opened a Title IX investigation against him.</p>\n<p>The university opened an investigation after it discovered a 19-second video in which Doe and his ex-girlfriend argued on camera before the screen went black.</p>\n<p>In the video, Doe told his then-girlfriend she “already busted [her] lip, I can bust it up even more,” according to a brief from the UC Regents to the appellate court during a previous part of the litigation process.</p>\n<p>University officials said this video is evidence that Doe hit his then-girlfriend, and they wrote in court documents that “the 19-second video depicting [Doe] threatening to assault a young woman amply justified the interim suspension while the University completes its investigation.”</p>\n<p>The investigation by UCSB, which has yet to place charges on the student, is ongoing without major developments, and key witnesses have not been interviewed.</p>\n<p>Judge Thomas P. Anderle, the judge who ruled that the student may return to school, said that the evidence in the case “suggests UCSB never made an effort to contact Jane Doe to corroborate the statements attributed to her.”</p>\n<p>John Doe’s suspension will remain lifted even if the university places charges against the freshman. The stay on the suspension will remain in effect “up to and including any final judgment in that case, after all appeals, if any,” according to Judge Anderle’s ruling.</p>\n<p>The court ruled that UCSB must also assist Doe by giving him full access to all programs and activities at UCSB with no restrictions, returning him to his assigned on-campus dorm room, allowing him to complete all classes, giving him priority enrollment and providing any assistance necessary from any of the university offices.</p>\n<p>Judge Anderle said in his decision that the university took too long to investigate, failing to fulfill both the 60-calendar-day deadline federally required for Title IX investigations and the 60-business-day deadline agreed upon by the university.</p>\n<p>“The Court of Appeal found that the University’s inaction over such a lengthy period of time, leaving Petitioner in limbo, appears unreasonable and arbitrary,” Judge Anderle said in the court ruling.</p>\n<p>Judge Anderle ruled that the university had caused “irreparable harm” to the student by failing to conduct the investigation in a timely manner, leaving him suspended indefinitely.</p>\n<p>“This Court concludes that the University is intentionally doing indirectly what it is unwilling to do directly. The University has made a decision to deny John Doe the opportunity to enroll in the any [sic] of the first three quarters of his freshman year,” Anderle said in the court ruling. “But instead of making that decision based upon the facts, the law, and in fairness, it has decided to do it their own way.”</p>\n<p>According to Doe’s lawyer, Robert Ottilie, Doe moved into his on-campus dorm during Spring Break and said the university has been very helpful with the process of assimilating Doe to life in college.</p>\n<p>“They could not have been more helpful. The school has been responsive to the ruling,” Ottilie said.<br>\nUCSB spokeswoman Andrea Estrada said the university “will make every effort to ensure the student’s success” while they complete the adjudication process.</p>\n<p>“We respect the court’s rulings and have complied with the court’s order,” she said in an email.<br>\nOttilie said Doe is very happy with the decision because it now allows him to start his life, beginning with attending his “dream school.”</p>\n<p>Ottilie said he was not surprised by the judge’s ruling to remove Doe’s suspension, as he felt the law was clearly on his side.</p>\n<p>“It really wasn’t very much of a surprise. The law is very clear,” he said.</p>\n<p>Despite the fact that Doe has won his ruling to return to school, he still faces an ongoing investigation against him on behalf of the university, a lawsuit against that claim in court and several hundreds of thousands of dollars in lawyers’ fees that he must pay.</p>\n<p>According to the ruling, Doe has incurred over $100,000 in attorney’s fees and costs just through his filing in December of 2016. The ruling said he has “undoubtedly incurred substantially more in fees and costs since that time.”</p>\n<p>Ottilie said Doe is unable to pay that amount of money and does not expect him to pay the expenses anytime soon. Ottilie himself has incurred $50,000 of out-of-pocket costs from representing Doe against the university.</p>\n<p>As for what Doe will decide to study now that he has started school this Spring Quarter, Ottilie said he does not know what particular major the first-year will choose while at UCSB. Ottilie said it would not surprise him if Doe went on to study law later on.</p>\n<p>Ottilie also said he will continue to investigate abuses of the particular code in the Regents’ laws that the university has used to keep Doe and students in similar situations from attending school.</p>\n<p>Ottilie said new information has come out that suggests the university withheld information during the judicial process, so he also plans to amend the lawsuit to include four UCSB staff members involved in Doe’s 200-day suspension.</p>\n<p>Included in the proposed amendment are Kristi Johnson, principal investigative analyst of the Title IX office; Margaret Klawunn, vice chancellor for student affairs; Sandra Vasquez, associate dean of judicial affairs; and Brian Quillen, also principal investigative analyst of the Title IX office.</p>\n<p>Estrada said the university has not yet seen any amended complaint.</p>\n<p><em>A version of this story appeared on p. 4 of the Thursday, April 6, 2017, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-76691\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-76691\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/","id":2424,"author":{"id":86,"name":"Jose Ochoa"},"related":[2423,2422,2421],"comments":[],"followers":[]},{"title":"UCSB Mourns Loss of ‘Selfless’ Grad Student","category":"News","subcategory":"Campus","publish_date":"2017-04-06T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-06-at-5.25.51-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Screen-shot-2017-04-06-at-5.25.51-PM.png?resize=661%2C468&ssl=1","description":"Samuel “Sam” Boldissar died on March 25 while rock climbing in Joshua Tree. He was a third-year doctoral student described as being “true to his own tastes.”","content":"<div class=\"single-post-content\">\n            <p>A UC Santa Barbara graduate student died rock climbing on Mar. 25 in Joshua Tree National Park following an equipment malfunction.</p>\n<div id=\"attachment_76674\" style=\"width: 163px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-76674\" data-attachment-id=\"76674\" data-permalink=\"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/sam-obit/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?fit=660%2C1077&amp;ssl=1\" data-orig-size=\"660,1077\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"sam obit\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?fit=153%2C250&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?fit=628%2C1024&amp;ssl=1\" class=\"wp-image-76674 size-medium\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit-153x250.jpg?resize=153%2C250\" alt=\"\" width=\"153\" height=\"250\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?resize=153%2C250&amp;ssl=1 153w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?resize=628%2C1024&amp;ssl=1 628w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/sam-obit.jpg?w=660&amp;ssl=1 660w\" sizes=\"(max-width: 153px) 100vw, 153px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-76674\" class=\"wp-caption-text\"><em>Courtesy of Jaclyn Rebecca</em></p></div>\n<p>Samuel “Sam” Ira Boldissar, 25, was a third-year doctoral student in the chemistry department and a member of the de Vries Research Group under Professor Mattanjah de Vries.</p>\n<p>According to his girlfriend, Jaclyn Rebecca, Boldissar enjoyed being outdoors and had been rock climbing since he was a toddler.</p>\n<p>“He loved to go to Joshua Tree to rock climb,” Rebecca said. “His parents would put him in ropes and have him pretend to rock climb. He was always rock climbing, always.”</p>\n<p>Jordan Hughes was a housemate of Boldissar and met him in 2014 when they began graduate school at UCSB. He said Boldissar came from a “family of climbers.”</p>\n<p>Boldissar enjoyed rock climbing, backpacking and camping. He also loved the Red Hot Chili Peppers, cooking and brewing his own beer.</p>\n<p>Hughes said Boldissar was “true to his own tastes” and interested in a variety of different things.</p>\n<p>“He spent his time on things he found intrinsically interesting,” Hughes said in an email. “He wasn’t in grad school for the degree. He did it because the problems he worked on were important and interesting to him.”</p>\n<p>A problem solver, Hughes said Boldissar once created a skunk trap in their backyard in Isla Vista. One night, he went to check on the trap and a skunk wandered into the house through the opened door.</p>\n<p>“Lots of yelling ensued and we miraculously avoided getting skunk spray in our house, but we did decide that the best defense was probably just to keep the door shut,” Hughes said in an email.</p>\n<p>Haley Snyder was Boldissar’s neighbor in Isla Vista and said “the best” she saw Boldissar was when they would sit in the living room “singing and playing drums.”</p>\n<p>“There’s not many people that you’re going to meet that were as genuine or as kind as Sam,” Snyder said.</p>\n<p>As an undergraduate transfer student at UCSB, Boldissar lived with seven other Isla Vistans: Patrick Sheehan, Paul Mazzella, Mike Wood, Tyler Rowe, Shelby Hendricks, Lewis Durand and Erik Romelfanger.</p>\n<p>Sheehan said the group lived together on the 68-block of Sabado.</p>\n<p>Sheehan and Mazzella explained how they once wrote a song for Boldissar titled, “Sammy Come Home,” because he was always working on campus at the Chemistry lab.</p>\n<p>“We ended up singing [the song] for the rest of the year and it sort of resonates right now,” Mazzella said.</p>\n<p>“We’d play it for him all the time and he’d think it was funny,” Sheehan added. “And now Sam has passed away and we want Sammy to come home. We loved him so much and wanted him around so much that we wrote a song about it.”</p>\n<p>Rebecca described Boldissar as “selfless” and said he “really just wanted to help anyone in need.”</p>\n<p>Rebecca said she and Boldissar went to Big Bear with friends and he helped a group of people get their car out of a ditch on the icy road.</p>\n<p>“Sam just walked over without a second thought … to go help these people, and he just got on the bumper and started pushing as hard as he could,” she said. “He’s the reason the car got out of the ditch. He did things like that all the time.”</p>\n<p>Rebecca and Boldissar were together for six months and she said they enjoyed taking walks on the beach and introducing each other to the things they each liked to do.</p>\n<p>Boldissar took Rebecca to the Santa Barbara Rock Gym and went to musicals like “Beauty and the Beast” because Rebecca loves musicals.</p>\n<p>Professor de Vries described Boldissar as “brilliant” and always willing to help other students in the research group with their own projects.</p>\n<p>“He was very good but in a humble way,” de Vries said. “He was involved in every project in the lab and helped every other student in the group.”</p>\n<p>Boldissar worked on multiple projects in the research group, and his most recent projects are being compiled for publication.</p>\n<p>“It’s wonderful his name is going to be in publications and in scientific journals,” Rebecca said. “I’m glad people are going to see the hard work he did.”</p>\n<p>Professor de Vries said he wants Boldissar to be remembered “with a smile.”</p>\n<p>“He always had this smile and everybody in our group is touched by him,” de Vries said. “He’s been so influential … [and] he had no idea how smart he was. There was never any showing off. It was just that smile.”</p>\n<p>Boldissar’s funeral will be held on April 22 at 11 a.m. at Redondo Union High School.</p>\n<p><em>A version of this story appeared on p. 7 of the Thursday, April 6, 2017, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-76687\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-76687\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-06/ucsb-mourns-loss-of-selfless-grad-student/","id":2423,"author":{"id":84,"name":"Maura Fox"},"related":[2422,2421,2420],"comments":[],"followers":[]}]},"__N_SSG":true}