{"pageProps":{"article":{"title":"Travel Ban Bars 3 Students From U.S. Return","category":"News","subcategory":"Campus","publish_date":"2017-02-02T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=720%2C647&ssl=1","description":"In a press release Saturday, the UC Office of the President advised students from the seven countries listed in the executive order to not travel outside the United States. OISS recommends that all in...","content":"<div class=\"single-post-content\">\n            <p>President Donald Trump’s travel ban is currently barring three Iranian students from returning to UC Santa Barbara, the Office of International Students and Scholars (OISS) confirmed Wednesday.</p>\n<p>Navid Yousefian Jazi, a Ph.D. student who took a leave of absence in fall, is one of three who may not be able to return from Iran. He told the <em>Nexus</em> Monday that he fears he may not be able to finish his degree in political science.</p>\n<p>Maryam Rasekh, a former UCSB researcher who was set to begin a Ph.D. program in electrical engineering, is also affected. According to her boyfriend, Hassan Arbabi, a researcher with UCSB’s mechanical engineering department, the U.S. embassy in Ankara, Turkey, approved her visa just hours before Trump’s executive order banned her entry last Friday.</p>\n<p>OISS director Simran Singh said she could not reveal the identity of the third student for security reasons, but she confirmed the student is also from Iran and is currently on a leave of absence.</p>\n<div id=\"attachment_75415\" style=\"width: 730px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-75415\" data-attachment-id=\"75415\" data-permalink=\"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/immigration1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?fit=720%2C720&amp;ssl=1\" data-orig-size=\"720,720\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"immigration(1)\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?fit=250%2C250&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?fit=720%2C720&amp;ssl=1\" class=\"size-full wp-image-75415\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=720%2C720\" alt=\"\" width=\"720\" height=\"720\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?w=720&amp;ssl=1 720w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=260%2C260&amp;ssl=1 260w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=250%2C250&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=100%2C100&amp;ssl=1 100w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=32%2C32&amp;ssl=1 32w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=50%2C50&amp;ssl=1 50w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=64%2C64&amp;ssl=1 64w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=96%2C96&amp;ssl=1 96w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/02/immigration1.jpg?resize=128%2C128&amp;ssl=1 128w\" sizes=\"(max-width: 720px) 100vw, 720px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-75415\" class=\"wp-caption-text\"><em>Kevin Son / Daily Nexus</em></p></div>\n<p>“We’re absolutely in touch with all them, giving them all the information we have and working closely with them,” Singh said.</p>\n<p>Trump’s executive order, signed last Friday, bans the entry of all immigrants from Iraq, Syria, Libya, Somalia, Sudan, Yemen and Iran for 90 days.</p>\n<p>According to fall 2016 UC enrollment figures, there are a total of 40 international students at UCSB from the seven countries listed in the travel ban. One of these students is an undergraduate from Syria, two are undergraduates from Iran and the remaining 37 are graduate students from Iran.</p>\n<p>According to Janet Afary, a professor of Iranian studies, there is “a great deal of anxiety” among graduate students at UCSB who cannot return to Iran in fear that their visas may not be renewed.</p>\n<p>Leila Zonouzi, an Iranian student pursuing a Ph.D. in global studies, planned to wed her fiance this summer. She said her parents and in-laws are in Iran, but since the executive order halted immigration from that country, they are unable to fly to the U.S. for the wedding.</p>\n<p>“I won’t be able to get married because, well, let’s face it, without our parents, who are we celebrating with?” she said.</p>\n<p>Zonouzi said the travel ban also affects visas for her fiancé’s job and her academic career. Her fiancé, who is also Iranian with a visa expiring in a year, may not apply for an H-1 visa or a green card “if this continues.” Zonouzi has a two-year visa expiring in June 2018 while enrolled in a five- to seven-year program.</p>\n<p>“With this rate of madness, I’m not actually sure I can extend it and be a Ph.D. candidate,” Zonouzi said.</p>\n<p>Another UCSB student affected by the travel ban is Mahdi Golkaram, an Iranian mechanical engineering Ph.D. student who said he won’t be able to see his parents for years. His parents received their visas two weeks ago after applying at the U.S. embassy and undergoing a background check for nine months.</p>\n<p>“Because of the executive order, they can’t come to the United States because anyone from Iran is banned from entering the United States using any passport visa,” Golkaram said.</p>\n<p>The ban has also affected Golkaram’s job opportunities. He said he doesn’t know if he can apply for Curricular Practical Training (CPT) required for his internship placement this fall since the ban limits requests going through to the USCIS for Iranian people.</p>\n<p>“A lot of companies that I have job offers for right now are contacting me and asking if I know what my visa and resident situation is going to be,” he said. “Even if the companies are fine with me, they will be anxious about whether or not I can accept the job offer.”</p>\n<p>A Reddit user, posting as an Iranian-Canadian UCSB student on Saturday, said he or she was “sent back in Germany” while trying to reenter the U.S. after a trip to Tehran, Iran.</p>\n<p>The Nexus confirmed that Yousefian Jazi and Rasekh did not post on Reddit. The Nexus has sent the Reddit user a private message each day since Saturday, but the user has not yet replied.</p>\n<p>Kraig Rice, an immigration attorney with Juris Doctor California, said Iranian-Canadians would have been denied entry into the U.S on Friday and Saturday. The Trump administration announced Sunday that it would begin to allow entry to Canadian dual citizens.</p>\n<p>The order originally barred all permanent residents and all visas except foreign nationals traveling on diplomatic visas, North Atlantic Treaty Organization (NATO) visas, C-2 visas for travel to the United Nations and G-1, G-2, G-3 and G-4 visas.</p>\n<p>United States Citizenship and Immigration Services (USCIS) began allowing entry to green card holders on Sunday. Those with student visas, however, are still prohibited from entering the country, according to Abbe Kingston, an immigration attorney based in downtown Santa Barbara.</p>\n<p>“The craziness is there are already people who have been vetted, have already been interviewed, some on airplanes,” Kingston said. “That’s the hysteria it’s created. No one really thought this plan through.”</p>\n<p>In a press release Saturday, the UC Office of the President advised students from the seven countries listed in the executive order to not travel outside the United States. OISS recommends that all international students avoid travel outside the U.S.</p>\n<p><em>A version of this story appeared on p. 1 of the Thursday, February 2, 2017 print edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-75414\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-75414\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-02-02/travel-ban-bars-3-students-from-u-s-return/","id":2427,"author":{"id":30,"name":"Josh Ortiz"},"related":[2426,2425,2424],"comments":[],"followers":[]},"author":{"id":30,"name":"Josh Ortiz","biography":"Not available","articles":[2355,2371,2376,2377,2406,2411,2412,2418,2420,2422,2427,2435,2450,2451,2459,2498,2505,2509,2556,2577,2605,2624,2691,2696,2713,2716,2717,2742,2771,2848,2858,2874,2907,2941,2951,3440,3458,3600,3602,3629,3742,3743,3747,3864,3904,3953,3956,4139,4421,4428,4447,4459,4480,4484,4490,4500,4507,4508,4509,4575,4587,4589,4598,4603,4618,4621,4627,4628,4632,4641,4646,4648,4651,4653,4661,4663,4675,4705,4745,4765,4773,4778,4815],"portrait":"Not available"},"related":[{"title":"An Arm and a Leg for a Cap and a Gown","category":"News","subcategory":"Campus","publish_date":"2017-06-08T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/06/OSL-by-Christina-DeMarzo.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/06/OSL-by-Christina-DeMarzo.jpg?resize=980%2C647&ssl=1","description":"Along with the $79.99 purchase of commencement regalia from the UCen Bookstore, which includes the graduation stole, tassel, cap and gown, the increased demand for lodging inflates the prices of hotel...","content":"<div class=\"single-post-content\">\n            <p>Graduation commencement is just around the corner, and while graduating students are preparing to say goodbye to UC Santa Barbara, they have more than finals and graduation photos on their mind.</p>\n<p>The high cost of graduating is among the most concerning issues graduates face at the end of the year.</p>\n<p>“I avoided paying for my cap and gown by asking my friend to lend me hers since she is graduating the day after me,” said Tea Eristavi, a fourth-year communication major, in an email. “It angers a lot of us; it should be cheaper or even free.”</p>\n<p>Along with the $79.99 purchase of commencement regalia from the UCen Bookstore, which includes the graduation stole, tassel, cap and gown, the increased demand for lodging inflates the prices of hotels for families and friends.</p>\n<p>Frank Duffy, a manager at the Hampton Inn Santa Barbara/Goleta, said the hotel management increases room prices by about $100 per night for graduation weekend.</p>\n<p>A spokesperson from the Kimpton Goodland accounting department said when demand increases, prices also increase based off the hotel’s capacity.</p>\n<p>A manager at the Goleta Courtyard Marriott also said they take the market price of hotel rooms into consideration when they set their prices.</p>\n<p>This price increase, however, does not seem to affect local Airbnbs because of the consistent shifts in supply and lodging capacity.</p>\n<p>According to an Airbnb press release with data from Smith Travel Research, the average cost of an Airbnb room was $162 in 2016, while the average price of a hotel room was $367.</p>\n<p>This data includes hotels only from the city of Santa Barbara, not the county.</p>\n<p>“Our hosts typically do not raise their prices. If they do, it’s very, very slightly,” said Jasmine Mora, an Airbnb spokesperson. “As a consumer you’re just not going to book that listing.”</p>\n<p>The lower prices are also because more hosts are signing up for Airbnb to rent out their rooms.</p>\n<p>According to Airbnb, 9 percent of users rented out Airbnb rooms for the first time during graduation weekend. This increase in supply helps to accommodate the increase in demand without over-inflating prices.</p>\n<p>However, not all travel and lodging services are increasing prices in preparation for graduation weekend.</p>\n<p>Deanna Zachrisson, spokesperson for the Santa Barbara Airport, said she did not see a correlation between graduation weekend and increased flight prices.</p>\n<p>“There’s a whole number of factors that influence the prices of tickets,” she said. “It also can be the size of the aircraft … it’s really impossible to say that there’s a direct correlation between graduation traffic and cost.”</p>\n<p>Zachrisson also said college students make up a low percentage of the airport’s customers.</p>\n<p>Some graduation fees imposed by the university are charged only out of necessity, not to profit off of students.</p>\n<p>The Office of the Registrar charges an approximately $19 fee to every student graduating in order to process and send them their diplomas. The fee is an average rate to accommodate everyone, including those from smaller classes and international students that have more expensive shipping costs.</p>\n<p>She said diplomas for large graduating class sizes are cheaper than smaller class sizes because it is less expensive to buy in bulk.</p>\n<p>“It basically goes to cover the cost of the vendor for handling and mailing the diploma,” said the Uuniversity Registrar Leesa Beck. “You wouldn’t want someone to just drop your diploma in a manila envelope and drop it in a mailbox.”</p>\n<p>Beck said the diplomas are printed and sent by a third-party, out-of-state vendor.</p>\n<p>She also said it was “hard to say” if the total $19 goes directly to diplomas since the prices vary depending on graduating class and international shipping rates.</p>\n<p>Replacement diplomas are considerably more expensive at $50 domestically and $75 internationally, which Beck said was partly a “deterrent fee” meant to stop students from ordering multiple copies of their diploma, since they are only supposed to have one. She said this also works to prevent diploma fraud.</p>\n<p>Beck said if students can prove their diploma was lost or destroyed, the university frequently waives the fee.</p>\n<p>These costs only include the graduation essentials; however, an extra stole is sold at the Bookstore for $29.99 and a Classic Diploma Frame costs $150 and does not qualify for free shipping.</p>\n<p><em>A version of this story appeared on p.1 of the June 8, 2017, print issue of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"saboxplugin-wrap\" itemtype=\"http://schema.org/Person\" itemscope itemprop=\"author\"><div class=\"saboxplugin-gravatar\"><a href=\"https://dailynexus.com/author/tamari-dzotsenidze/\"><img src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2019/05/IMG_2029.jpg?w=888\" alt=\"\" itemprop=\"image\" data-recalc-dims=\"1\"></a></div><div class=\"saboxplugin-authorname\"><a href=\"https://dailynexus.com/author/tamari-dzotsenidze/\" class=\"vcard author\" rel=\"author\" itemprop=\"url\"><span class=\"fn\" itemprop=\"name\">Tamari Dzotsenidze</span></a></div><div class=\"saboxplugin-desc\"><div itemprop=\"description\"><p>Tamari Dzotsenidze, Managing Editor, first started at the Daily Nexus her first quarter freshman year as an assistant news editor. When not in the dungeon under Storke tower, she likes to make weird art and go to the beach with her dog Duke.</p>\n</div></div><div class=\"clearfix\"></div><div class=\"saboxplugin-socials \"><a target=\"_self\" href=\"mailto:TamariDzotsenidze@aol.com\" rel=\"nofollow\" class=\"saboxplugin-icon-grey\"><svg aria-hidden=\"true\" class=\"sab-user_email\" role=\"img\" xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 512 512\"><path fill=\"currentColor\" d=\"M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z\"></path></svg></a></div></div><div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-78397\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-06-08/an-arm-and-a-leg-for-a-cap-and-a-gown/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-78397\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-06-08/an-arm-and-a-leg-for-a-cap-and-a-gown/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-06-08/an-arm-and-a-leg-for-a-cap-and-a-gown/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-06-08/an-arm-and-a-leg-for-a-cap-and-a-gown/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-06-08/an-arm-and-a-leg-for-a-cap-and-a-gown/","id":2426,"author":{"id":27,"name":"Tamari Dzotsenidze"},"related":[2425,2424,2423],"comments":[],"followers":[]},{"title":"Embattled Student’s Suspension Lifted","category":"News","subcategory":"Campus","publish_date":"2017-04-06T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/09/campus.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/09/campus.jpg?resize=740%2C325&ssl=1","description":"A judge has ruled that a UC Santa Barbara freshman who sued the university may now return to school after over 200 days of indefinite suspension.","content":"<div class=\"single-post-content\">\n            <p>A judge has ruled that a UC Santa Barbara freshman who sued the university may now return to school after over 200 days of indefinite suspension.</p>\n<p>The student, listed in court documents as John Doe, was initially barred from attending school after UCSB opened a Title IX investigation against him.</p>\n<p>The university opened an investigation after it discovered a 19-second video in which Doe and his ex-girlfriend argued on camera before the screen went black.</p>\n<p>In the video, Doe told his then-girlfriend she “already busted [her] lip, I can bust it up even more,” according to a brief from the UC Regents to the appellate court during a previous part of the litigation process.</p>\n<p>University officials said this video is evidence that Doe hit his then-girlfriend, and they wrote in court documents that “the 19-second video depicting [Doe] threatening to assault a young woman amply justified the interim suspension while the University completes its investigation.”</p>\n<p>The investigation by UCSB, which has yet to place charges on the student, is ongoing without major developments, and key witnesses have not been interviewed.</p>\n<p>Judge Thomas P. Anderle, the judge who ruled that the student may return to school, said that the evidence in the case “suggests UCSB never made an effort to contact Jane Doe to corroborate the statements attributed to her.”</p>\n<p>John Doe’s suspension will remain lifted even if the university places charges against the freshman. The stay on the suspension will remain in effect “up to and including any final judgment in that case, after all appeals, if any,” according to Judge Anderle’s ruling.</p>\n<p>The court ruled that UCSB must also assist Doe by giving him full access to all programs and activities at UCSB with no restrictions, returning him to his assigned on-campus dorm room, allowing him to complete all classes, giving him priority enrollment and providing any assistance necessary from any of the university offices.</p>\n<p>Judge Anderle said in his decision that the university took too long to investigate, failing to fulfill both the 60-calendar-day deadline federally required for Title IX investigations and the 60-business-day deadline agreed upon by the university.</p>\n<p>“The Court of Appeal found that the University’s inaction over such a lengthy period of time, leaving Petitioner in limbo, appears unreasonable and arbitrary,” Judge Anderle said in the court ruling.</p>\n<p>Judge Anderle ruled that the university had caused “irreparable harm” to the student by failing to conduct the investigation in a timely manner, leaving him suspended indefinitely.</p>\n<p>“This Court concludes that the University is intentionally doing indirectly what it is unwilling to do directly. The University has made a decision to deny John Doe the opportunity to enroll in the any [sic] of the first three quarters of his freshman year,” Anderle said in the court ruling. “But instead of making that decision based upon the facts, the law, and in fairness, it has decided to do it their own way.”</p>\n<p>According to Doe’s lawyer, Robert Ottilie, Doe moved into his on-campus dorm during Spring Break and said the university has been very helpful with the process of assimilating Doe to life in college.</p>\n<p>“They could not have been more helpful. The school has been responsive to the ruling,” Ottilie said.<br>\nUCSB spokeswoman Andrea Estrada said the university “will make every effort to ensure the student’s success” while they complete the adjudication process.</p>\n<p>“We respect the court’s rulings and have complied with the court’s order,” she said in an email.<br>\nOttilie said Doe is very happy with the decision because it now allows him to start his life, beginning with attending his “dream school.”</p>\n<p>Ottilie said he was not surprised by the judge’s ruling to remove Doe’s suspension, as he felt the law was clearly on his side.</p>\n<p>“It really wasn’t very much of a surprise. The law is very clear,” he said.</p>\n<p>Despite the fact that Doe has won his ruling to return to school, he still faces an ongoing investigation against him on behalf of the university, a lawsuit against that claim in court and several hundreds of thousands of dollars in lawyers’ fees that he must pay.</p>\n<p>According to the ruling, Doe has incurred over $100,000 in attorney’s fees and costs just through his filing in December of 2016. The ruling said he has “undoubtedly incurred substantially more in fees and costs since that time.”</p>\n<p>Ottilie said Doe is unable to pay that amount of money and does not expect him to pay the expenses anytime soon. Ottilie himself has incurred $50,000 of out-of-pocket costs from representing Doe against the university.</p>\n<p>As for what Doe will decide to study now that he has started school this Spring Quarter, Ottilie said he does not know what particular major the first-year will choose while at UCSB. Ottilie said it would not surprise him if Doe went on to study law later on.</p>\n<p>Ottilie also said he will continue to investigate abuses of the particular code in the Regents’ laws that the university has used to keep Doe and students in similar situations from attending school.</p>\n<p>Ottilie said new information has come out that suggests the university withheld information during the judicial process, so he also plans to amend the lawsuit to include four UCSB staff members involved in Doe’s 200-day suspension.</p>\n<p>Included in the proposed amendment are Kristi Johnson, principal investigative analyst of the Title IX office; Margaret Klawunn, vice chancellor for student affairs; Sandra Vasquez, associate dean of judicial affairs; and Brian Quillen, also principal investigative analyst of the Title IX office.</p>\n<p>Estrada said the university has not yet seen any amended complaint.</p>\n<p><em>A version of this story appeared on p. 4 of the Thursday, April 6, 2017, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-76691\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-76691\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-06/embattled-students-suspension-lifted/","id":2424,"author":{"id":86,"name":"Jose Ochoa"},"related":[2423,2422,2421],"comments":[],"followers":[]},{"title":"Regents Address Tuition","category":"News","subcategory":"Campus","publish_date":"2017-01-26T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-18-at-2.27.21-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/11/Screen-Shot-2016-11-18-at-2.27.21-PM.png?resize=980%2C647&ssl=1","description":"The UC Board of Regents met in San Francisco Wednesday to discuss a proposal to raise tuition for the first time since 2011.","content":"<div class=\"single-post-content\">\n            <p>The UC Board of Regents met in San Francisco Wednesday to discuss a proposal to raise tuition for the first time since 2011.</p>\n<p>UC President Janet Napolitano presented in early January the proposal to raise tuition by 2.5 percent for the 2017-18 academic year. In-state tuition has remained at $11,220 since the 2011-12 academic year, and this proposed hike will increase tuition by $282.</p>\n<p>During the public forum, the Regents received several remarks on the tuition increase, which will be voted on during Thursday morning’s meeting. Commenters also critiqued some of the logistical problems with the UC’s intended expansion, as the UC intends to enroll an additional 10,000 students over the next three years.</p>\n<p>Susan Willats, an employee at UC Santa Cruz for 30 years, said the University’s increased student population has caused practical issues for the school, as the amount of students it admitted increased in the fall.</p>\n<p>“Because there was neither time nor funding to create a corresponding increase in infrastructure, we have far exceeded our resources,” she said.</p>\n<p>Several double rooms have been converted into triples, she said, and the residential lounges have been eliminated to provide more bed space, leaving students with not enough spaces to study.</p>\n<p>“This over-enrollment has not only added to the unsustainable workload of faculty and staff, but it has absolutely diminished the quality of the educational experience that the university provides,” Willats said.</p>\n<p>While concerns over growth were prevalent at the public forum, many also chose to focus on the upcoming vote on Thursday to increase tuition. President of the Council of UC Faculty Associations (CUCFA) and UCSF Professor Stanton Glantz was among several who spoke out against the decision.</p>\n<p>“I appreciate the fact that it costs money to run this place and the only real two places to get it is from the taxpayers or from the students and their families,” he said. “It’s very disappointing that you are going to be continuing Arnold Schwarzenegger’s failed policy of privatization which has generated over $12 billion in student debt since 2000.”</p>\n<p>Glantz also mentioned a report endorsed by faculty, students and staff organizations from all across UC, CSU and the community colleges that shows “the effect of the privatization and the fact that this could be fixed.” He held up the report at the public forum and encouraged that Regents use it to reform the current tuition system.</p>\n<p>Undergraduate students as well as faculty spoke at the forum. One UC Riverside undergraduate student criticized the tuition hike, saying the UC system takes pride in its “pillars of accessibility, affordability and quality” but is “sorely deficient” on all three. She said students’ wages could not be expected to cover rising costs.</p>\n<p>“If we place the burden of the cost of education on students who aren’t able to make above minimum wage on a part-time income to supplement the tuition costs that are already increasing, how do we reasonably expect any of them to be able to afford the increasing costs that you are trying to implement now?” she said.</p>\n<p>Alex Lee, the president of Associated Students of UC Davis (ASUCD), also asked the Regents to reject the proposed hike.</p>\n<p>“We as UC students are constantly the ones being harmed and taxed … I ask you, the Regents, to seek alternative sources of funding as well as maximize the money we currently have by cutting unnecessary expenses at the campus level and prioritize the educational experience,” Lee said. “On behalf of UC Davis and UC students, I ask you not to raise tuition.”</p>\n<p>In reference to tomorrow’s tuition vote, Monica Lozano, the chair of the board, said she looks forward to tomorrow’s discussion in action.</p>\n<p>The Regents plan to vote on the contentious issue of tuition hikes on Thursday morning after another session of public comment.</p>\n<p><em>A version of this story appeared on p. 1 of the Thursday, Jan. 26, 2017 edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-75244\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-75244\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-01-26/regents-address-tuition/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-01-26/regents-address-tuition/","id":2425,"author":{"id":86,"name":"Jose Ochoa"},"related":[2424,2423,2422],"comments":[],"followers":[]}]},"__N_SSG":true}