{"pageProps":{"article":{"title":"Finance Committee Drops S.C.O.R.E Funding Freeze","category":"News","subcategory":"Campus","publish_date":"2014-11-06T08:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"Last night, the Associated Students Senate met in the UCen’s Flying A room to discuss a variety of issues and receive input from several community members.","content":"<div class=\"single-post-content\">\n            <p> </p>\n<div id=\"attachment_58000\" style=\"width: 510px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-58000\" data-attachment-id=\"58000\" data-permalink=\"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/as-senate-subject-is-alex-santos-by-kenneth-song_for-11-05-2014-5887/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?fit=1200%2C714&amp;ssl=1\" data-orig-size=\"1200,714\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.2\",\"credit\":\"\",\"camera\":\"NIKON D3\",\"caption\":\"\",\"created_timestamp\":\"1415227044\",\"copyright\":\"\",\"focal_length\":\"135\",\"iso\":\"2000\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"AS Senate (subject is Alex Santos-) by Kenneth Song_for 11.05.2014-5887\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?fit=250%2C149&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?fit=888%2C528&amp;ssl=1\" class=\"wp-image-58000\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?resize=500%2C298\" alt=\"Senators discussed the issue of ratifying the Finance Board’s request to freeze S.C.O.R.E.’s funds. If approved,  all student delegates selected for the Student of Color Conference this weekend will not be allowed to attend. Kenneth Song/Daily Nexus\" width=\"500\" height=\"298\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?resize=250%2C149&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2014/11/AS-Senate-subject-is-Alex-Santos-by-Kenneth-Song_for-11.05.2014-5887.jpg?resize=1024%2C609&amp;ssl=1 1024w\" sizes=\"(max-width: 500px) 100vw, 500px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-58000\" class=\"wp-caption-text\">Senators discussed the issue of ratifying the Finance and Business Committee request to freeze S.C.O.R.E.’s funds. If approved, all student delegates selected for the Student of Color Conference this weekend will not be allowed to attend. <em>Kenneth Song/Daily Nexus</em></p></div>\n<p>Last night, the Associated Students Senate met in the UCen’s Flying A room to discuss a variety of issues and receive input from several community members.</p>\n<p>The primary focus of this week’s meeting was the potential freezing of the Student Commission on Racial Equality’s (S.C.O.R.E.) funds. The A.S. Finance and Business Committee has recommended that the Senate freeze S.C.O.R.E.’s assets “based on allegations that SCORE violated student government bylaws through their Student of Color Conference (SOCC) delegate selection process,” according to a statement released on S.C.O.R.E.’s Facebook page yesterday.</p>\n<p>No members of S.C.O.R.E. were present at last night’s meeting.</p>\n<p>During public forum, Senator Nikka Kurland spoke for A.S. President Ali Guthy saying the president opposed the freeze. Chief Financial Officer of the A.S. Finance and Business Committee Andre Theus requested the Senate not ratify the freeze approved by the committee on Monday.</p>\n<p>“I am recommending that you not ratify the freeze,” Theus said. “Just to explain why I thought the freeze should happen is just that there was a lot of discrepancies happening … I think that’s the best resolution to this issue.”</p>\n<p>Senator Nikka Kurland proposed a resolution to increase “financial transparency” in response to Senate confusion about S.C.O.R.E.’s funding process.</p>\n<p>“They seemed very confused on how their funding works,” Kurland said. “So all this resolution does is it stipulates that S.C.O.R.E. must present all of their financial actions to the finance and business committee and to be approved directly by the finance and business committee just for the remainder of the quarter.”</p>\n<p>A.S. Controller Amir Khazaieli spoke in favor of freezing S.C.O.R.E.’s funding based on the organization’s lack of disclosure about Student of Color Conference (SOCC) funding, a UC Student Association gathering to take place this weekend at UC Merced.</p>\n<p>“According to policies and procedures, everything that [Finance and Business Committee] funds has to be open to all students in some way, shape or form. Nothing is, as of now, transparent in regards to this issue,” Khazaieli said. “Students have no say in who’s running [S.C.O.R.E.], how much money is spent on SOCC, what the sources of funding are for SOCC and how members of the SOCC delegation are chosen.”</p>\n<p>As A.S. Controller, it is Khazaieli’s job to make sure student fees are being allocated properly and in accordance with A.S. bylaws. Khazaieli said S.C.O.R.E.’s leaders are currently spending student money improperly.</p>\n<p>“I have an inconclusive set of data at my disposal to figure out whether or not student fees are being spent properly,” Khazaieli said. “I have to deem [the data] an inconsistent use of student fees.”</p>\n<p>In its press release, S.C.O.R.E. maintains that its current process for selecting students to SOCC is fair and compliant with A.S. regulations.</p>\n<p>“SCORE stands by its selection processes and deeply condemns [Finance and Business Committee] for attempting to freeze all of SCORE’s funding, which is used to support organizations and events that promote issues of diversity and inclusion of students of color at UC Santa Barbara,” the press release stated.</p>\n<p>Senator and A.S. Finance and Business Committee member Jimmy Villarreal spoke to the Senate to summarize the committee’s thought process behind the freeze recommendation.</p>\n<p>“When we asked the representatives from S.C.O.R.E. questions they weren’t always 100 percent able to answer them. I want you to know I do not think they misused funds on purpose at all,” Villarreal said. “Because the [Finance and Business Committee] wasn’t really able to decide one way or the other [whether or not funds were being misused], we recommended a freeze. There is an issue of communication between S.C.O.R.E. and the rest of the Association.”</p>\n<p>Senator Nadia Blant said the proposal was pointless to approve, and would only waste time.</p>\n<p>“I want to table it indefinitely because this whole thing is really tedious and unnecessary and it could stop a lot of things in the process that are unnecessary,” Blant said. “We shouldn’t be deciding anything right now, if anything we should be talking about it later but deciding something and sticking it on at the end of this bill that really doesn’t make any sense if you think about it, would be a waste of our time.”</p>\n<p style=\"line-height: 15.75pt; background: white; vertical-align: baseline; margin: 0in 0in 11.25pt 0in;\"><span style=\"font-size: 10.5pt; font-family: 'Georgia',serif; color: black;\">The Senate decided to table the motion indefinitely and to take no further action.</span></p>\n<p>College of Letters &amp; Science Senator Zach Goulhiane initially proposed a resolution to extend the special elections deadline because midterm elections and midterm exams occurred during the same week.</p>\n<p>“There’s no point in us pretty much cancelling this out. We’re pretty much silencing people’s voices,” Goulhiane said. “Giving them this extra time just until Sunday allows them to actually be able to voice their opinions.”</p>\n<p>Goulhiane said that according to the A.S. Legal Code, a certain number of votes must be met during the elections and so far there has been a low voter turnout.</p>\n<p>“We had three percent on Tuesday, based off of what I just heard today,” Goulhiane said. “After a day we reached five percent.”</p>\n<p>According to Goulhiane, in order to pass the A.S. Legal Resource Center fee increase on the ballot at least 15 percent of the total students’ voter population have to vote yes on the referendum.</p>\n<p>In addition to the needed 15 percent of votes, the fee increase will only become valid with a “20 percent overall turnout,” according to A.S. Executive Director Marisela Marquez.</p>\n<p>Off-Campus Senator Erika Martinez said the A.S. Legal Resource Center has been campaigning for votes through outlets like University Announcements, Facebook and the <em>Daily Nexus</em>. According to Martinez, the Resource Center should not have been campaigning for votes since they did not submit a campaign bond, which would have ensured that a fee would be charged if they were to break campaigning rules.</p>\n<p>Martinez said the Senate is also to blame for the contradiction between the elections committee’s decision and the Senate’s decision regarding putting the bill on the ballot.</p>\n<p>“They as a committee voted not to have this put on to the ballot and then we, as Senate said ‘Yes, we should put this on the ballot,’” Martinez said. “So technically, this shouldn’t even be on the ballot, because this campaign bond was never submitted and we were all aware of it.”</p>\n<p>Off-Campus Senator Kevin Koo said Senators have a responsibility to ensure a fair and easy voting process.</p>\n<p>“As Senators, we’re also representing our student community,” Koo said. “People not having the opportunity to read the language in the ballot is, in my opinion, very wrong and unfair towards both the LRC and the candidates who are running.”</p>\n<p>The Senate discussed other options in reaching the required percentage of students needed to vote, but ultimately decided against the resolution to extend the special elections deadline.</p>\n<p>The Senate also approved a bill that outlines guidelines for publicizing conferences and retreats as well as clarified consequences for not attending these events.</p>\n<p><strong>[Correction:</strong> A previous version of this article and the headline incorrectly referred to A.S. Finance and Business Committee by its former name, the A.S. Finance Board. That is incorrect, the body’s actual name is the A.S. Finance and Business Committee. The headline also read: “Finance Board Seeks to Freeze S.C.O.R.E. Funding”. This article and headline has been updated accordingly<strong>.]</strong></p>\n<p><strong>[Update:</strong> This article was updated with more recent information as of Nov. 6, 2014 11:50 a.m.<strong>]</strong></p>\n<p>A version of this story appeared on page 3 of Thursday, November 6,2014’s print edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-57999\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-57999\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2014-11-06/finance-board-seeks-to-freeze-s-c-o-r-e-s-fund/","id":2461,"author":{"id":147,"name":"Noah Brennan-Greenbaum"},"related":[2460,2459,2458],"comments":[],"followers":[]},"author":{"id":147,"name":"Noah Brennan-Greenbaum","biography":"Not available","articles":[2461,2527,2644,2727,2746,2781,2800,2805,2828,2829,2839,2847,2851,2857,2864,2910,2924,2949,2966,2972,2995,4569,4574,4674,4676,4677,4701,4719,4723,4740,4750,4763,4771,4776,4780,4788,4793,4798,4800,4809],"portrait":"Not available"},"related":[{"title":"U-Mail Phishing Scams Resurface","category":"News","subcategory":"Campus","publish_date":"2016-10-13T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=980%2C647&ssl=1","description":"Students have reported another round of phishing emails circulating through UCSB’s U-Mail system attempting to gather student info.","content":"<div class=\"single-post-content\">\n            <p>Just after the system-wide start of National Cyber Security Awareness Month (NCSAM), UC Santa Barbara students received an email notification Oct. 6 about an increase in email phishing on University accounts.</p>\n<div id=\"attachment_73125\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-73125\" data-attachment-id=\"73125\" data-permalink=\"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/umail-phishing/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?fit=3075%2C2000&amp;ssl=1\" data-orig-size=\"3075,2000\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Umail Phishing\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?fit=250%2C163&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?fit=888%2C578&amp;ssl=1\" class=\"size-large wp-image-73125\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1-1024x666.jpg?resize=888%2C578\" alt=\"Chief Information Security Officer Sam Horowitz advises students to look out for suspicious emails being received by their U-Mail accounts, especially those that look like they come from other UCSB accounts. He says that students are more likely to trust emails from these “legitimate” accounts. Stephen manga / Daily Nexus\" width=\"888\" height=\"578\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=1024%2C666&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=250%2C163&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=768%2C500&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?resize=355%2C230&amp;ssl=1 355w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?w=1776 1776w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Umail-Phishing-by-Stephen-Manga-1.jpg?w=2664 2664w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-73125\" class=\"wp-caption-text\">Chief Information Security Officer Sam Horowitz advises students to look out for suspicious emails being received by their U-Mail accounts, especially those that look like they come from other UCSB accounts. He says that students are more likely to trust emails from these “legitimate” accounts. <em>Stephen Manga / Daily Nexus</em></p></div>\n<p>The email, sent by Sam Horowitz, the chief information security officer at UCSB, gave tips for keeping student information secure, such as how to spot phishing attempts, suspicious URLs and Trojan horse attachments.</p>\n<p>Horowitz said this latest phishing campaign was made possible by “a few relatively narrow campaigns targeted at staff” in the summer. The attack originated when a compromised U-Mail account sought to collect additional usernames and passwords in the last week of September.</p>\n<p>According to Horowitz, users are more likely to trust the compromised account when it is a real UCSB email account. The result is “a continuous loop:” one account gets phished and that account is used to phish others.</p>\n<p>As a result, it becomes difficult to track or prevent phishing attacks when they are actually sourced from legitimate accounts.</p>\n<p>At that point, students would have to call or visit the Collaborate Student Support Center to have a necessary password reset on their account. According to Horowitz, there’s no way to tell how many people responded to the attacks, but he can confirm that it was “more than a rare occurrence.”</p>\n<p>Unfortunately, the message came too late for Ashley de Leon, a first-year film and media studies major, whose account was locked when it became a victim to phishing.</p>\n<p>De Leon explains that she received a high number of illicit emails informing her that her inbox was too full and that she needed to sign in to upgrade her storage. At first, she responded by clearing out her inbox, but after repeated pestering, she finally submitted her information.</p>\n<p>“I first noticed something was wrong when the window disappeared after I put in my information,” she said. “Then things started getting really wrong about a day later when I was receiving emails from Microsoft saying that my emails weren’t sending. I hadn’t sent any emails, and it was like 50 of these coming in.”</p>\n<p>The U-Mail system was blocking a large number of the outgoing emails that the phishers were using her account to send, but it’s still unknown how many were actually successfully sent.</p>\n<p>“First I changed my password … and it worked, but then the next day I got entirely locked out of the whole system,” de Leon said.</p>\n<p>After receiving help from the I.T. department, de Leon was finally able to recover her account, and it is no longer being used for phishing attacks.</p>\n<p>NCSAM “emphasizes proper cyber security practices through webinars, posters, YouTube videos, social media outreach and on-campus presentations,” Matt Hall, the chief information officer at UCSB, said. Fittingly, the first two weeks of NCSAM focus directly on topics of phishing — email and otherwise.</p>\n<p><em>A version of this story appeared on p. 3 of the Thursday, Oct. 13, edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-73142\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-73142\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-10-13/u-mail-phishing-scams-resurface/","id":2458,"author":{"id":106,"name":"Josh Bevan"},"related":[2457,2456,2455],"comments":[],"followers":[]},{"title":"UCSB To Begin Using Students’ Preferred Names","category":"News","subcategory":"Campus","publish_date":"2016-05-26T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?resize=940%2C388&ssl=1","description":"UC Santa Barbara will begin using preferred names in all campus services on June 16, affecting access cards, class rosters and faculty interactions with students.","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_71466\" style=\"width: 950px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-71466\" data-attachment-id=\"71466\" data-permalink=\"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/sgd_home_top/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?fit=940%2C388&amp;ssl=1\" data-orig-size=\"940,388\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"sgd_home_top\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?fit=250%2C103&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?fit=888%2C367&amp;ssl=1\" class=\"wp-image-71466 size-full\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?resize=888%2C367\" alt=\"sgd_home_top\" width=\"888\" height=\"367\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?w=940&amp;ssl=1 940w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?resize=250%2C103&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/05/sgd_home_top.jpg?resize=768%2C317&amp;ssl=1 768w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-71466\" class=\"wp-caption-text\"><em>Photo courtesy of Resource Center for Sexual and Gender Diversity</em></p></div>\n<p>UC Santa Barbara will begin using preferred names in all campus services on June 16, affecting access cards, class rosters and faculty interactions with students.</p>\n<p>Celestino Jones, a second-year music composition major, came out as transgender during the beginning of his second year at UCSB. “I’ve been stopped at the dining commons before because I don’t look like a ‘Celeste,’” Jones said, after undergoing hormone therapy that changed his appearance.</p>\n<p>He now has the opportunity to purchase a new access card with his preferred name without having to legally change his documentation.</p>\n<p>“It grew out of the desire to support transgender students specifically, because there are many transgender students whose legal name is not consistent with their identity,” Leesa Beck, the university registrar, said. She also hopes the efforts will improve academic experiences for international students who may use alternate names.</p>\n<p>Students are currently able to change their name through Identity Services or by submitting a petition to the registrar. Certain programs, such as G.O.L.D., source data directly from the registrar’s office, but many organizations such as GauchoSpace interact with numerous other databases like Identity Services.</p>\n<p>Beginning in the summer, the registrar’s office hopes to streamline all name change requests by communicating their information to as many “data feeds” as possible.</p>\n<blockquote><p>“Identities are static, sometimes someone goes by one name for a part of their life and they have a shift.” — Dave Whitman</p></blockquote>\n<p>“We think we have caught most of the major ones, but there are literally hundreds around the campus, so we may continue to find ones that we have missed, and have to make updates after we go live,” Beck said.</p>\n<p>Departments that require legal verification, such as the financial aid office, Student Health and Counseling &amp; Psychological Services, are the only groups that will receive both the legal name and the preferred name for each student. Staff members at these locations will be directed to use preferred names when addressing students and legal names when submitting and verifying claims, Beck said.</p>\n<p>The new system will only allow students to change first names, requiring legal documentation to change last names. Although this leaves room for falsification, Beck said she has spoken with schools who use preferred names and found that students “almost never abuse the system.”</p>\n<p>“It would be like putting a weird fake name on LinkedIn or something. No one wants that to be the name their professors are calling them by,” she said. “So for now there will be no “policing” of the names entered. If it becomes a problem down the line, we will reassess.”</p>\n<p>The registrar’s office will be working with the Resource Center for Sexual and Gender Diversity (RCSGD) to publicize and implement the changes after Spring Quarter grades are finalized.</p>\n<p>Dave Whitman, the director of the RCSGD, said “a lot of people take names and pronouns for granted” because they never feel misrepresented by their legal name.</p>\n<p>“Identities are static, sometimes someone goes by one name for a part of their life and they have a shift,” he said. “We just want students to feel like there are services in place that validate the experiences that they are having.”</p>\n<blockquote><p>“It’s a very rough patch of time telling everyone what your new name and pronouns are and why they’re that way.” — Celestino Jones</p></blockquote>\n<p>When beginning previous quarters at UCSB, Jones said he would sometimes find himself staying quiet during roll call, waiting until the end of class to correct his teachers about his name. He is “grateful” that professors and teaching assistants will only have access to his preferred name next year, and said several other students will benefit as well.</p>\n<p>“It’s a very rough patch of time telling everyone what your new name and pronouns are and why they’re that way,” he said. “It can alleviate a lot of stress, I suppose, if the name that you prefer is the name that everyone calls you by.”</p>\n<p>Although the new system will be implemented throughout UCSB in the fall, Jones, who is a chair for the RCGSD transgender taskforce, said it will not be a “fix-all” for transgender inclusivity. He explained that faculty members can learn about gender identity and make students feel safe by asking them about their preferred pronouns.</p>\n<p>“I know that even though I told people my preferred name, there were still some folks who made the mistakes of using the wrong pronouns,” Jones said. “It’s all about being educated!”</p>\n<p> </p>\n<p>A version of this story appeared on p. 1 of the Thursday, May 26, 2016, edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-71452\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-71452\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-05-26/ucsb-to-begin-using-students-preferred-names/","id":2460,"author":{"id":91,"name":"Supriya Yelimeli"},"related":[2459,2458,2457],"comments":[],"followers":[]},{"title":"Tossed Tortillas Land in Campus Compost Bin","category":"News","subcategory":"Campus","publish_date":"2016-10-20T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Screen-Shot-2016-10-21-at-4.13.10-PM.png?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/10/Screen-Shot-2016-10-21-at-4.13.10-PM.png?resize=914%2C422&ssl=1","description":"It is UC Santa Barbara tradition for students to fling tortillas onto the field after a goal during home soccer games, a custom that will undoubtedly continue into Saturday’s match against rival Cal...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_73389\" style=\"width: 4042px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg\" data-slb-active=\"1\" data-slb-asset=\"609055369\" data-slb-internal=\"0\" data-slb-group=\"73348\"><img aria-describedby=\"caption-attachment-73389\" data-attachment-id=\"73389\" data-permalink=\"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/img_0558/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?fit=4032%2C3024&amp;ssl=1\" data-orig-size=\"4032,3024\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"img_0558\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?fit=250%2C188&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?fit=888%2C666&amp;ssl=1\" class=\"wp-image-73389 size-full\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?resize=888%2C666\" alt=\"img_0558\" width=\"888\" height=\"666\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?w=4032&amp;ssl=1 4032w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?resize=250%2C188&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?resize=768%2C576&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?resize=1024%2C768&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?w=1776 1776w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/10/IMG_0558.jpg?w=2664 2664w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-73389\" class=\"wp-caption-text\"><em>Josh Ortiz / Daily Nexus</em></p></div>\n<p>It is UC Santa Barbara tradition for students to fling tortillas onto the field after a goal during home soccer games, a custom that will undoubtedly continue into Saturday’s match against rival Cal Poly.</p>\n<p>In the immediate aftermath of Saturday’s game, though, students might also expect to see a UCSB library employee on the field collecting the tortillas as she has done at every home game for almost a decade.</p>\n<p>Margaret Rankin describes herself as someone who has been reducing, reusing and recycling “before those words were ever known.” She recalls going to a soccer game at Harder Stadium about seven years ago and seeing the field laden with several hundred pounds of tortillas.</p>\n<p>She naturally began to question their fate and soon learned that field staff disposed of them in the landfill dumpster.</p>\n<p>“It was such a waste; to just send them to the landfill is just appalling,” she said. “I thought, ‘If they’re going to continue this, then let’s do something about it that’s actually helpful.’”</p>\n<p>The librarian first asked UCSB Athletics if she might take the tortillas to add to her own backyard compost operation. She later decided to collect the tortillas for on-campus composting.</p>\n<p>Associated Students Recycling (ASR) partnered with her shortly after and supplied designated tortilla bins for her to wheel over to their on-campus composting facility just a couple hundred feet from the stadium.</p>\n<p>According to Sarah Siedschlag, the A.S. environmental programs advisor and former ASR program coordinator, the A.S. Department of Public Worms, formerly a part of ASR, had been composting the tortillas in their worm bins when she came in as coordinator in fall 2012.</p>\n<p>The mass of tortillas proved “too much for the worms,” she said, and so the program opted to have the tortillas industrially composted off-campus in fall 2013.</p>\n<p>Tortilla-flinging began in 1995 during an ESPN-televised basketball game against DePaul University when the student section threw tortillas on the court after the first basket. The tradition was adopted for soccer matches about a decade later.</p>\n<p>The flying tortillas were especially problematic during basketball games; officials whistle any object thrown onto the court as an automatic technical foul for the home team, giving a free throw to the opposing team. Known as the “tortilla technical” in the 1990s, the tradition once cost UCSB three technical fouls in a close game against Pacific University in 1997, prompting former head coach Jerry Pimm to take a microphone and plead that audience members act more like adults.</p>\n<p>To avoid such outcomes, UCSB Athletics does not allow tortilla-throwing at basketball games or soccer games.</p>\n<p>Nonetheless, UCSB Athletics currently has a “quick response plan” in place whereby field staff retrieve the tortillas almost as soon as they land on the field. The staff then bag the tortillas and leave them on the sidelines for Rankin to collect later.</p>\n<p>Rankin is not allowed on the field during the game, she said, but the exclusive pass granted to her by UCSB Athletics allows her to gather the tortillas in the moments following the game’s conclusion. She said her pass reads that she is the “Director of Phylum Annelida” (Annelida is the phylum to categorize segmented worms, which are used for composting).</p>\n<p>Rankin said she has found students to be quite “inventive” as to how far across the field they can fling tortillas. Frozen tortillas typically go further because of their rigidness, she said, as do thick tortillas and baked tortillas.</p>\n<p>Tortilla-throwing is “a good release” for students, Rankin said, but she doesn’t want to encourage it.</p>\n<p>“I just try to get a better solution to what could have been wasted,” Rankin said.</p>\n<p>In her years collecting tortillas, Rankin said she has hardly received thanks for what she does. This is fine, she said, because her work is completely voluntary, and she aims to keep a low profile.</p>\n<p>“At least I make millions happy, which just so happen to be worms,” she said.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-73348\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-73348\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-10-20/tossed-tortillas-land-in-campus-compost-bin/","id":2459,"author":{"id":30,"name":"Josh Ortiz"},"related":[2458,2457,2456],"comments":[],"followers":[]}]},"__N_SSG":true}