{"pageProps":{"article":{"title":"“Second Class Feminists” Event Fosters Discussion on Feminism and Religion","category":"News","subcategory":"Campus","publish_date":"2016-02-10T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?resize=980%2C647&ssl=1","description":"The College of Letters and Science and Department of Religious Studies co-hosted an event Tuesday evening titled “Second Class Feminists?: The Changing Role of Women in Faith Communities” for pane...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68034\" style=\"width: 810px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68034\" data-attachment-id=\"68034\" data-permalink=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/feminist-lecture_by-jenny-luo-1/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Feminist Lecture\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-68034\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1-1024x682.jpg?resize=800%2C533\" alt=\"Jenny Luo / Daily Nexus\" width=\"800\" height=\"533\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-1.jpg?w=1776 1776w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68034\" class=\"wp-caption-text\"><em>Jenny Luo / Daily Nexus</em></p></div>\n<p>The College of Letters and Science and Department of Religious Studies co-hosted an event Tuesday evening titled “Second Class Feminists?: The Changing Role of Women in Faith Communities” for panelists and audience members to discuss the intersections of religion and feminism and the role of feminists in religions with patriarchal interpretations.</p>\n<p>The event, which took place at the MultiCultural Center Theater, featured a panel of three feminist scholars of the Catholic, Muslim and Jewish faiths. Panelists included Gina Messina-Dysert, Dean of the School of Graduate and Professional Studies at Ursuline College, Nia Malika Dixon, author, filmmaker and founder of Audaz Entertainment and Rabbi Tamara Cohen, Director of Innovation at Moving Traditions. All three panelists are contributors to <em>Faithfully Feminist</em>, a collection of 45 essays on feminism in religion, for which they held a signing after the event.</p>\n<p>Kathleen Moore, religious studies professor and department chair at UCSB, said although religion and feminism are not inherently opposed, there is conflict generated by people’s expectations that an opposition exists.</p>\n<p>“They are not an either-or dichotomy, although the conflict between religion and feminism is real,” Moore said.</p>\n<p>Messina-Dysert said it is harmful for nonreligious feminists to discount the work of religious feminists, because the success of feminism depends on working together and mutual support between the two.</p>\n<p>“Individuals who identify as religious and feminists receive a lot of judgment, if you will, from both their religious communities and from feminists,” Messina-Dysert said. “I personally find both damaging, but I find judgment from feminists more damaging.”</p>\n<p>Messina-Dysert offered her definition of feminism, which she said is inspired by those of Bell Hooks and Rosemary Radford Ruether.</p>\n<p>“I like to talk about feminism as being a movement that is focused on eradicating sexism, yes, but all oppression, because you cannot uproot one without uprooting all,” she said.</p>\n<p>Religion needs feminism, according to Messina-Dysert, as it is still inundated with patriarchal interpretations that lead to oppression.</p>\n<p>“Certainly it is necessary for feminism to be a critical part of religious practice,” Messina-Dysert said. “We need to continue to acknowledge the great oppressions that still exist within religious traditions and find the ways that we can create healing.”</p>\n<p>Messina-Dysert spoke specifically about Catholicism to exemplify oppressive religious traditions such as the Vatican’s resistance to reproductive rights and women’s ordination. She said women are a “blind spot” of Pope Francis, who upholds the “theology of complementarity,” which declares a woman’s purpose and value come from her role as a wife and mother.</p>\n<p>Such traditions are not inherently part of religion and should be resisted, according to Messina-Dysert.</p>\n<p>“Certainly, the foundations of religion are not sexist — it’s the interpretations that are,” she said. “Feminism allows us to work toward disrupting those problematic interpretations.”</p>\n<p>Malika Dixon said she believes God gives her the right to stand up for both feminism and religion even though many interpretations hold them in contention.</p>\n<p>“Asking a Muslim ‘why are you feminist?’ to me seems kind of misinformed, because to me, as a Muslim, I believe we are automatically feminist,” Malika Dixon said. “The patriarchy that pervades our religious beliefs is not a part of our beliefs, it’s an interpretation.”</p>\n<div id=\"attachment_68035\" style=\"width: 810px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68035\" data-attachment-id=\"68035\" data-permalink=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/feminist-lecture_by-jenny-luo-2/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Feminist Lecture\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-68035\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2-1024x682.jpg?resize=800%2C533\" alt=\"Jenny Luo / Daily Nexus\" width=\"800\" height=\"533\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Feminist-Lecture_by-Jenny-Luo-2.jpg?w=1776 1776w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68035\" class=\"wp-caption-text\">Jenny Luo / Daily Nexus</p></div>\n<p>Cohen said Jewish feminists have worked to reverse sexist interpretations, especially in life-cycle traditions such as the unequal status of bat mitzvahs and bar mitzvahs, which she experienced in her conservative synagogue and orthodox school while growing up.</p>\n<p>“Girls could have a bat mitzvah, but not equal to a bar mitzvah,” Cohen said. “We could read from the Torah only on Friday night, which doesn’t really count, and not on Saturday morning.”</p>\n<p>Cohen said her family chose to have a bar mitzvah for her despite the orthodoxy of her synagogue and school, empowering her to fight for feminist reforms to Jewish tradition.</p>\n<p>“I had this sense with the way we did it that if something wasn’t fair out there we could change it,” Cohen said. “It wasn’t many years later that a lot of places began to say, yes, you can do it on Saturday morning, and that change happened because women demanded it and feminists demanded it.”</p>\n<p>Cohen said she had a crisis of faith after coming out as a lesbian in college, because conservative Judaism did not allow for ordination of LGBT Rabbis, which lead her to a new understanding of feminism.</p>\n<p>“It really shook me to my core and made me think about ‘what is feminism all about?’ and ‘who is it for?’ and ‘what are the limits of a certain feminism and how do we have to push it forward?’” Cohen said.</p>\n<p>She said she has struggled to assert both her feminist and her Jewish identity due to the popular notion that they are at odds.</p>\n<p>“I wanted to be accepted as what a certain image of what a feminist was and in some sense a certain aesthetic of what a cool dyke was in that moment of the early 90s,” Cohen said. “In some sense I wanted to go underground as a religious person because I couldn’t feel the two together.”</p>\n<p>Cohen said she uses “feminine God-language” in order to unravel the core of many patriarchal religious interpretations.</p>\n<p>“If our images in terms of the ultimate power of the universe and the language we use is only male … it becomes enshrined,” she said.</p>\n<p>Third-year sociology major Evelyn Cabral said she strongly agreed with everything the panel members said during the event.</p>\n<p>“Everything to do with feminism and religion is a choice, and the intersectionality between the two of them and the parallels between the two to them,” Cabral said.</p>\n<p>Cabral said she chose to attend the event because it brought together “two good parts” of her life, referring to religion and feminism.</p>\n<p>“Usually it is hard to find events that bring these two parts of your life together. It’s usually either religion or feminism. It’s never both of them together, so that’s why I wanted to come to this event,” Cabral said.</p>\n<p>Mariam Tariq, second-year global studies and political science double major, said as a Muslim feminist she related to many of the experiences the panel discussed.</p>\n<p>“I’ve been feeling a lot of conflict about what is a woman’s role within religion,” Tariq said. “This event seemed like a good way to listen to scholars and hear what they have to say, and I thought it was really enlightening and it was a reaffirmation of everything that I believe and it’s amazing to see other women of different faiths also struggling with the same issues.”</p>\n<p>Tariq said she would like to see more events that combine feminism and faith, which are usually kept in different spheres on campus.</p>\n<p>“I think religion on campus is sort of a touchy subject. Not many people bring it up and there’s very limited spaces where you can bring it up,” Tariq said. “I don’t see this much on campus where you get to see women fighting as feminists and for their religions.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68050\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68050\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-10/second-class-feminists-event-fosters-discussion-on-feminism-and-religion/","id":2548,"author":{"id":130,"name":"Beth Lebens"},"related":[2547,2546,2545],"comments":[],"followers":[]},"author":{"id":130,"name":"Beth Lebens","biography":"Not available","articles":[2548,2678,2698,2739,2747,2752,2759,2783,2814,2818,2875,2876,2877,2888,2903,2932,3442,4662,4698,4703,4726,4754,4755,4764,4779,4805],"portrait":"Not available"},"related":[{"title":"South African Students To Host Talk on Apartheid","category":"News","subcategory":"Campus","publish_date":"2016-02-08T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid-1.jpg?resize=980%2C647&ssl=1","description":"Black South African students Jamie Mithi and Khanyisa Pinini will host “Let’s Talk about Apartheid” at Isla Vista Theater on Tuesday, Feb. 9, where they will share their experiences with aparthe...","content":"<div class=\"single-post-content\">\n            <p>Black South African students Jamie Mithi and Khanyisa Pinini will host “Let’s Talk about Apartheid” at Isla Vista Theater on Tuesday, Feb. 9, where they will share their experiences with apartheid and discuss the misconception in labeling Israel as an apartheid state.</p>\n<p>Mithi was ranked first in Africa and fourth globally for his talents in debate, and Pinini is active in journalism, student government and is a member of the United Nations Association of South Africa. During the event, Mithi and Pinini will discuss their experiences living through the South African apartheid and how the meaning of the word apartheid is changing.</p>\n<p>Kayla Shenassa, second-year classics major and host of the event, said she wants to encourage people to think critically before reaching conclusions about apartheid and learn about the importance and relevance of the issue.</p>\n<p>“It’s giving me opportunity to help teach and educate my peers about an issue that is really important and crucial to world history, not just South Africa or the Middle East,” Shenassa said. “It’s something that can apply even here in the U.S. where we’ve had to deal with serious race issues, even in this day and age.”</p>\n<p>Bridget Haus, third-year statistics major, said she studied abroad in South Africa last quarter and witnessed how apartheid still affects the community.</p>\n<p>“There were many protests, riots and shut down of university due to lack of progress for the black race post apartheid,” Haus said in an email.</p>\n<p>Andrea Keys, fourth-year linguistics major, said she appreciates the opportunity to learn from people who experienced apartheid first hand.</p>\n<p>“I have only been able to learn about apartheid via the Internet and from YouTube and movies, so it will be an amazing experience to learn about it from people who actually lived through it,” Keys said in an email.</p>\n<p>Emily Wettleson, fourth-year communication and classics major, said silence never brings any change and she appreciates that this event discusses a topic usually left unaddressed.</p>\n<p>“I’ve always felt that quote-unquote ‘uncomfortable’ issues like apartheid are not discussed enough because of the sheer heinous nature of what happened,” Wettleson said in an email.</p>\n<p>Tyler Koontz, fourth-year theater and dance major in the Bachelor of Fine Arts acting program, said issues like apartheid should be discussed to learn from social injustices of the past.</p>\n<p>“The subjects and histories of such injustice should be talked about and taught so that we may hopefully learn and move toward a more progressive and equal state of being,” Koontz said in an email.</p>\n<p>Shenassa said her goal is to inspire people to care about apartheid and encourage people to think critically.</p>\n<p>“My biggest goal would be to open people’s eyes — to get people who may not have cared about this issue or anything connected to this, to think about it for even a minute,” Shenassa said.</p>\n<p>Shenassa said she hopes events such as this one will motivate students to think about current issues in the changing world.</p>\n<p>“It’s started by one thought — one person or a few people coming together and thinking and discussing and moving forward with bringing events like this to campus and going beyond that,” Shenassa said. “Hopefully I can get at least one person to think critically, to care.”</p>\n<p>The event is scheduled to begin at 7 p.m. and free pizza will be served to attendees.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-67999\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-08/south-african-students-to-host-talk-on-apartheid/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-67999\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-08/south-african-students-to-host-talk-on-apartheid/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-08/south-african-students-to-host-talk-on-apartheid/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-08/south-african-students-to-host-talk-on-apartheid/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-08/south-african-students-to-host-talk-on-apartheid/","id":2546,"author":{"id":129,"name":"Zareena Haidi"},"related":[2545,2544,2543],"comments":[],"followers":[]},{"title":"Associated Students Finance and Business Committee Discuss 27 Funding Request From Campus Organizations","category":"News","subcategory":"Campus","publish_date":"2016-02-09T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?resize=980%2C647&ssl=1","description":"The Associated Students Finance and Business Committee (A.S. F&B) met Monday in the State Street Room of the UCen to discuss funding requests from 27 campus organizations.","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68014\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68014\" data-attachment-id=\"68014\" data-permalink=\"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/finance-and-business_by-paris-cullen-2/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Finance and Business\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-68014\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2-1024x682.jpg?resize=750%2C500\" alt=\"Paris Cullen / Daily Nexus\" width=\"750\" height=\"500\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Finance-and-Business_by-Paris-Cullen-2.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68014\" class=\"wp-caption-text\"><em>Paris Cullen / Daily Nexus</em></p></div>\n<p>The Associated Students Finance and Business Committee (A.S. F&amp;B) met Monday in the State Street Room of the UCen to discuss funding requests from 27 campus organizations.</p>\n<p>The meeting started with $53,003.88 in Office of Student Life, $5,264 in Student Initiated Outreach Program, $11,357 in culture weeks and graduation, $20,480 for sports teams, $5,856 for Academic teams and $5,565 in unallocated funds. A.S. F&amp;B fully granted 11 requests, partially granted eleven requests, tabled four requests and denied one request.</p>\n<p>Group: The Film Studio<br>\nRequest: $6,75.30 for the Santa Barbara Digital Film Festival<br>\nApproved: $6,75.30 allocated</p>\n<p>Group: Gamma Zeta Alpha Fraternity Inc.<br>\nRequest: $2,957.87 for the Latino Youth Leadership Program<br>\nPartially Approved: $737 allocated</p>\n<p>Group: UCSB Indus<br>\nRequest: $1,760 for their 21st Annual South Asian Cultural Show “Too Hot”<br>\nApproved: $1,760 allocated</p>\n<p>Group: UCen<br>\nRequest: $600 for hosting UStudy, 24-hour study spaces during finals week Winter and Spring Quarters<br>\nDenied: $0 allocated</p>\n<p>Group: Hermanos Unidos and Sigma Alpha Zeta<br>\nRequest: $11,686.10 for the College Link Outreach Program<br>\nPartially Approved: $2,693 allocated</p>\n<p>Group: Dance Marathon at UCSB<br>\nRequest: $1,738 for the Dance Marathon<br>\nRequest tabled indefinitely</p>\n<p>Group: American Indian Student Association<br>\nRequest: $600 to host Students Taking Action for Native Dreams and Success<br>\nApproved: $600 allocated</p>\n<p>Group: Associated Student’s Womyn’s Commission<br>\nRequest: $2,250 for honorarium for key speaker at the 5th Womxn of Color Conference<br>\nRequest tabled indefinitely.</p>\n<p>Group: Poet’s Club<br>\nRequest: $750 for Poetry in the Hub<br>\nPartially Approved: $550 allocated</p>\n<p>Group: Pride Club<br>\nRequest: $1,350 for attending the Trans Asterisk Conference<br>\nApproved: $1,350 allocated</p>\n<p>Group: Underwater Rugby<br>\nRequest: $2,020 for the 2nd California Underwater Rugby Tournament<br>\nPartially Approved: $1,100 allocated</p>\n<p>Group: SB Hacks<br>\nRequest: $15,000 for the Second Annual UCSB Hackathon<br>\nPartially Approved: $6,461 allocated</p>\n<p>Group: Pilipino Graduation<br>\nRequest: $5,156.25 for the Pilipino Graduation<br>\nPartially Approved: $1,993 allocated</p>\n<p>Group: Black Graduation<br>\nRequest: $11,000 for the Black Graduation<br>\nPartially Approved: $8,000 allocated</p>\n<p>Group: Lebanese Social Club<br>\nRequest: $1,207.90 for the Lebanese Collegiate Network Conference<br>\nApproved: $1,207.90 allocated</p>\n<p>Group: Olive Tree Initiative<br>\nRequest: $360 for the Olive Tree Initiative National Retreat<br>\nApproved: $360 allocated</p>\n<p>Group: Zeta Beta Phi<br>\nRequest: $350 for their HERstory Brunch<br>\nPartially Approved: $300 with stipulation that they obtain utensils from A.S. Annex.</p>\n<p>Group: Focus Media Journal<br>\nRequest: $4,000 for their 36th volume in the Spring Quarter<br>\nRequest tabled for one week, more funding information needed.</p>\n<p>Group: Iaorana Te Otea<br>\nRequest: $2,380 for their annual Luau<br>\nPartially Approved: $2,065 allocated</p>\n<p>Group: United Students Against Sweatshops<br>\nRequest: $3,750 for attendance to their national conference<br>\nRequest tabled indefinitely.</p>\n<p>Group: Queer and Trans People of Color Collective<br>\nRequest: $6,425 for the Queer and Trans People of Color Conference<br>\nPartially Approved: $4,925 allocated</p>\n<p>Group: UCSB Active Minds<br>\nRequest: $278 for Eating Disorder Awareness Week<br>\nApproved: $278 allocated</p>\n<p>Group: IEEE Photonics Society<br>\nRequest: $150 for electrical engineering speakers<br>\nApproved: $150 allocated</p>\n<p>Group: Pacific Islander Student Association<br>\nRequest: $1,234 for a high school outreach program<br>\nApproved: $1,234 with the stipulation that they use water jugs and pumps instead of water bottles.</p>\n<p>Group: Afrikan Black Coalition<br>\nRequest: $15,003.43 for reallocation funds and subsidies<br>\nApproved: $15,003.43 allocated</p>\n<p>Group: Reel Loud<br>\nRequest: $52.50 for reallocation funds and rentals<br>\nApproved: $52.50 allocated</p>\n<p>Group: Environmental Planning Coalition<br>\nRequest: $3,500 for the American Planning Association Conference<br>\nPartially Approved: $2,500 allocated.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68022\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68022\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-09/associated-students-finance-and-business-committee-discuss-27-funding-request-from-campus-organizations/","id":2547,"author":{"id":124,"name":"Josephine Niu"},"related":[2546,2545,2544],"comments":[],"followers":[]},{"title":"UCSB Anscombe Society Hosts Event Debating Constitutional Right of Same-Sex Marriage","category":"News","subcategory":"Campus","publish_date":"2016-02-05T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/New-Logo-Featured.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/New-Logo-Featured.jpg?resize=355%2C230&ssl=1","description":"The UCSB Anscombe Society, an organization advocating against same-sex marriage, hosted a debate titled “After Obergefell: The Impact on Marriage and Religious Liberty” Thursday night in the Psych...","content":"<div class=\"single-post-content\">\n            <p>The UCSB Anscombe Society, an organization advocating against same-sex marriage, hosted a debate titled “After Obergefell: The Impact on Marriage and Religious Liberty” Thursday night in the Psychology building.</p>\n<p>The debate focused on Obergefell v. Hodges, the June 2015 Supreme Court ruling that legalized same-sex marriage in the United States. Dr. Ryan T. Anderson and UCSB professor of philosophy Dr. Quentin Gee argued the deeper issues of same-sex marriage, such as religion, the definition of marriage and social equality.</p>\n<p>Gee, who advocated in favor of the recent ruling, said marriage is an institution that is constantly changing and should be open to all couples.</p>\n<p>“Marriage is something that is generally defined by the society that we live in, and it changes,” Gee said. “The civil institution of marriage has undergone a number of transformational shifts. People should come to realize that the civil institution of marriage is something that should be expanded to same-sex couples.”</p>\n<p>Gee said the idea of marriage is not a “biological feature of humans,” but rather dynamic and culturally constructed.</p>\n<p>“Marriage is something that humans together collectively define in a particular way,” Gee said. “We’re expanding this notion that marriage is this idea of freedom of the individual to choose these relationships of mutual support between two people.”</p>\n<p>Gee said marriage is a “social institution” and focused his argument on the idea that marriage is not strictly for procreational purposes.</p>\n<p>“We’re changing our conception of marriage,” Gee said. “The conception of marriage has changed to what we might call a companionate sense. When you marry somebody, you are taking on an additional life partner, a companion.”</p>\n<p>According to Gee, religion cannot be used as a legitimate excuse to refuse same-sex marriage and said if it is used, it is on the basis of discrimination.</p>\n<p>“There’s no clear reason to exclude same-sex couples [from marriage]. They can offer elements of companionship,” Gee said. “I don’t see any real, compelling reason, and if there is no compelling reason, it’s seems to be more or less a prejudice.”</p>\n<p>Gee said while religion is important to society, it cannot be used to enforce a law that denies rights to same-sex couples.</p>\n<p>“You cannot use religious reasons to justify or create social institutions or social contracts in ways to suit your religious needs,” Gee said. “Everyone ought to respect religion and appreciate the things it brings to our lives, but at the same time, we cannot impose it. And laws impose.”</p>\n<p>According to Gee, there is no valid reason to deny same-sex couples the right to wed in any state, and said he believes religion cannot justify the rejection of their marriage.</p>\n<p>“There really isn’t a clear, justifiable reason to limit [marriage] to between a man and a woman alone,” Gee said. “I would say that you cannot use religious motivations for limiting the institution of marriage to simply a man and a woman.”</p>\n<p>Dr. Ryan T. Anderson, opponent to the Supreme Court ruling, said he supports a “conjugal vision of marriage” which presents men and women as pairs to unite as one person.</p>\n<p>“Marriage is primarily a comprehensive union of sexual complementary spouses where man and a woman unite as one flesh,” Anderson said. “The act that makes them one flesh has the capacity to create new life, and that relationship of husband and wife has the capacity to create a child with both a mother and a father.”</p>\n<p>According to Anderson, since the U.S. Constitution does not mention what concept of marriage is correct, it is up to citizens to create laws on how marriages should be governed.</p>\n<p>“The 14th Amendment to the Constitution is silent to which one of those visions is true or good or the best,” Anderson said. “And where the Constitution is silent, we the people retain constitutional authority to make laws.”</p>\n<p>Anderson said the flaw in the Supreme Court ruling was that it bypassed constitutional laws by enacting its own opinion on the nation.</p>\n<p>“It imposed that philosophy of marriage on the entire nation under the guise of constitutional law,” Anderson said. “There is no constitutional justification whatsoever by five unelected judges to say, ‘our preferred philosophy of marriage is now required of all fifty states simply because of our fiat.’”</p>\n<p>According to Anderson, the Supreme Court violated the Constitution and said this should be a concern for all informed Americans.</p>\n<p>If you care about constitutional, democratic self-governance, you have to care about the judicial usurpation of politics, which is what took place in Obergefell,” Anderson said.</p>\n<p>Anderson disputed Supreme Court Justice Anthony Kennedy’s reasoning for the ruling and said the future of marriage will constantly be changed to suit different needs.</p>\n<p>“If you think about the actual arguments that Justice Kennedy made to justify his philosophy of marriage, and simply think though, what does it mean for the future of marriage? It means that marriage will simply be redefined as contract law,” Anderson said.</p>\n<p>According to Anderson, Justice Kennedy’s ruling will cause marriage to be continuously redefined in the future.</p>\n<p>“What’s the legal principle for monogamy?” Anderson said. “What prevents future redefinitions of marriage?”</p>\n<p>Anderson said the Obergefell ruling has already affected religiously based businesses and charity organizations that refuse to support the new law.</p>\n<p>“We’ve already seen in jurisdictions where marriages have been redefined where faith-based adoption agencies have been shut down, where schools are beginning to lose their accreditation,” Anderson said. “We’ve seen bakers, florists, photographers penalized not because they said they refuse to serve gay people; their only objection was to baking the same-sex wedding cake or doing the alter flowers for a same-sex marriage.”</p>\n<p>Anderson told the story of a florist who refused to create an arrangement for a same-sex wedding. The women was sued by her state, lost the first round of her legal battles and has appealed to an appellate court.</p>\n<p>“She should have a constitutional right after Obergefell not to be forced to violate her beliefs,” Anderson said. “The Supreme Court says same-sex couple have a right to get marriage, but that doesn’t place a duty upon anyone else to help celebrate that way.”</p>\n<p>Anderson said he hopes there will be a way to discuss the issue and reach a conclusion in a respectful manner.</p>\n<p>“How do we agree to disagree about marriage without persecuting one another, without using the government as a blunt force to impose our values on others?” Anderson said.</p>\n<p>Second-year history and psychology double major Iridian Magallon said before the debate, she was interested to see how Anderson would argue against same-sex marriage without relying on religion.</p>\n<p>“I was really curious as to what the arguments [Anderson] would propose, because I always thought the main argument against same sex marriage was religion,” Magallon said. “So I was curious how he was going to argue without using religion.”</p>\n<p>Magallon said she was surprised that Anderson argued his opinion well, but ultimately agreed with Professor Gee.</p>\n<p>“It was interesting that he was able to argue that side pretty well,” Magallon said. “[In the end], I was still on [Gee’s] side.”</p>\n<p>According to second-year economics and accounting major Andrew Gates, the Supreme Court ruling was unconstitutional and denied state’s rights.</p>\n<p>“The decision of Obergefell was an issue of state’s rights, and I do believe the Supreme Court was engaging in judicial fiat or judicial activism, in that they were not concerned about what the Constitution said about marriage, but rather what they believed,” Gates said. “The issue is that do the states have the right to choose should same-sex marriage be allowed, and I fully believe they should.”</p>\n<p>Gates said he was originally opposed to the Obergefell ruling and believes the Supreme Court was not justified in its action because the federal government involved itself in a state issue.</p>\n<p>“I was against the Supreme Court ruling, and I’m still against it,” Gates said. “Personally, I don’t have any problem with the state legalizing same sex marriage, but the issue is, ‘do you believe in self-governance in a constitutional republic?’ If you do, you would recognize the state right to define marriage is the state’s right, and the federal government should not interfere.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-67959\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-05/ucsb-anscombe-society-hosts-event-debating-constitutional-right-of-same-sex-marriage/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-67959\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-05/ucsb-anscombe-society-hosts-event-debating-constitutional-right-of-same-sex-marriage/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-05/ucsb-anscombe-society-hosts-event-debating-constitutional-right-of-same-sex-marriage/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-05/ucsb-anscombe-society-hosts-event-debating-constitutional-right-of-same-sex-marriage/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-05/ucsb-anscombe-society-hosts-event-debating-constitutional-right-of-same-sex-marriage/","id":2545,"author":{"id":84,"name":"Maura Fox"},"related":[2544,2543,2542],"comments":[],"followers":[]}]},"__N_SSG":true}