{"pageProps":{"article":{"title":"A.S. Senate Discusses Free Speech Issues, Creation of New Offices","category":"News","subcategory":"Campus","publish_date":"2016-02-12T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=980%2C647&ssl=1","description":"The Associate Students Senate met in the Flying A Room of the UCen Wednesday evening to discuss the creation of new offices, organization funding, free speech issues and a threat of a letter of no con...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68190\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68190\" data-attachment-id=\"68190\" data-permalink=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/senate_by-jenny-luo-1-2/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=2000%2C1335&amp;ssl=1\" data-orig-size=\"2000,1335\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate_by Jenny Luo-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=888%2C593&amp;ssl=1\" class=\"wp-image-68190\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1-1024x684.jpg?resize=750%2C501\" alt=\"Jenny Luo / Daily Nexus\" width=\"750\" height=\"501\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=768%2C513&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68190\" class=\"wp-caption-text\"><em>Jenny Luo / Daily Nexus</em></p></div>\n<p>The Associate Students (A.S.) Senate met in the Flying A Room of the UCen Wednesday evening to discuss the creation of new offices, organization funding, free speech issues and a threat of a letter of no confidence from S.C.O.R.E.</p>\n<p>Senate funded the Formal Office of Sustainability, the UStudy program and the honorarium of speaker Alexis Pauline Gumbs for the annual Womyn of Color Conference. The senate also sent a resolution to External Affairs supporting the “Idaho stop,” a plan that would allow bicyclists to slow down at stop signs instead of stopping completely. Young Americans for Liberty members addressed free speech issues and a Student Commission on Racial Equality (S.C.O.R.E.) member addressed concerns with proposed committee resolutions.</p>\n<p>Cassie Rubio, fourth-year comparative literature and global studies double major, said the senate should be devoting their resources to minority groups.</p>\n<p>“Given some of the events happening on campus this year, given [U.S. Customs and Border Protection] CBP being on our campus, given that, from what I hear, funding has just been given to a group on campus with homophobic beliefs last week, we feel that it’s necessary to invest in marginalized groups like women of color specifically,” Rubio said.</p>\n<p>A.S. Senate voted 13-3-1 to table the request indefinitely.</p>\n<p>Austin Amato, third-year economics and accounting major, represented Reserve Officers’ Training Corp (ROTC) in requesting early pass times for ROTC members who will go into active service upon graduation.</p>\n<p>A.S. Senate requested ROTC address the academic senate and the Office of the President.</p>\n<p>Travis Taylor, UCen representative and fourth-year sociology major, requested $600 to hold UStudy, a program that would allow the UCen to be open 24 hours during finals week. The request was tabled indefinitely by A.S. F&amp;B on Monday.</p>\n<p>A.S. Senate voted to fully fund the request.</p>\n<p>Brandon Morse, President of Young Americans for Liberty and fourth-year political science major, called for a resolution protecting free speech rights.</p>\n<p>Morse said there have been recent threats made against him as President of Young Americans for Liberty and Jason Garshfield, vice-president and fourth-year political science major.</p>\n<p>“We have students on this campus threatening members of my club with stabbing them because they’re exercising their First Amendment right,” Morse said.</p>\n<p>Morse said the Graduate Student Association’s (GSA) statement of solidarity, which condemned hate speech, was not based on factual evidence and used inappropriate language.</p>\n<p>“With all respect to the GSA and the fallacious points of view they have presented to this campus, they have no rationality for anything they’re saying,” Morse said.</p>\n<p>Morse said making a threat to anyone, regardless of the intention of carrying it out, is a crime that should be taken seriously regardless of that person’s identity.</p>\n<p>“If I or any member of my club were to make that same comment to somebody else, there would be an uproar on our campus,” Morse said. “I think this type of language is ridiculous and especially having the Graduate Student Association come in with nothing but rhetoric and attack someone exercising their First Amendment right is ridiculous.”</p>\n<p>Garshfield said attacks against people exercising their First Amendment rights will not improve if the senate does not take legislative action.</p>\n<p>“As long as we do not pass resolutions supporting free speech, incidents like this will continue to happen because A.S. will not have taken a stance,” Garshfield said. “I think the events over the last several weeks prove the necessity of a resolution.”</p>\n<p>Marjan Kris, (S.C.O.R.E.) representative and second-year history of public policy and environmental studies double major gave a quarterly report about the success of their recent Environmental Racism and Environmental Justice Workshop.</p>\n<p>Kris said resolutions to create committees to hire senators makes him “extremely” uncomfortable.</p>\n<p>“Some of the same senators that were involved in the controversial process of picking recently appointed senators are either chairing or vice-chairing these committees,” Kris said. “These are the same senators who are currently being investigated for potentially violating legal code.”</p>\n<p>Kris said the process will not adequately reflect students’ voice in student government.</p>\n<p>“It does not reflect democratic process. It makes students who want to participate in A.S. shy away from it.”</p>\n<p>Kris said if the resolution regarding the committees passes, various student groups and Office of Student Life (OSL) organizations will release a statement of no confidence toward the senate.</p>\n<p>Representing Environmental Affairs Board, Nick Frey, third-year computer science and environmental studies double major, said the university needs the Formal Office of Sustainability to achieve UCSB’s green environment goals over the next 10 years.</p>\n<p>“We believe that a Formal Office of Sustainability is necessary if we want to achieve our campus goals of being carbon-free by 2020 and waste-free by 2025,” Frey said. “All the other UCs have a similar office, so I believe it’s something overdue for our campus.”</p>\n<p>A.S. Senate voted 16-0-1 to create a Formal Office of Sustainability</p>\n<p>Jerel Constantino, off-campus senator and third-year history of public policy major, introduced a resolution calling upon UCPD, Santa Barbara Sheriff’s Department and California Highway Patrol to support the Iowa Stop.</p>\n<p>“This is a response to, I believe, Paula coming to senate in her weekly report saying that UCPD was going to begin a crackdown on bicycles running stop signs,” Constantino said, “However, research shows that it’s less safe for bicycles to stop.”</p>\n<p>A.S. Senate sent the resolution to External Affairs.</p>\n<p>A.S. Womyn’s Commission requested $2,050 for an honorarium for Alexis Pauline Gumbs as a speaker for their Annual Womyn of Color Conference, a request A.S. Finance and Business Committee (A.S. F&amp;B) tabled indefinitely on Monday.</p>\n<p>A.S. Senate also voted on Senator Alejandra Melgoza retaining her off-campus senator position despite moving into university housing. In a 11-1-5 vote, A.S. voted for Senator Melgoza to retain her position.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68189\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68189\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/","id":2553,"author":{"id":127,"name":"Amy Koo"},"related":[2552,2551,2550],"comments":[],"followers":[]},"author":{"id":127,"name":"Amy Koo","biography":"Not available","articles":[2532,2553,2572,2583,2594,2608,2634,2641,2651,2656,2663,2681,3868,4615],"portrait":"Not available"},"related":[{"title":"Santa Barbara County Second To Adopt H.E.A.L.","category":"News","subcategory":"Campus","publish_date":"2016-02-11T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?resize=406%2C343&ssl=1","description":"Santa Barbara County has officially adopted the Healthy Eating Active Living (H.E.A.L.) resolution to promote healthy living for residents, becoming the second county in California to do so.","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68114\" style=\"width: 416px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68114\" data-attachment-id=\"68114\" data-permalink=\"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/heal_courtesy-of-avphdotorg/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?fit=406%2C343&amp;ssl=1\" data-orig-size=\"406,343\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"HEAL\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?fit=250%2C211&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?fit=406%2C343&amp;ssl=1\" class=\"size-full wp-image-68114\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?resize=406%2C343\" alt=\"Photo Courtesy of AVPH.org \" width=\"406\" height=\"343\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?w=406&amp;ssl=1 406w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?resize=250%2C211&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/HEAL_Courtesy-of-AVPHdotorg.jpg?resize=120%2C100&amp;ssl=1 120w\" sizes=\"(max-width: 406px) 100vw, 406px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68114\" class=\"wp-caption-text\">Photo Courtesy of AVPH.org</p></div>\n<p>Santa Barbara County has officially adopted the Healthy Eating Active Living (H.E.A.L.) resolution to promote healthy living for residents, becoming the second county in California to do so.</p>\n<p>The resolution will ensure residents have access to locally grown produce and provide healthier food options in schools, as well as education about living healthy lifestyles.</p>\n<p>First District County Supervisor Salud Carbajal is working with the County to maintain the new resolution and said he hopes the program will reach everyone who is interested in learning about a healthy lifestyle, no matter their current level of health.</p>\n<p>“I think we are targeting everyone in general,” Carbajal said. “There are disparities in health issues in our community with various groups and income levels, but I think that our goal is to approach the entire community with an understanding that certain communities need a little extra outreach and consideration.”</p>\n<p>Carbajal said the resolution will help people understand ways to live healthy lives and hopes the program will develop into a community effort.</p>\n<p>“Once you make it a community-wide effort, it becomes part of our values in our community to exercise, to be conscious of having a healthier diet,” Carbajal said. “And to understand there are some basic things we can do to create wellness and health to prevent certain devastating, long-term medical conditions that only diminish our quality of life or result in huge costs of medical debts.”</p>\n<p>Carbajal said implementing the principles of the resolution will be an effortful process.</p>\n<p>“We will come up with a strategic plan and identify some specific goals whether it be environmental or healthy foods or even employee wellness,” Carbajal said.</p>\n<p>Trina Long, coordinator of the Nutritional Service Program with the Public Health Department and chair of Live Well Santa Barbra County Coalition, said although H.E.A.L. has collaborated with many entities, the Coalition is at the forefront of the program.</p>\n<p>“There are lots of different partners that have been and are continuing to work on different initiatives in our county that focus on healthy living and active eating,” Long said. “The Live Well Coalition is the backbone of that partnership. There are different organizations, agencies and government officials with an interest in nutrition, physical activity, environmental health and public healthy eating and active living.”</p>\n<p>According to Long, the Coalition takes community members’ opinions into consideration when making healthy lifestyle plans.</p>\n<p>“What we do is look at it as addressing it in a collective impact type of way,” Long said. “We have different goals and objectives but when we start talking down to the nitty-gritty, we realize that even though our county program is focused on healthy eating and active living, when we start talking with our partners and with community members, we hear about barriers that need to be addressed in order for us to be successful in getting people to eat healthier and get active.”</p>\n<p>Long said the Coalition will use community-based education and policy formation to promote H.E.A.L.’s message.</p>\n<p>“A group of our coalition partners that are interested in H.E.A.L. are working on getting the word out to private businesses and individuals that can make changes that would support a healthier environment and living for themselves,” Long said.</p>\n<p>Long said involvement from other local groups and businesses will be important to H.E.A.L.’s success.</p>\n<p>“We are planning different ways to get the word out about H.E.A.L., possibly a speakers bureau to cities who do not have a H.E.A.L. resolution yet,” Long said. “Also, reaching out to community clubs and organizations such as the Rotary Club to provide information about H.E.A.L. and offer ways that they could bring this back to their employer.”</p>\n<p>Fifth District County Supervisor Steve Lavagnino, who collaborated with Carbajal to pass the resolution, said he believes it is something everyone in the County should support.</p>\n<p>“Who is going to oppose trying to get kids to eat healthy and be active? It’s one of those things everybody talks about but we need to have everyone tied in,” Lavagnino said.</p>\n<p>According to Lavagnino, the resolution aims to prompt individual County residents to make changes.</p>\n<p>“It must become a lifestyle change and not just a resolution that we’re passing,” Lavagnino said. “We need to get people’s awareness up so they can make healthier decisions in their life.”</p>\n<p>Third-year English major Olivia Kapheim said she will appreciate knowing there is a County-level effort to support healthy lifestyles among residents.</p>\n<p>“I keep up on my sleep and eat healthy meals and not just snacking throughout the day,” Kapheim said. “I think a healthy lifestyle is doable on your own, but it would be nice to have community support.”</p>\n<p>A version of this story appeared on p. 8 of the Thursday, Feb. 11, 2016 edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68122\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68122\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-11/santa-barbara-county-second-to-adopt-h-e-a-l/","id":2552,"author":{"id":131,"name":"Amanda Quick"},"related":[2551,2550,2549],"comments":[],"followers":[]},{"title":"Activists Discuss Israel, Apartheid State Label","category":"News","subcategory":"Campus","publish_date":"2016-02-11T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?resize=980%2C647&ssl=1","description":"Black South African activists Jamie Mithi and Khanyisa Pinini discussed their views on labeling Israel an apartheid state in an event hosted by Gauchos United for Israel on Tuesday in the Isla Vista T...","content":"<div class=\"single-post-content\">\n            <h2>The two South African activists, who have both experienced apartheid, came together to speak on why they think the labeling of Israel as an “apartheid state” is mostly inaccurate</h2>\n<div id=\"attachment_68110\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-68110\" data-attachment-id=\"68110\" data-permalink=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/apartheid_by-spencer-brandt-2/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?fit=2000%2C1500&amp;ssl=1\" data-orig-size=\"2000,1500\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Apartheid_by Spencer Brandt-2\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?fit=250%2C188&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?fit=888%2C666&amp;ssl=1\" class=\"size-large wp-image-68110\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2-1024x768.jpg?resize=888%2C666\" alt=\"Spencer Brandt / Daily Nexus\" width=\"888\" height=\"666\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?resize=1024%2C768&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?resize=250%2C188&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?resize=768%2C576&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-2.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68110\" class=\"wp-caption-text\">Spencer Brandt / Daily Nexus</p></div>\n<p>Black South African activists Jamie Mithi and Khanyisa Pinini discussed their views on labeling Israel an apartheid state in an event hosted by Gauchos United for Israel on Tuesday in the Isla Vista Theater.</p>\n<p>Mithi, originally from Zimbabwe, is an author and law student at University of the Witwatersrand Johannesburg. He is an avid debater, ranked fourth globally and first in Africa in the World Universities Public Speaking Championship. Pinini, originally from Johannesburg, has been heavily involved with student leadership at University of Cape Town (UCT) and is a member of the United Nations Association of South Africa: UCT Chapter and has participated two times in national Model United Nations conferences.</p>\n<p>Mithi and Pinini both shared their personal experiences with apartheid in South Africa and how their own narratives informed their definitions of the term “apartheid.” Both said they used to support the Boycott, Divestment and Sanction movement, but withdrew their support after visiting Israel. The two speakers said they have felt a loss of Black South African apartheid narrative due to the use of the term to label Israel when referring to conflict with Palestine.</p>\n<p>Mithi first proposed that a major difference between an apartheid state and the status of Israel is historical context. In the context of debate, he presented the claim that Israel is a colonial-settler state, then refuted this idea by stating there cannot be a colonial-settler state if said settlers already existed within an area.</p>\n<p>“It is a non sequitur for us to claim that people who have always had a presence in a particular area, are colonizers of the area if they’ve always been there,” Mithi said.</p>\n<p>The second level of Mithi’s argument focused on the legislative structure of apartheid versus that of the state of Israel. He said apartheid law’s “four levels of existence,” which are based upon racial discrimination, are “just not the way it is” in Israel’s legal system.</p>\n<p>“In Israel, all Israeli citizens have the same rights,” Mithi said.</p>\n<p>This difference in citizen rights is what he argues sets apartheid and the Israeli state apart.</p>\n<p>His third level of debate focused on the context of the area. He said conflicts in the surrounding areas of Israel are what “led to the conflicts in the West Bank.” This war-zone environment is another factor, according to Mithi, that sets true apartheid apart from the Israel-Palestine conflict.</p>\n<p>“It would be complete false argumentation and academically insincere to say that’s apartheid,” Mithi said. “The reality is, what I’m talking about, the scenario of ‘peaceful neighbor,’ where I’m talking about a scenario where the neighbors aren’t seeing eye to eye, right?”</p>\n<p>In his closing statement, Mithi said when discussing Israel-Palestine conflict, neither side should vilify the other.</p>\n<p>“There is a problem in Israel [and] Palestine, and largely in the Middle East. And I don’t think that the tactic of demonizing the other side leads to the relevant solution,” Mithi said.</p>\n<div id=\"attachment_68109\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-68109\" data-attachment-id=\"68109\" data-permalink=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/apartheid_by-spencer-brandt-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?fit=2000%2C1500&amp;ssl=1\" data-orig-size=\"2000,1500\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Apartheid_by Spencer Brandt-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?fit=250%2C188&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?fit=888%2C666&amp;ssl=1\" class=\"size-large wp-image-68109\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1-1024x768.jpg?resize=888%2C666\" alt=\"Spencer Brandt / Daily Nexus\" width=\"888\" height=\"666\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?resize=1024%2C768&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?resize=250%2C188&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?resize=768%2C576&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Apartheid_by-Spencer-Brandt-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68109\" class=\"wp-caption-text\">Spencer Brandt / Daily Nexus</p></div>\n<p>Michelle May, a second-year biology major, said she was impressed by Mithi and Pinini’s expertise.</p>\n<p>“I didn’t come here expecting anything, I found it really interesting to hear [about the conflict] from a South African point of view, coming from a family that has experienced apartheid,” May said. “And they’re obviously really educated about both topics.”</p>\n<p>Event organizer Kayla Shenassa, a second-year classics major, said the event exceeded her expectations.</p>\n<p>“It was really great to see the number of people that came out to an event like this. It felt like people actually cared about the issue that was being discussed,” Shenassa said. “When I started planning this event, my goal was to reach at least one person and make one person think, and I definitely think I got more than one person thinking yesterday.”</p>\n<p>A version of this story appeared on p. 6 of the Thursday, Feb. 11, 2016 edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68120\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68120\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-11/activists-discuss-israel-apartheid-state-label/","id":2550,"author":{"id":122,"name":"Sohila Sandher"},"related":[2549,2548,2547],"comments":[],"followers":[]},{"title":"DanceSafe Founder Educates Students on MDMA","category":"News","subcategory":"Campus","publish_date":"2016-02-11T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?resize=980%2C647&ssl=1","description":"DanceSafe founder Emanuel Sferios gave a presentation on MDMA effects and safety on Wednesday in an event hosted by Students for Sensible Drug Policies UCSB Chapter (SSDP), Life of the Party (LOTP) an...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68101\" style=\"width: 1034px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-68101\" data-attachment-id=\"68101\" data-permalink=\"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/mdma_will-tran-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"MDMA Lecture\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-large wp-image-68101\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1-1024x682.jpg?resize=888%2C591\" alt=\"DanceSafe founder Emanuel Sferios suggests a regulated system through which adults could obtain pure, legal MDMA, thus reducing the criminal market and access to minors. Will Tran / Daily Nexus\" width=\"888\" height=\"591\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?resize=768%2C512&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/MDMA_Will-Tran-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68101\" class=\"wp-caption-text\"><em>DanceSafe founder Emanuel Sferios suggests a regulated system through which adults</em><br><em>could obtain pure, legal MDMA, thus reducing the criminal market and access to minors.</em> Will Tran / Daily Nexus</p></div>\n<p>DanceSafe founder Emanuel Sferios gave a presentation on MDMA effects and safety on Wednesday in an event hosted by Students for Sensible Drug Policies UCSB Chapter (SSDP), Life of the Party (LOTP) and the UCSB Associated Students (A.S.) Public Safety Commission.</p>\n<p>A full house was present at Embarcadero Hall as Sferios discussed the history of MDMA, its therapeutic use and public policies regarding the drug. He offered harm reduction strategies, sold drug testing kits and reminded attendees that no drug use is completely safe.</p>\n<p>Marjan Riazi, graduate from UCSB and education and outreach coordinator for the UCSB Alcohol &amp; Drug Program, said it is important students are informed on the effects of drug use and safest possible methods if they choose to experiment.</p>\n<p>“We are really excited that you are all here talking about something that is really important and certainly impacts our community,” Riazi said. “We are telling you learn the facts, learn the information … be safe, we just want you to known all the facts. Sometimes people hear things, especially in Isla Vista, that isn’t necessarily true especially when it comes to substances like MDMA.”</p>\n<p>Cole Garcia, SSDP chapter leader and a second-year biology major, said the goal of SSDP is to educate students on drug safety and public policies that can be ineffective.</p>\n<p>“Within the Isla Vista community we are working on similar things to the Alcohol &amp; Drug Program, so harm reduction through education, but another goal of our group is to get future voters in our political system well educated on the ways that drug policy can be improved,” Garcia said.</p>\n<p>Sferios said universities typically focus on abstinence when discussing drug use, but they should instead take the same stance as they have on alcohol and educate students on how to partake as safely as possible if one chooses to do so.</p>\n<p>“The university doesn’t say just ‘don’t drink, just don’t do it!’ They say, ‘ok we know some people will and if you do you need to know what you are doing to be safe,’” Sferios said. “That same approach really needs to be happening with party drugs like MDMA and I am really glad to see that Life of the Party is here doing that.”</p>\n<p>According to Sferios, prohibition of MDMA creates a more dangerous situation in which safety education is often neglected.</p>\n<p>“I realized DanceSafe and other harm reduction programs are more trying to counter the harm that results from our drug policies,” Sferios said.</p>\n<p>Sferios said there are beneficial therapeutic uses of MDMA, particularly for treating PTSD, because it releases the brain’s stored serotonin.</p>\n<p>“The receptors of serotonin are excitatory and inhibitory in all the right places to reduce anxiety while at the same time making the person very alert and increasing activity in the forebrain where you put things in context and look at traumatic experiences without fear,” Sferios said.</p>\n<p>This is not to say that the drug is always beneficial, as 15 to 20 people a year in the United States die after taking MDMA, according to Sferios.</p>\n<p>“I was told by Life of the Party that in the last five years there have been 10 deaths on this campus related to alcohol and prescription drugs but none related to Molly as far as I know on this campus,” Sferios said.</p>\n<p>Sferios said legal drugs may have a much higher fatality rate in the United States.<br>\n“Aspirin kills 400 people a year,” Sferios said.</p>\n<p>Users of MDMA should be weary of over-heating and take time to cool down and drink water to stay hydrated, because serotonin-based drugs increase the risk of heat stroke by limiting the body’s thermoregulation, according to Sferios.</p>\n<p>“There is a warning label on Prozac for the same reasons,” Sferios said. “Who has ever had a warning label when they bought their MDMA from a dealer that said be careful? No, that is because the drug is illegal and this kind of life-saving essential information is not allowed.”</p>\n<p>Sferios said public policy should aim to reduce “adulterated criminal market” that provides minors with MDMA and lacks safety regulation.</p>\n<p>“We don’t really want MDMA available in convenience stores, right? We want to protect young people, we want to protect our children,” Sferios said.</p>\n<p>Sferios said he recommends a regulated dispensary system through which adults could obtain pure, legal MDMA.</p>\n<p>“We would reduce the criminal market and reduce access to minors,” Sferios said. “You would still have some adults diverge and buying it and giving it to minors, but you would limit the amount of adults, you limit that process.”</p>\n<p>A version of this story appeared on p. 7 of the Thursday, Feb. 11, 2016 edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68121\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68121\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-11/dancesafe-educates-students-on-mdma/","id":2551,"author":{"id":118,"name":"Peeka Zimmerman"},"related":[2550,2549,2548],"comments":[],"followers":[]}]},"__N_SSG":true}