{"pageProps":{"article":{"title":"Esteemed Professor Teaches Popular Seminar","category":"News","subcategory":"Campus","publish_date":"2016-01-21T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?resize=980%2C647&ssl=1","description":"Mathematics 266HH: Analytic Number Theory is likely one of the most overcrowded courses at UC Santa Barbara this quarter.","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_67516\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-67516\" data-attachment-id=\"67516\" data-permalink=\"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/zhang_courtesy-of-macfounddotorg-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Yitang Zhang\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-67516\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1-1024x682.jpg?resize=750%2C500\" alt=\"Photo Courtesy of Macfound.org\" width=\"750\" height=\"500\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?resize=768%2C512&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Zhang_Courtesy-of-Macfounddotorg-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-67516\" class=\"wp-caption-text\">Photo Courtesy of Macfound.org</p></div>\n<p>Mathematics 266HH: Analytic Number Theory is likely one of the most overcrowded courses at UC Santa Barbara this quarter.</p>\n<p>The graduate seminar meets in a small classroom in the Humanities and Social Sciences Building and is intended for a maximum of 25 students. Yet, even as the university heads into its third week of the Winter Quarter, there are not enough chairs in the room for all of the fascinated students.</p>\n<p>While Analytic Number Theory may not be what attracts these students, the professor, Dr. Yitang Zhang, does.</p>\n<p>“He’s probably, at this point, one of the most famous mathematicians in the world,” Jeffrey Stopple, UCSB mathematics professor, told the Nexus when Zhang was hired in September. “I think there might be only maybe two or three others alive that have his level of celebrity.”</p>\n<p>Zhang gained fame amongst mathematicians in 2013 after submitting a proof to the Annals of Mathematics, establishing the first finite bound on gaps between twin prime numbers and thus solving the Twin Prime Conjecture, a 150-year-old math problem. At the time, he was working as a part-time calculus teacher at the University of New Hampshire and gained instant recognition, winning a MacArthur Award in 2014, and was promoted to full professorship.</p>\n<p>Zhang’s accomplishment also made its way to the silver screen. The New York Times reported Zhang’s breakthrough a month after his submission, and filmmaker George Csicsery made Zhang the subject of 2015 documentary “Counting from Infinity.”</p>\n<p>Garo Sarajian, a mathematics graduate student at UCSB, said he noticed that people outside of the math world were beginning to recognize Zhang’s name.</p>\n<p>Sarajian said he struck up a conversation with a “random economics student” next to him on the bus, and was surprised that he had already heard of Zhang.</p>\n<p>“Of course I know [Zhang] is a big deal, but I had no idea how big of a deal he was outside the department,” Sarajian said.</p>\n<p>UCSB’s math department announced Zhang’s hiring in September. Zhang currently spends much of his time teaching one very popular, overcrowded graduate seminar and conducting further research into number theory.</p>\n<p>“The department did not ask me to teach so much, but I will at times,” Zhang said. “It’s more research time.”</p>\n<p>Zhang said he decided to accept an offer from Chancellor Henry T. Yang in the summer after he was recommended by Harvard University mathematics professor Shing-Tung Yau.</p>\n<p>“I got an email from Professor Yau and, very quickly, I said, ‘Yes I would like to do that,’” Zhang said.</p>\n<p>Zhang remarks that the “feeling” and environment in Santa Barbara is “very different” from New Hampshire. He said he especially enjoys the view of the Santa Ynez Mountains from his office on the sixth floor of South Hall.</p>\n<p>“On a sunny day, you can see the mountain very clearly,” Zhang said. “I really love it here. I will use the good environment to try to do something more.”</p>\n<p>When he is not teaching or researching, Zhang walks around campus and on the beach. Sarajian said Zhang will strike up small conversations with many of the people he passes.</p>\n<p>“He’s very friendly and very approachable,” Sarajian said. “If you didn’t know who he is, you’d think he’s just another very friendly professor.”</p>\n<p>Sarajian, who attends Zhang’s Analytic Number Theory seminar, said Zhang possesses a remarkable ability to engage with his students, whether it be frequently joking with the class or providing insight.</p>\n<p>“He’s not only good at teaching but also at getting [students] excited about what he’s teaching as well,” Sarajian said. “When someone in his position is able to do that, it’s a big deal.”</p>\n<p>Mathematics graduate student Nicolas Brody said Zhang is energetic but modest.</p>\n<p>“However great his achievements, he is a remarkably humble man, and in his Analytic Number Theory course this quarter, he is a very expressive and energetic professor,” Brody said in an email.</p>\n<p>Chancellor Yang said having an “exceptionally dedicated” teacher and mathematician like Zhang on campus boosts the university’s status.</p>\n<p>“His renowned research and scholarship elevate the proud reputation of our university, and now that he is here in the classroom, our students and their education will directly benefit from his brilliance,” Yang said in an email.</p>\n<p>Sarajian said he thinks Zhang’s presence will add prestige to the university and attract more students to the program.</p>\n<p>“The school has a celebrity professor we can brag about,” Sarajian said. “It’s amazing how one person does make a difference.”</p>\n<p>Zhang said he hopes to stay at UCSB until his eventual retirement.</p>\n<p>Despite all of his achievements, Zhang said he does not believe he has yet reached the pinnacle of his career.</p>\n<p>“I’m going to keep going up,” Zhang said.</p>\n<p>A version of this story appeared on page 1 of the Thursday, January 21, 2016 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-67541\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-67541\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-01-21/esteemed-professor-teaches-popular-seminar/","id":2556,"author":{"id":30,"name":"Josh Ortiz"},"related":[2555,2554,2553],"comments":[],"followers":[]},"author":{"id":30,"name":"Josh Ortiz","biography":"Not available","articles":[2355,2371,2376,2377,2406,2411,2412,2418,2420,2422,2427,2435,2450,2451,2459,2498,2505,2509,2556,2577,2605,2624,2691,2696,2713,2716,2717,2742,2771,2848,2858,2874,2907,2941,2951,3440,3458,3600,3602,3629,3742,3743,3747,3864,3904,3953,3956,4139,4421,4428,4447,4459,4480,4484,4490,4500,4507,4508,4509,4575,4587,4589,4598,4603,4618,4621,4627,4628,4632,4641,4646,4648,4651,4653,4661,4663,4675,4705,4745,4765,4773,4778,4815],"portrait":"Not available"},"related":[{"title":"A.S. Senate Discusses Free Speech Issues, Creation of New Offices","category":"News","subcategory":"Campus","publish_date":"2016-02-12T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=980%2C647&ssl=1","description":"The Associate Students Senate met in the Flying A Room of the UCen Wednesday evening to discuss the creation of new offices, organization funding, free speech issues and a threat of a letter of no con...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_68190\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-68190\" data-attachment-id=\"68190\" data-permalink=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/senate_by-jenny-luo-1-2/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=2000%2C1335&amp;ssl=1\" data-orig-size=\"2000,1335\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate_by Jenny Luo-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?fit=888%2C593&amp;ssl=1\" class=\"wp-image-68190\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1-1024x684.jpg?resize=750%2C501\" alt=\"Jenny Luo / Daily Nexus\" width=\"750\" height=\"501\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?resize=768%2C513&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/02/Senate_by-Jenny-Luo-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-68190\" class=\"wp-caption-text\"><em>Jenny Luo / Daily Nexus</em></p></div>\n<p>The Associate Students (A.S.) Senate met in the Flying A Room of the UCen Wednesday evening to discuss the creation of new offices, organization funding, free speech issues and a threat of a letter of no confidence from S.C.O.R.E.</p>\n<p>Senate funded the Formal Office of Sustainability, the UStudy program and the honorarium of speaker Alexis Pauline Gumbs for the annual Womyn of Color Conference. The senate also sent a resolution to External Affairs supporting the “Idaho stop,” a plan that would allow bicyclists to slow down at stop signs instead of stopping completely. Young Americans for Liberty members addressed free speech issues and a Student Commission on Racial Equality (S.C.O.R.E.) member addressed concerns with proposed committee resolutions.</p>\n<p>Cassie Rubio, fourth-year comparative literature and global studies double major, said the senate should be devoting their resources to minority groups.</p>\n<p>“Given some of the events happening on campus this year, given [U.S. Customs and Border Protection] CBP being on our campus, given that, from what I hear, funding has just been given to a group on campus with homophobic beliefs last week, we feel that it’s necessary to invest in marginalized groups like women of color specifically,” Rubio said.</p>\n<p>A.S. Senate voted 13-3-1 to table the request indefinitely.</p>\n<p>Austin Amato, third-year economics and accounting major, represented Reserve Officers’ Training Corp (ROTC) in requesting early pass times for ROTC members who will go into active service upon graduation.</p>\n<p>A.S. Senate requested ROTC address the academic senate and the Office of the President.</p>\n<p>Travis Taylor, UCen representative and fourth-year sociology major, requested $600 to hold UStudy, a program that would allow the UCen to be open 24 hours during finals week. The request was tabled indefinitely by A.S. F&amp;B on Monday.</p>\n<p>A.S. Senate voted to fully fund the request.</p>\n<p>Brandon Morse, President of Young Americans for Liberty and fourth-year political science major, called for a resolution protecting free speech rights.</p>\n<p>Morse said there have been recent threats made against him as President of Young Americans for Liberty and Jason Garshfield, vice-president and fourth-year political science major.</p>\n<p>“We have students on this campus threatening members of my club with stabbing them because they’re exercising their First Amendment right,” Morse said.</p>\n<p>Morse said the Graduate Student Association’s (GSA) statement of solidarity, which condemned hate speech, was not based on factual evidence and used inappropriate language.</p>\n<p>“With all respect to the GSA and the fallacious points of view they have presented to this campus, they have no rationality for anything they’re saying,” Morse said.</p>\n<p>Morse said making a threat to anyone, regardless of the intention of carrying it out, is a crime that should be taken seriously regardless of that person’s identity.</p>\n<p>“If I or any member of my club were to make that same comment to somebody else, there would be an uproar on our campus,” Morse said. “I think this type of language is ridiculous and especially having the Graduate Student Association come in with nothing but rhetoric and attack someone exercising their First Amendment right is ridiculous.”</p>\n<p>Garshfield said attacks against people exercising their First Amendment rights will not improve if the senate does not take legislative action.</p>\n<p>“As long as we do not pass resolutions supporting free speech, incidents like this will continue to happen because A.S. will not have taken a stance,” Garshfield said. “I think the events over the last several weeks prove the necessity of a resolution.”</p>\n<p>Marjan Kris, (S.C.O.R.E.) representative and second-year history of public policy and environmental studies double major gave a quarterly report about the success of their recent Environmental Racism and Environmental Justice Workshop.</p>\n<p>Kris said resolutions to create committees to hire senators makes him “extremely” uncomfortable.</p>\n<p>“Some of the same senators that were involved in the controversial process of picking recently appointed senators are either chairing or vice-chairing these committees,” Kris said. “These are the same senators who are currently being investigated for potentially violating legal code.”</p>\n<p>Kris said the process will not adequately reflect students’ voice in student government.</p>\n<p>“It does not reflect democratic process. It makes students who want to participate in A.S. shy away from it.”</p>\n<p>Kris said if the resolution regarding the committees passes, various student groups and Office of Student Life (OSL) organizations will release a statement of no confidence toward the senate.</p>\n<p>Representing Environmental Affairs Board, Nick Frey, third-year computer science and environmental studies double major, said the university needs the Formal Office of Sustainability to achieve UCSB’s green environment goals over the next 10 years.</p>\n<p>“We believe that a Formal Office of Sustainability is necessary if we want to achieve our campus goals of being carbon-free by 2020 and waste-free by 2025,” Frey said. “All the other UCs have a similar office, so I believe it’s something overdue for our campus.”</p>\n<p>A.S. Senate voted 16-0-1 to create a Formal Office of Sustainability</p>\n<p>Jerel Constantino, off-campus senator and third-year history of public policy major, introduced a resolution calling upon UCPD, Santa Barbara Sheriff’s Department and California Highway Patrol to support the Iowa Stop.</p>\n<p>“This is a response to, I believe, Paula coming to senate in her weekly report saying that UCPD was going to begin a crackdown on bicycles running stop signs,” Constantino said, “However, research shows that it’s less safe for bicycles to stop.”</p>\n<p>A.S. Senate sent the resolution to External Affairs.</p>\n<p>A.S. Womyn’s Commission requested $2,050 for an honorarium for Alexis Pauline Gumbs as a speaker for their Annual Womyn of Color Conference, a request A.S. Finance and Business Committee (A.S. F&amp;B) tabled indefinitely on Monday.</p>\n<p>A.S. Senate also voted on Senator Alejandra Melgoza retaining her off-campus senator position despite moving into university housing. In a 11-1-5 vote, A.S. voted for Senator Melgoza to retain her position.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-68189\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-68189\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-12/a-s-senate-discusses-free-speech-issues-creation-of-new-offices/","id":2553,"author":{"id":127,"name":"Amy Koo"},"related":[2552,2551,2550],"comments":[],"followers":[]},{"title":"Students, Senate Discuss Free Speech Issues","category":"News","subcategory":"Campus","publish_date":"2016-01-21T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?resize=980%2C647&ssl=1","description":"The Associated Students (A.S.) Senate met Wednesday in the Flying A room to accept the resignation of two senators, discuss internal matters and host public forum, which included several students call...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_67514\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-67514\" data-attachment-id=\"67514\" data-permalink=\"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/senate_by-alex-nagase-1-2/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?fit=2000%2C1325&amp;ssl=1\" data-orig-size=\"2000,1325\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate_by Alex Nagase-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?fit=888%2C588&amp;ssl=1\" class=\"wp-image-67514\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1-1024x678.jpg?resize=750%2C497\" alt=\"Alex Nagase / Daily Nexus\" width=\"750\" height=\"497\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?resize=1024%2C678&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?resize=250%2C166&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?resize=768%2C509&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/01/Senate_by-Alex-Nagase-1-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-67514\" class=\"wp-caption-text\">In addition to discussion of threats to free speech at the University, two senators submitted letters of resignation. <em>Alex Nagase / Daily Nexus</em></p></div>\n<p>The Associated Students (A.S.) Senate met Wednesday in the Flying A room to accept the resignation of two senators, discuss internal matters and host public forum, which included several students calling for First Amendment reform at UCSB.</p>\n<p>Jason Garshfield, fourth-year political science major, introduced the issue saying, “This right of free expression is under threat at UCSB.” Garshfield presented an article from the Foundation for Individual Rights in Education (F.I.R.E.) which gave UCSB at a “red light” rating regarding freedom of speech and expression at the University. According to F.I.R.E., a red light university has at least one policy that both clearly and substantially restricts freedom of speech.</p>\n<p>According to Garshfield, UCSB’s recent implementation of a “Bias Response Team” poses a threat to students by limiting speech which is labeled as offensive.</p>\n<p>Garshfield proposed drafting a resolution in support of free speech to respond to F.I.R.E.’s rating and improve student freedoms.</p>\n<p>“Free speech is not a point of pride right now. It is a point of shame, and we should all be ashamed at how our university has completely ignored the perfectly legitimate concerns of a perfectly legitimate civil rights organization,” Garshfield said. “Making bigotry something that cannot be expressed does not make it go away… it makes it a black market good.”</p>\n<p>During the question portion of Garshfield’s presentation, Senator Jerel Constantino addressed the senate asking whether Garshfield was a member of the “White Student Union” Facebook group. Garshfield responded to the point saying, “I’m a Jew, but it’s good to know that suddenly I’m a white supremacist.”</p>\n<p>Brandon Morse, fourth-year political science major, said the election code of the student senate also contends with true freedom of speech. Morse described the current university policy as “a regulatory framework that violates the constitution.”</p>\n<p>“The freedom to speak is clear, it’s not up to interpretation. With that being said, the definition of what’s racist is up to interpretation as well,” Morse said. “I’ve been told that as a straight, white male I can not experience racism, but that does not mean on an individual level, you cannot be disparaged.”</p>\n<p>Morse urged the senate to consider Garshfield’s resolution.</p>\n<p>“I may not agree with anything or everything that one of you says but I will certainly fight to the death to protect your right to do so,” Morse said.</p>\n<p>In response to Morse, Senator Akshaya Natarajan suggested the current university policy exists to aid marginalized groups who may be educationally restricted by microaggressions and offensive speech.</p>\n<p>UCSB alumnus Derek Dimpfl said limiting speech is, in fact, extremely harmful to student growth and education.</p>\n<p>“I fear that our culture has forgotten, or chosen to forget in whole, or in part, how fortunate it is to have such protections … for what they protect us from is much more frightening than that which they expose us to,” Dimpfl said.</p>\n<p>On-Campus Senator Nawar Nemeh and College of Letters and Science Senator Stevan Abdalmalik both submitted their resignation letters to A.S. Senate earlier this week and presented brief parting messages after public forum.</p>\n<p>“Being at this table, you have an extreme amount of power. I don’t know how many of you know it, but you have the power to alleviate the struggles of human beings. That is an amazing power.” Nemeh said. “I please ask you to weigh every single vote before you make it, to weigh it seriously in your heads as to how it will affect every student on this campus and every community out there.”</p>\n<p>Nemeh said he was leaving due to personal reasons.</p>\n<p>“I’m resigning, mostly for personal reasons. I thought I owed you all I guess an explanation as to that I want to refocus on my academics, I want to refocus on research that I’ve been doing,” Nemeh said. “I have an internship that I have been neglecting at the U.S. State Department that I need to be putting more time and effort in and I really do want to look more after my family.”</p>\n<p>Abdalmalik did not disclose the reason of his resignation, but also had a brief parting in his letter of resignation, read during the public forum portion of senate.</p>\n<p>“In a final farewell, I leave you with this final task: Continue to uphold what’s best in our university, our student body and, most importantly, of yourselves,” Abdalmalik read from his resignation letter. “Hold yourselves to a higher standard, be inquisitive and, most importantly, be self-reflective and self-critical.”</p>\n<p>The resignations were passed in a Senate vote of 15-4-3.</p>\n<p>“A Bill to Restructure the A.S. Fellowship Program” and “A Bill to Amend Article VI of the Constitution &amp; By-Laws to Incorporate a Transfer Senator” were sent to campus affairs while “A Resolution to Ensure Continuity Within the STV Implementation Committee” was sent to immediate consideration and passed the same night.</p>\n<p>A version of this story appeared on page 5 of the Thursday, January 21, 2016 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-67544\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-67544\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-01-21/students-senate-discuss-free-speech-issues/","id":2555,"author":{"id":91,"name":"Supriya Yelimeli"},"related":[2554,2553,2552],"comments":[],"followers":[]},{"title":"D.R.E.A.M. To Aid Undocumented Students","category":"News","subcategory":"Campus","publish_date":"2016-02-04T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?resize=800%2C600&ssl=1","description":"The University of California is rolling out its D.R.E.A.M. Loan Program this academic year, providing an initial $5 million in federal aid to undocumented students across the UC system.","content":"<div class=\"single-post-content\">\n            <h2>The D.R.E.A.M. Loan Program, aimed at providing financial aid to undocumentated UC students, will begin distributing federal funding to students this academic year</h2>\n<div id=\"attachment_67900\" style=\"width: 810px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-67900\" data-attachment-id=\"67900\" data-permalink=\"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/dream_castategearupdotorg-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?fit=800%2C600&amp;ssl=1\" data-orig-size=\"800,600\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Dream Loan Act\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?fit=250%2C188&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?fit=800%2C600&amp;ssl=1\" class=\"wp-image-67900 size-full\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?resize=800%2C600\" alt=\"Photo Courtesy of CaliforniaStateGearUp.org\" width=\"800\" height=\"600\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?w=800&amp;ssl=1 800w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?resize=250%2C188&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2016/02/Dream_CAStateGearUPdotOrg-1.jpg?resize=768%2C576&amp;ssl=1 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-67900\" class=\"wp-caption-text\">The D.R.E.A.M. Loan Program will provide undocumented UC students with federal financial aid for the first time. <em>Photo Courtesy of CaliforniaStateGearUp.org</em></p></div>\n<p>The University of California is rolling out its D.R.E.A.M. Loan Program this academic year, providing an initial $5 million in federal aid to undocumented students across the UC system.</p>\n<p>The aid will be distributed to 3,000 undocumented students and will include more than approximately $350,000 to UCSB students. The money comes equally from the California state general fund, and UC funds and will be distributed to campuses based on need.</p>\n<p>Habiba Simjee, Undocumented Student Services Coordinator at UCSB and Undocumented Legal Services Counsel, said the program was a significant step toward addressing the financial struggles of undocumented students.</p>\n<p>“The D.R.E.A.M. Loan Program is an important step in addressing the significant funding gap for undocumented students who wish to pursue their education at UC schools,” Simjee said. “It’s been very challenging and heartbreaking to hear from students who have to withdraw or drop out because they’re unable to make ends meet, particularly when we consider the cost of living in Santa Barbara.”</p>\n<p>Michael Miller, director of the Office of Financial Aid and Scholarships at UCSB, said the goal of the program is to make education more affordable for undocumented students.</p>\n<p>“The goal of all financial aid funding is to ensure access and affordability for all UCSB students,” Miller said. “This loan program will be one more resource our D.R.E.A.M. Scholars have available to them, and, given the work and loan commitment all UCSB students assume while they are here, it is going to play a huge part in their ability to finance their education.”</p>\n<p>The D.R.E.A.M. Loan Program, proposed by UC President Janet Napolitano, was passed in 2014, but funding was not available for students until the current academic school year. Miller said the program helps level the playing field.</p>\n<p>“The creation of the D.R.E.A.M. Loan Program is a big step forward for D.R.E.A.M. Scholars across California, and it gets us closer to making sure they have the same resources available to them that other students have,” Miller said.</p>\n<p>Miller also made it clear that the University can do more for undocumented students.</p>\n<p>“I am very proud of our campus, because our student leaders pushed for this program and their hard work paid off,” Miller said. “This program is a step in the right direction, but we still have a lot of work to do.”</p>\n<p>Claire Doan, a spokesperson for the UC Office of the President, said the program will help ease the financial burdens facing the undocumented student community.</p>\n<p>“The overall goal of the D.R.E.A.M. Loan Program is to help undocumented students who have limited financial options afford a UC education,” Doan said. “It helps alleviate the burden for undocumented UCSB students, many of whom are often forced to take semesters off or take outside jobs to offset the cost of tuition.”</p>\n<p>According to Miller, the average UCSB student graduates with about $21,000 in student loan debt.</p>\n<p>“Student loans are widely used by students to pay for education-related expense like tuition and fees, room and board and books and supplies,” Miller said. “The D.R.E.A.M. Loan program will help eligible students meet these expenses.”</p>\n<p>Under current laws, undocumented students who graduate from high schools in California can apply for state and university aid, but their status as undocumented students prevents them from obtaining federal aid.</p>\n<p>Ricardo Leon, second-year computer engineering major, said he expects the D.R.E.A.M. Loan Program will help offset the lack of federal funding.</p>\n<p>“The program will help [undocumented students] because they’re not eligible for federal aid, so they don’t get the Cal Grant, and they also can’t get loans through the federal government,” Leon said. “Having the government give them some loan money would be really helpful.”</p>\n<p>Leon said the program would help undocumented students focus more on their education and less on their finances.</p>\n<p>“A lot of undocumented students have to get jobs in order to get that extra funding and make ends meet,” Leon said. “I think a loan would help them focus more on their studies.”</p>\n<p>A version of this story appeared on p. 5 of the Thursday, February 4, 2016 edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-67924\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-67924\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2016-02-04/d-r-e-a-m-to-aid-undocumented-students/","id":2554,"author":{"id":114,"name":"Hubert Zhang"},"related":[2553,2552,2551],"comments":[],"followers":[]}]},"__N_SSG":true}