{"pageProps":{"article":{"title":"A.S. Finance and Business Committee Delegates Funds to Student Groups","category":"News","subcategory":"Campus","publish_date":"2015-01-07T08:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"The Associated Students Finance and Business Committee met in the State Street room in UCen last night to delegate funds to various student organizations at their first weekly meeting of winter quarte...","content":"<div class=\"single-post-content\">\n            <p>The Associated Students Finance and Business Committee met in the State Street room in UCen last night to delegate funds to various student organizations at their first weekly meeting of winter quarter. </p>\n<p>The Finance and Business Committee is the financial arm of the A.S. Senate and meets weekly on Mondays to allocate funding to various student groups and other university affiliated projects. At the meeting, the board addressed finance requests and funded GIVE to Isla Vista, the Muslim Student Association, Model United Nations (MUN) and Unión Salvadoreña de Estudiantes Universitarios (USEU) among others. </p>\n<p>South Asian student group UCSB Indus requested $2,280 to fund a cultural dance and a cappella concert in mid-February as part of campus-wide cultural awareness week and was granted $1,880 of the request. </p>\n<p>The International Student Association also requested $1,564 to fund their “Welcome Back” concert in the Hub this Friday evening and was granted the full amount.</p>\n<p>GIVE to Isla Vista is an event held at the end of each academic year where donated student items from students moving out of I.V. in June are sold to the general public in a fundraising event for which the organization gives volunteers to staff the event. The event last year drew over 50 tons of merchandise and provided money to over a dozen student organizations. Of the requested $11,085, the board agreed to fund the group $8,766 to cover costs for a site coordinator, a volunteer coordinator, site clothing and a truck driver.</p>\n<p>The Muslim Student Association requested $1,062 for tickets and transportation to attend the 2015 MSA West Conference in mid-January, where MSA chapters from California, Arizona and Nevada will meet for three days to discuss relevant issues related to Muslim identity and collective history. The board passed a motion to fully fund the requested amount and to withdraw $230 in money previously allocated to the group last November.</p>\n<p>MUN requested a total of $25,294 for their upcoming events in spring quarter. The board decided to move $517 from the Office of Student Life spring account into an account for Academic teams, and to allocate $5,000 towards hotel fees for MUN. </p>\n<p>Unión Salvadoreña de Estudiantes Universitarios (USEU), an organization representing the Salvadoran student community, is holding a two-day annual summit that will include workshops and team building activities for groups from chapters at other campuses. The group requested a total of $1,022 of which $946 was allocated to be spent on muffins, orange juice, coffee, water and other assorted foods and utensils. </p>\n<p>According to fourth-year economics and accounting major Angela Lau, 50 percent of the foods purchased can be from Costco, but the other 50 percent need to be purchased from local or organic sources. </p>\n<p>“That’s what you all are supposed to tell them during the finance and business workshops,” Lau said. “You say, ‘You still have to use organic foods,’ and they’ll say, ‘Oh, we’re getting our food from Costco, what about them?’ You still have to have 50 percent of it be USDA organic, local.” </p>\n<p>Lau said that although the Isla Vista Food Co-op is an option for students to buy organic food, it is not necessary to purchase food there. </p>\n<p>“It doesn’t have to be from the Co-op,” Lau said. “The Co-op is automatically local and organic, but you can get it from Costco and have it be organic.” </p>\n<p>The Board also passed a motion to fully fund USEU as a one-time exception for the food costs and plan to emphasize spending restrictions in future finance and business workshops. </p>\n<p>Other fully funded groups include the professional business fraternity Delta Sigma Pi; the Ecology, Evolution, and Marine Biology department for their 11th-annual Graduate Student Symposium; the Indus organization for their cultural show; and the International Student Association for their welcome back concert this Friday. Recreational computer hacking group SB Hacks also requested $2,000 to help fund an upcoming “hackathon” that promises to draw some 500-600 participants, the motion to fund was tabled indefinitely.<br>\n</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-59434\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-01-07/a-s-finance-and-business-committee-delegates-funds-to-student-groups/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-59434\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-01-07/a-s-finance-and-business-committee-delegates-funds-to-student-groups/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-01-07/a-s-finance-and-business-committee-delegates-funds-to-student-groups/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-01-07/a-s-finance-and-business-committee-delegates-funds-to-student-groups/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-01-07/a-s-finance-and-business-committee-delegates-funds-to-student-groups/","id":2590,"author":{"id":161,"name":"Cheryl Sun"},"related":[2589,2588,2587],"comments":[],"followers":[]},"author":{"id":161,"name":"Cheryl Sun","biography":"Not available","articles":[2342,2590,2757,2768,2776,2777,2834,2853,2878,3455,4655,4700,4749,4785],"portrait":"Not available"},"related":[{"title":"Transgender Day of Remembrance Commemorates Lives Lost to Violence","category":"News","subcategory":"Campus","publish_date":"2015-11-23T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Trans_Courtesy-of-Facebook-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Trans_Courtesy-of-Facebook-1.jpg?resize=800%2C647&ssl=1","description":"La Familia de Colores hosted their annual “Transgender Day of Remembrance” event on Friday to commemorate the group’s co-founder, former UCSB student and transgender Latina activist Zoraida Reye...","content":"<div class=\"single-post-content\">\n            <p>La Familia de Colores hosted their annual “Transgender Day of Remembrance” event on Friday to commemorate the group’s co-founder, former UCSB student and transgender Latina activist Zoraida Reyes, and transgender individuals who have lost their lives in the past year.</p>\n<p>Reyes, who died as the victim of a hate crime in June of 2014, helped create La Familia de Colores to provide a safe space at UCSB  for Latin@s, people of color and their allies in the LGTBQ community. During the Day of Remembrance, an altar was dedicated to victims of deadly hate crimes and La Familia de Colores members read the names of all documented trans-identified persons killed since last year’s day of remembrance.</p>\n<p>Fourth-year Chican@ studies and black studies double major and La Familia de Colores Organizer Abigail Salazar said Reyes was being honored for fighting for justice and equality in the transgender community.</p>\n<p>“We have a space that queer trans Latino folks can exist in within this very violent institution we are in,” Salazar said. “But we still honor all the other trans women and trans women of color who have passed away due to state violence or other forms of violence.”</p>\n<p>Salazar said she hopes people understand the “urgency” of the situation.</p>\n<p>“There’s no coincidence that there’s such a long list of … trans women of color murders,” Salazar said. “We have to be conscious of that and learn how to be allies in order to really help our trans brothers and sisters to create change.”</p>\n<p>According to La Familia de Colores member and fourth-year black studies and feminist studies double major Ernie Piña, there are dozens of transgender deaths that go unreported each year.</p>\n<p>“This past year, I worked in conjunction with organizing on behalf of Jesse Hernandez … while I continued and continued to look for research on Jesse Hernandez, there was nothing that was reported,” Piña said. “There’s all these trans folks that are passing, but they’re not shown or given the opportunity to visibility that other people would have.”</p>\n<p>Fourth-year comparative literature and global studies double major Kasey Rubio said the event should be more of a priority to the whole community.</p>\n<p>“Many women have been taken from us; I think everyone should be here to pay their respect,” Rubio said. “These are our fallen trans brothers and sisters. A lot of them we’ll never even know because most of them don’t get documented.”</p>\n<p>According to third-year Chican@ studies and sociology double major and La Familia de Colores Board Member Emmanuel Suarez-Jimenez, society continues to struggle with the changing norms and perceptions surrounding sexual identities and lifestyles.</p>\n<p>“We live in a really transphobic society that really doesn’t know how to deal with new ideas, new concepts, new theories of how people want to live their way,” Suarez-Jimenez said. “I think that’s one thing we all need to really understand, is that we all have our own identities, we all pick them.”</p>\n<p>Piña said problems with sexual and gender identities persist because people cannot accept differences.</p>\n<p>“Our society in general doesn’t accept trans bodies because they’re deviant from the norm. In terms of trans bodies, in terms of what gender is — is just seen as abstract or weird,” Piña said. “That’s where hate comes from, that’s where a lot of what drives them from being is that people don’t understand.”</p>\n<p>Piña said many people do not comprehend the physical transitions of many transgender people.</p>\n<p>“Folks don’t understand — imagine living in this body or this existence where you don’t feel comfortable with the way you express your gender or you don’t feel comfortable in the way you are,” Piña said. “That’s what trans folks do; they make themselves so they can feel comfortable in their bodies.”</p>\n<p>Suarez-Jimenez said individual activists have been instrumental in challenging societal norms, such as Marsha P. Johnson who is credited for being one of the first people to incite the Stonewall riots of 1969 in New York.</p>\n<p>“She’s a trans woman of color who threw the first stone, who started that police riot,” Suarez-Jimenez said. “She’s who finally started that momentum rolling on the fact that we really need to acknowledge that there are different identities and we need to accept them and we need to challenge ourselves to be more accepting.”</p>\n<p>Rubio said the Transgender Day of Remembrance provided an atmosphere to honor lost lives and focus on preventing future tragedies.</p>\n<p>“This type of event is just a beautiful space to grieve and to mourn, but also to reflect and look to the future and think about what we want to change and how we’re going to do that, so that we don’t have to continuously be holding these spaces for those that have been murdered,” Rubio said.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66714\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/transgender-day-of-remembrance-commemorates-lives-lost-to-violence/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66714\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/transgender-day-of-remembrance-commemorates-lives-lost-to-violence/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/transgender-day-of-remembrance-commemorates-lives-lost-to-violence/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/transgender-day-of-remembrance-commemorates-lives-lost-to-violence/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-23/transgender-day-of-remembrance-commemorates-lives-lost-to-violence/","id":2588,"author":{"id":125,"name":"Dahyana Barraza"},"related":[2587,2586,2585],"comments":[],"followers":[]},{"title":"Dennis Ross Speaks on Middle Eastern Relations, New Book","category":"News","subcategory":"Campus","publish_date":"2015-11-23T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?resize=980%2C647&ssl=1","description":"American diplomat and author Dennis Ross lectured on his new book, Doomed to Succeed, Friday at Campbell Hall, and spoke about relations between the United States and Israel from the administrations o...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66722\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1794658576\" data-slb-internal=\"0\" data-slb-group=\"66726\"><img aria-describedby=\"caption-attachment-66722\" data-attachment-id=\"66722\" data-permalink=\"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/ambassador-ross_effie-sklavenitis-1/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?fit=2560%2C1707&amp;ssl=1\" data-orig-size=\"2560,1707\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"7.1\",\"credit\":\"\",\"camera\":\"NIKON D5300\",\"caption\":\"\",\"created_timestamp\":\"1447990051\",\"copyright\":\"\",\"focal_length\":\"170\",\"iso\":\"800\",\"shutter_speed\":\"0.0125\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Ambassador Ross_Effie Sklavenitis-1\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?fit=888%2C592&amp;ssl=1\" class=\"wp-image-66722 size-large\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1-1024x683.jpg?resize=888%2C592\" alt=\"Effie Sklavenitis/Daily Nexus\" width=\"888\" height=\"592\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Ambassador-Ross_Effie-Sklavenitis-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66722\" class=\"wp-caption-text\">Effie Sklavenitis/Daily Nexus</p></div>\n<p><span style=\"font-weight: 400;\">American diplomat and author Ambassador Dennis Ross lectured on his new book, </span><i><span style=\"font-weight: 400;\">Doomed to Succeed: <em>The U.S.—Israel Relationship from Truman to Obama</em></span></i><span style=\"font-weight: 400;\">,</span> <span style=\"font-weight: 400;\">Friday at Campbell Hall, and spoke about relations between the United States and Israel from the administrations of former President Harry S. Truman through president Barack Obama.</span></p>\n<p><span style=\"font-weight: 400;\">Ross has been involved with issues concerning the Middle East for more than 20 years, and his extensive experience gives him the ability to share a unique experience. </span><span style=\"font-weight: 400;\">Throughout his career, Ross has served as special assistant to President Barack Obama, special adviser to Secretary of State Hillary Clinton, </span><span style=\"font-weight: 400;\">special Middle East coordinator under President Bill Clinton, director of the State Department’s Policy Planning Staff in the George H.W. Bush administration and more. Ross helped form U.S. policy toward the former Soviet Union, played a prominent role in the unification of Germany and its integration into NATO, facilitated arms control negotiations, helped to form the 1991 Gulf War coalition and assisted Israelis and Palestinians in reaching the 1995 Interim Agreement.</span></p>\n<p><span style=\"font-weight: 400;\">Ross engaged Friday’s audience through an interactive question and answer session where he would ask the audience questions and analyze their responses. After asking the audience which presidential administration had the most tumultuous relationship with Israel, Ross said it was former President Dwight D. Eisenhower who was “the toughest on Israel.”</span></p>\n<p><span style=\"font-weight: 400;\">Ross said there are three reasons why the United States sees Israel as “a problem and not a partner.”</span></p>\n<p><span style=\"font-weight: 400;\">“The first assumption is that if we distance from Israel we will gain with the Arabs,” Ross said. “The second is that if we cooperate with Israel, we lose with the Arabs. The third is if we want to transform the American position in the Middle East, we need to solve the Palestinian issue first.”</span></p>\n<p><span style=\"font-weight: 400;\">Ross then refuted each assumption using historical events as evidence. According to Ross, all three reasons are flawed, and the U.S. cannot distance itself from Israel because it is one of the few countries “we fundamentally share values with.”</span></p>\n<p><span style=\"font-weight: 400;\">Ross also shared his views on the Islamic State in Levant (ISIL), and the group’s recent act of terror in Paris that left more than a hundred dead. Ross referred to the terrorist group as the Islamic State in Iraq and Syria (ISIS).</span></p>\n<p><span style=\"font-weight: 400;\">“The first thing we should be doing is asking how did this kind of attack take place?” Ross said. “Number two, what do we have to do to disrupt ISIS … to be geared towards thinking through how another operation is going to work through that. The third thing is we really do have to have a coherent strategy for Syria. Also finding a way to make Russia change its approach or, at a minimum, to go after ISIS.”</span></p>\n<p><span style=\"font-weight: 400;\">Third-year psychology and sociology double major Nina Abramson said she enjoyed hearing from a political figure that has been involved in Middle East diplomacy.</span></p>\n<p><span style=\"font-weight: 400;\">“I feel that the public hears about ISIS and the President’s plans with Israel through media so it was cool to get a perspective from a diplomat and hear what the different presidents felt toward Israel,” Abramson said.</span></p>\n<p><span style=\"font-weight: 400;\">Second-year psychology major Mia Feller said she liked that Ross asked the audience questions.</span></p>\n<p><span style=\"font-weight: 400;\">“I think it was a cool format of how he was asking people questions,” Feller said. “It kind of allowed for audience participation. I thought it was really good — a lot of information to grasp, but it was good.”</span></p>\n<p><span style=\"font-weight: 400;\">UCSB professor of religious studies Gil Ramot said he was impressed with Ambassador Ross’s “knowledge of detail.”</span></p>\n<p><span style=\"font-weight: 400;\">“The intimate conversations and details that he knew about the administration really impressed me,” Ramot said. “His vast knowledge about what happened between specific people and people who were in some of the most secret rooms in the government impressed me.”</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66726\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66726\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-23/dennis-ross-speaks-on-middle-eastern-relations-new-book/","id":2589,"author":{"id":136,"name":"Jessica Aguilar"},"related":[2588,2587,2586],"comments":[],"followers":[]},{"title":"UCSB Minority Associations Host Discussion on Nationwide Racial Tensions","category":"News","subcategory":"Campus","publish_date":"2015-11-22T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?resize=980%2C647&ssl=1","description":"The Latino/a UCSB Network Association and the Asian Pacific Islander Alliance hosted “Calling In: Cultivating Racial Consciousness & Inclusivity” on Thursday, where panelists discussed racial tens...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66696\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1704995783\" data-slb-internal=\"0\" data-slb-group=\"66709\"><img aria-describedby=\"caption-attachment-66696\" data-attachment-id=\"66696\" data-permalink=\"https://dailynexus.com/2015-11-20/regents-form-group-to-protect-students-from-intolerance/intolerance_by-vivian-bui-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?fit=2000%2C1325&amp;ssl=1\" data-orig-size=\"2000,1325\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1447935583\",\"copyright\":\"\",\"focal_length\":\"24\",\"iso\":\"4000\",\"shutter_speed\":\"0.0125\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Consciousness/Calling In\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?fit=888%2C588&amp;ssl=1\" class=\"wp-image-66696 size-large\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1-1024x678.jpg?resize=888%2C588\" alt=\"Vivian Bui/Daily Nexus\" width=\"888\" height=\"588\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?resize=1024%2C678&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?resize=250%2C166&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?resize=500%2C330&amp;ssl=1 500w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66696\" class=\"wp-caption-text\">Vivian Bui/Daily Nexus</p></div>\n<p>The Latino/a UCSB Network Association and the Asian Pacific Islander Alliance hosted “Calling In: Cultivating Racial Consciousness &amp; Inclusivity” on Thursday, where panelists discussed racial tensions on university campuses across the country.</p>\n<p>Recent racially charged incidents — such as those at University of Missouri, Yale, UCLA, University of Michigan, University of Oklahoma and Harvard University – are raising the question of how UCSB staff and faculty can better serve as allies to students of color. Four panelists at the event, Lisa Slavid, Diane Fujino, Aaron Jones and Ralph Armbruster-Sandoval, spoke about why U.S. campuses are experiencing racial tensions, how racial consciousness manifests itself on college campuses, how to speak on race in a classroom and freedom of speech.</p>\n<p>Professor of Asian American studies Diane Fujino said while the Civil Rights Movement eliminated formal discrimination, it was “insufficient” at combatting all race issues.</p>\n<p>“Racism has changed,” Fujino said. “The work in the ’50s was to legitimate that racism existed and it was wrong, but today, there is more knowledge that racism is wrong, and the work today is really to prove that it still exists.”</p>\n<p>Graduate Student Association President Aaron Jones said racism is still present in everyday society.</p>\n<p>“It is in all things,” Jones said. “If you’re a fish in water, you can’t see the water, doesn’t mean you’re not in the water. We’re living in it, we’re breathing in it. It’s in our society, so of course, it’s going to be manifested on a college campus.”</p>\n<p>Coordinator of organizational and performance management for Housing and Residential Services at UCSB Lisa Slavid said she is not surprised to see racial consciousness manifest on college campuses.</p>\n<p>“Really, where else in the country would they manifest?” Slavid asked. “Colleges are part of the institutions of the country, and these conversations need to happen. They won’t be happening in the companies or corporations of Google or Facebook or J.C. Penny, they will be emerging here.”</p>\n<p>Jones said college campuses should be safe, educational spaces for discussing racial issues.</p>\n<p>“We’re supposed to be able to engage in these kinds of dialogues. If we can’t have those types of dialogues and conversations in a university, then we’re in really bad shape,” Jones said.</p>\n<p>Associate professor of Chican@ studies Ralph Armbruster-Sandoval said such conversations should not be limited to certain majors.</p>\n<p>“Even in Chicano studies, we feel like we need to talk about Black Lives Matter,” Armbruster-Sandoval said. “We don’t think that this is something that should be in one department, in one discipline. We need to talk about Black Lives Matter in our own department, in our own community.”</p>\n<p>Armbruster-Sandoval said people need to discuss their different views and opinions to begin a dialogue.</p>\n<p>“A lot of people have a problem with the name ‘Black Lives Matter,’ and that’s okay, but we need to talk about this,” Armbruster-Sandoval said. “How are we going to work this through otherwise? It’s not easy to have a conversation about these things — it’s a very difficult thing to walk through, but I don’t think it was fair for people not to talk about it.”</p>\n<div id=\"attachment_66697\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg\" data-slb-active=\"1\" data-slb-asset=\"251323568\" data-slb-internal=\"0\" data-slb-group=\"66709\"><img aria-describedby=\"caption-attachment-66697\" data-attachment-id=\"66697\" data-permalink=\"https://dailynexus.com/2015-11-20/regents-form-group-to-protect-students-from-intolerance/intolerance_by-vivian-bui-2/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?fit=2000%2C1325&amp;ssl=1\" data-orig-size=\"2000,1325\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1447936053\",\"copyright\":\"\",\"focal_length\":\"24\",\"iso\":\"1800\",\"shutter_speed\":\"0.0125\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Consciousness/Calling In\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?fit=888%2C588&amp;ssl=1\" class=\"wp-image-66697 size-large\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2-1024x678.jpg?resize=888%2C588\" alt=\"Vivian Bui/Daily Nexus\" width=\"888\" height=\"588\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?resize=1024%2C678&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?resize=250%2C166&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?resize=500%2C330&amp;ssl=1 500w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Intolerance_by-Vivian-Bui-2.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66697\" class=\"wp-caption-text\">Vivian Bui/Daily Nexus</p></div>\n<p>Slavid said conversations about racial issues may be difficult because of fear.</p>\n<p>“There’s a silence, and it’s mostly because people are afraid,” Slavid said. “They’re afraid to say the wrong thing.”</p>\n<p>Fujino said these conversations can be difficult to approach in a class setting, but faculty and staff must work to appropriately address the issues.</p>\n<p>“For professors, it’s trial and error and if we’re dedicated, we talk to colleagues to figure it out,” Fujino said. “There is increasing attention to issues of what they call ‘diversity,’ that means it’s built instructionally. The faculty need to create a space in classrooms so that people can speak, and I also think what it takes is to evaluate and listen to each other.”</p>\n<p>According to Slavid, faculty and staff can be allies at UCSB by trusting and listening to students’ perspectives.</p>\n<p>“As a white ally, recognize that people of color’s lived experiences are different than yours,” Slavid said. “Show up, listen to learn, but also know when to speak as an ally, even if it makes you nervous, because our silence on topics of racial injustice is part of the issue.”</p>\n<p>Associate Director of LGBT Services in the Resource Center for Sexual &amp; Gender Diversity Klint Jaramillo said he knows students with questions about racial issues want to have conversations.</p>\n<p>“Hopefully we can move forward and make spaces like this for faculty and staff so we can not only support each other, but support our students,” Jaramillo said.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66709\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-22/ucsb-minority-associations-host-discussion-on-nationwide-racial-tensions/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66709\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-22/ucsb-minority-associations-host-discussion-on-nationwide-racial-tensions/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-22/ucsb-minority-associations-host-discussion-on-nationwide-racial-tensions/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-22/ucsb-minority-associations-host-discussion-on-nationwide-racial-tensions/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-22/ucsb-minority-associations-host-discussion-on-nationwide-racial-tensions/","id":2587,"author":{"id":125,"name":"Dahyana Barraza"},"related":[2586,2585,2584],"comments":[],"followers":[]}]},"__N_SSG":true}