{"pageProps":{"article":{"title":"UCSB To Establish Chapter of Students for Sensible Drug Policy","category":"News","subcategory":"Campus","publish_date":"2015-11-05T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=980%2C647&ssl=1","description":"Students Cole Garcia and Ashcon Minoiefar are in the process of establishing a UCSB chapter of Students for Sensible Drug Policy (SSDP), an international organization advocating an end to the “war o...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66160\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"45091812\" data-slb-internal=\"0\" data-slb-group=\"66175\"><img aria-describedby=\"caption-attachment-66160\" data-attachment-id=\"66160\" data-permalink=\"https://dailynexus.com/2015-11-05/66175/ssdp_lorenzo-basilio-1/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=2000%2C1335&amp;ssl=1\" data-orig-size=\"2000,1335\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"\",\"camera\":\"NIKON D750\",\"caption\":\"\",\"created_timestamp\":\"1445898302\",\"copyright\":\"\",\"focal_length\":\"200\",\"iso\":\"2000\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"SSDP\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=888%2C593&amp;ssl=1\" class=\"wp-image-66160\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1-1024x684.jpg?resize=750%2C501\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"750\" height=\"501\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66160\" class=\"wp-caption-text\"><em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Students Cole Garcia and Ashcon Minoiefar are in the process of establishing a UCSB chapter of Students for Sensible Drug Policy (SSDP), an international organization advocating an end to the “war on drugs” approach to substance control.</p>\n<p>Garcia, a second-year biology major, and Minoiefar, a third-year history of public policy major, aim to educate students on the war on drugs, explore alternative approaches and promote smart decisions regarding drug use. A group of students at the University of Massachusetts Amherst led by Shea Gunther founded SSDP in 1998, and the organization has grown to include thousands of members from hundreds of campuses worldwide.</p>\n<p>UCSB’s SSDP chapter is currently going through the campus organization registration process with the Office of Student life and seeking a faculty advisor, but has already been active on campus and has a club constitution. For a chapter to be officially recognized by the organization, it must have at least three students and actively organize on campus.</p>\n<p>Pacific outreach coordinator for SSDP Frances Fu said she can help connect SSDP efforts across campuses.</p>\n<p>“For example, the UC Davis chapter is currently spearheading a Good Samaritan policy at their school and would like to make it a statewide effort,” Fu said in an email. “Part of my job is facilitating those relationships and partnerships.”</p>\n<p>Garcia said he hopes to help install a local Good Samaritan policy, which would grant legal immunity to someone who calls the police or medical personnel for an injured person.</p>\n<p>“A lot of times a person’s friends or peers are scared of law enforcement and the repercussions that would come with calling an ambulance and getting the authorities involved,” Garcia said. “We’d like to make it easier for people who need help with drugs and alcohol to seek help for something like an overdose.”</p>\n<p>Garcia said he hopes to convey to students the many effects of national and local drug policy.</p>\n<p>“I’d like for SSDP to educate students on how drug policy is related to a variety of other social issues, like unemployment and the economy, education, health care and racial injustice,” Garcia said. “If students understand how reforming drug policy will improve society in these other areas, then they will understand how necessary drug policy reform actually is.”</p>\n<p>To publicize the new chapter, members have been tabling and handing out information around campus. Garcia plans to eventually hold documentary screenings and invite guest speakers to campus to discuss drug policy.</p>\n<p>First-year political science major Catherine Lee says that SSDP will be a good addition to UCSB’s campus organizations because many students do not understand the implications of drug policy and the effects of drug use.</p>\n<p>“It sounds similar to what we learned in AlcoholEdu online over the summer, but I think this program will be more successful in communicating messages to students if they do everything in person through things like guest speakers and events,” Lee said. “Unfortunately, I don’t think most students registered most of the information presented to them online in AlcoholEdu.”</p>\n<p>Minoiefar said he decided to create the UCSB chapter of SSDP because he felt not having a local Good Samaritan policy discourages students from aiding others in in dangerous situations to avoid legal repercussions.</p>\n<p>Like Garcia, Minoiefar said he would like to change local policy to encourage students to intervene in potentially dangerous situations.</p>\n<p>“A big thing the chapter can do is push a policy like the Good Samaritan policy at the university,” Minoiefar said. “The school can put in its policy that if you get help for someone in need … and if it is decided that a person did it in good faith, they won’t be in trouble.”</p>\n<p>As the new chapter of SSDP grows at UCSB, Minoiefar said he hopes to amass a big enough following to continue running the program once both co-founders graduate.</p>\n<p>“These types of initiatives, like the Good Samaritan policy, tend to die out when a student like me leaves because then all the information and things I’ve learned leave with me,” Minoiefar said. “By building this chapter, we hope to be able to create new student leaders who can continue this.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66175\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66175\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-05/66175/","id":2637,"author":{"id":140,"name":"Olivia Pla"},"related":[2636,2635,2634],"comments":[],"followers":[]},"author":{"id":140,"name":"Olivia Pla","biography":"Not available","articles":[2602,2620,2637],"portrait":"Not available"},"related":[{"title":"UCSB Alcohol and Drug Program To Host Conference To De-stigmatize Alcohol and Drug Recovery","category":"News","subcategory":"Campus","publish_date":"2015-11-05T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/header_aod2013.jpg?resize=355%2C105&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/header_aod2013.jpg?resize=377%2C105&ssl=1","description":"The UCSB Alcohol and Drug Program will host the California Unified Collegiate Recovery Program Nov. 7 and 8 in Corwin Pavilion to de-stigmatize alcohol and drug addictions and educate UCSB and SBCC st...","content":"<div class=\"single-post-content\">\n            <p>The UCSB Alcohol and Drug Program will host the California Unified Collegiate Recovery Program Nov. 7 and 8 in Corwin Pavilion to de-stigmatize alcohol and drug addictions and educate UCSB and SBCC students about resources for recovery.</p>\n<p>The conference will host keynote speakers American Buddhist teacher and personal wellness believer Noah Levine, President and CEO of Young People in Recovery Justin Luke Riley and UC Riverside collegiate recovery program advisor Audrey Pusey. Each speaker will present an individual topic about the struggles and successes relating to recovery. Sponsors will offer resources and information to students, with organizers anticipating attendees from across the UC and out of state.</p>\n<p>UCSB Alcohol and Drug Program counselor and recovery specialist Angie Bryan said the conference can help break down preconceptions about the recovery process while creating a community for recovering students.</p>\n<p>“One goal is to bring students together in recovery just for fellowship and mutual support,” Bryan said. “We’re trying to promote awareness about being in recovery, and that people in recovery are assets to a college community … to reduce the stigma about being in recovery in college.”</p>\n<p>Bryan said the recovery movement began at UCSB four years ago with the assistance of UC Riverside and has grown into a UC-wide program for addiction recovery.</p>\n<p>“I think initially the goal was to help start the movement in California,” Bryan said. “Four years ago, we were just starting our program here and Riverside had a student group, but there wasn’t else much happening in our state. Now we have collegiate recovery programs at most of the UCs.”</p>\n<p>Second-year psychology major and recovery intern for Gauchos for Recovery Adam Daar said UC Riverside supports UCSB in hosting the event.</p>\n<p>“UC Riverside wanted to keep it student led, and I think that people liked the idea of bringing it to Santa Barbara because they saw that we had a strong collegiate recovery program community already,” Daar said. “We are really happy to be able to do this.”</p>\n<p>According to fourth-year global studies major and recovery intern for Gauchos for Recovery Emily Bills, recovery programs have been growing rapidly in recent years and UCSB has one of the best programs to host the conference.</p>\n<p>“There are only so many recovery programs in California that are able to host. We have a huge support from the Alcohol and Drug Program that no other schools really have,” Bills said.</p>\n<p>According to Director of UCSB Alcohol and Drug Program Jackie Kurta, the process of recovery will be destigmatized throughout the conference. Kurta said she hopes this will lead to more acknowledgement and support for recovering students.</p>\n<p>“I think there are assumptions made about how college students lead their lives,” Kurta said. “There’s stigma about people being in recovery or students who were struggling and not yet able to make a choice that is working well for them. I think our community needs to be more sensitive to being helpful and supportive and not being judging and off-putting in that way.”</p>\n<p>Kurta said the conference will also showcase UCSB’s efforts to improve the lives of students dealing with addiction and recovery.</p>\n<p>“We all saw it as a terrific opportunity to bring attention to the work that is being done and to applaud the efforts of the program and to bring some recognition to our campus, because people don’t always think of UCSB and sober living,” Kurta said. “It was an opportunity to say we have a thriving program, we have a very diverse community and our community can include students in recovery.”</p>\n<p>Daar said he hopes the conference can help unify colleges and create diverse alcohol and drug programs at different universities.</p>\n<p>“I think something the conference can do is [help] other schools with their recovery program and learn about our own and cultivate a space of learning … and expand the national recovery movement, especially on college campuses,” Daar said.</p>\n<p>Daar said all students and UCSB staff are welcome to attend the conference and can volunteer for the event to learn about recovery.</p>\n<p>“They can reach out to us and sign up for volunteer shifts,” Daar said. “They get free admission and are welcome to help out and attend the entire conference — they get all the information that is really guided for students.”</p>\n<p>Daar said if students are struggling with an addiction they should seek help and know that recovery teams are there for support.</p>\n<p>“Try really hard to not be afraid to ask for help. Know that no one in this recovery community is going to judge you for asking for help,” Daar said. “They can come to us to ask for help and they will be welcomed with open arms. I want them to know that.”</p>\n<p>Bryan said the resources offered at the conference can be of help to anyone affected by addiction.</p>\n<p>“I just want to emphasize that everybody is touched by addiction in some way, whether it’s personally or [through] a friend or family member,” Bryan said. “I think that anyone could get something out of the conference.”</p>\n<p>The Alcohol and Drug Program offers weekly meetings open to all community members and hosts quarterly events. Services are primarily free to all students, including resources for being an ally in recovery.</p>\n<p>For more information about the conference and registration, visit <em>alcohol.sa.ucsb.edu</em>.</p>\n<div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66169\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/ucsb-alcohol-and-drug-program-to-host-conference-to-de-stigmatize-alcohol-and-drug-recovery/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66169\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/ucsb-alcohol-and-drug-program-to-host-conference-to-de-stigmatize-alcohol-and-drug-recovery/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/ucsb-alcohol-and-drug-program-to-host-conference-to-de-stigmatize-alcohol-and-drug-recovery/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/ucsb-alcohol-and-drug-program-to-host-conference-to-de-stigmatize-alcohol-and-drug-recovery/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-05/ucsb-alcohol-and-drug-program-to-host-conference-to-de-stigmatize-alcohol-and-drug-recovery/","id":2636,"author":{"id":84,"name":"Maura Fox"},"related":[2635,2634,2633],"comments":[],"followers":[]},{"title":"Aizzah Fatima To Perform Her Play ‘Dirty Paki Lingerie’","category":"News","subcategory":"Campus","publish_date":"2015-11-05T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?resize=980%2C647&ssl=1","description":"Actress, writer and producer Aizzah Fatima will perform her one-woman play, titled “Dirty Paki Lingerie,” describing the post-9/11 lives of six Pakistani-American Muslim women Friday at 8 p.m. at ...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66156\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"858181825\" data-slb-internal=\"0\" data-slb-group=\"66168\"><img aria-describedby=\"caption-attachment-66156\" data-attachment-id=\"66156\" data-permalink=\"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/lingerie_courtesy-of-wlrn-org-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?fit=2000%2C1338&amp;ssl=1\" data-orig-size=\"2000,1338\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5.3\",\"credit\":\"\",\"camera\":\"NIKON D3000\",\"caption\":\"\",\"created_timestamp\":\"1311868133\",\"copyright\":\"\",\"focal_length\":\"45\",\"iso\":\"800\",\"shutter_speed\":\"0.05\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Lingerie_Courtesy of wlrn org-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?fit=888%2C594&amp;ssl=1\" class=\"wp-image-66156\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1-1024x685.jpg?resize=750%2C502\" alt=\"Courtesy of wlrn.org\" width=\"750\" height=\"502\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?resize=1024%2C685&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Lingerie_Courtesy-of-wlrn-org-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66156\" class=\"wp-caption-text\"><em>Courtesy of wlrn.org</em></p></div>\n<p>Actress, writer and producer Aizzah Fatima will perform her one-woman play, titled “Dirty Paki Lingerie,” describing the post-9/11 lives of six Pakistani-American Muslim women Friday at 8 p.m. at the MCC Theater.</p>\n<p>Fatima’s play intertwines sex, politics and religion as the six women discuss their lives during a heavily Islamophobic time in America while drying their lingerie. The play aims to dispel stereotypes of Muslim culture and women.</p>\n<p>MCC Programmer Sepideah Mohsenian-Rahman said the event represents ideals the MCC aims to promote.</p>\n<p>“This play was really hot — up and coming,” Mohsenian-Rahman said. “It fit within the narrative and algorithm that the MCC uses, that intersection of diversity, relativity and being current.”</p>\n<p>Mohsenian-Rahman said the purpose of the show is to educate UCSB students about the often negatively portrayed culture of Pakistani women.</p>\n<p>“There is such a heightened sense of Islamophobia and aggression towards anyone in proximity to that faith in this country that I think anything that you can utilize to cut down at that kind of aggression is beneficial,” Mohsenian-Rahman said. “I think that a play like this might hit the mark for some in breaking down those barriers, and perhaps not for others.”</p>\n<p>Muslim Student Association (MSA) member and third-year CCS literature major Heeba Kaleem said because Fatima is Muslim, her performance will offer an accurate perspective on what it is like to be stereotyped.</p>\n<p>“It’s not just someone who doesn’t know anything about Muslim culture or may have stereotypical understandings of what being a Muslim in America is like, so I’m happy there’s some kind of story being told,” Kaleem said.</p>\n<p>MSA member and third-year economics and math major Nihal Hakim said he thought the title of the play is offensive to Pakistani people.</p>\n<p>“At first when I saw the event name, “Dirty Paki Lingerie,” my first hang up was on just the name, or the use of the word Paki,” Hakim said. “Paki is a racial slur, especially in the UK, but also to a certain degree in the U.S. It’s a word that really brings down a whole community of people.”</p>\n<p>Hakim said the image on flyers for the event of Fatima holding piece of lingerie while wearing a hijab is a false image of what it is like to be a Pakistani woman.</p>\n<p>“It relies on the stereotypes of the Muslim woman — the Pakistani woman — being somewhat different and that difference being an oppression and that oppression can only be alleviated by a very specific type of post-colonial westernization,” Hakim said.</p>\n<p>Mohsenian-Rahman said she encourages people to watch the show with an open mind despite the backlash from students and alumni.</p>\n<p>“I would encourage them to think twice and come to the event to think about what the ultimate goals of the play really are,” Mohsenian-Rahman said. “It’s not necessarily perpetuation; she’s not trying to participate in stereotyping ourselves or themselves or yourselves, she’s trying to combat them.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66168\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66168\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-05/aizzah-fatima-to-perform-her-play-dirty-paki-lingerie/","id":2635,"author":{"id":128,"name":"Siboney Arias"},"related":[2634,2633,2632],"comments":[],"followers":[]},{"title":"A.S. Finance and Business Committee Fully Funds 10 Requests, Partially Funds Three, Tables One","category":"News","subcategory":"Campus","publish_date":"2015-11-03T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?resize=980%2C647&ssl=1","description":"The Associated Students Finance and Business Committee (A.S. F&B) met Monday in the UCen State Street room to consider 14 funding requests from various campus organizations. The committee began it...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66039\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"227977369\" data-slb-internal=\"0\" data-slb-group=\"66046\"><img aria-describedby=\"caption-attachment-66039\" data-attachment-id=\"66039\" data-permalink=\"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/finbo_vivian-bui-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?fit=2000%2C1325&amp;ssl=1\" data-orig-size=\"2000,1325\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"1.4\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1446481104\",\"copyright\":\"\",\"focal_length\":\"50\",\"iso\":\"220\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Finance and Business Committee\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?fit=888%2C588&amp;ssl=1\" class=\"wp-image-66039\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1-1024x678.jpg?resize=750%2C497\" alt=\"Vivian Bui/Daily Nexus\" width=\"750\" height=\"497\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?resize=1024%2C678&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?resize=250%2C166&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?resize=500%2C330&amp;ssl=1 500w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/FinBo_Vivian-Bui-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66039\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>The Associated Students Finance and Business Committee (A.S. F&amp;B) met Monday in the UCen State Street room to consider 14 funding requests from various campus organizations.</p>\n<p>The committee began its meeting with $26,121.92 in Office of Student Life (OSL) funds, $6,665 in Senate unallocated, $45,000 in Student Initiated Outreach Program, $28,565 in Culture Weeks and Graduations, $26,480 for sports teams and $17,164 for academic teams. A.S. F&amp;B fully granted 10 requests, partially granted three requests and tabled one request.</p>\n<p>Men’s Lacrosse requested $3,400 to make t-shirts for their annual “Faceoff Versus Leukemia Tournament” to raise money for the Leukemia and Lymphoma society.</p>\n<p>Men’s Lacrosse team captain Matt Herning said the event honors 2008 team member Stephan Meloy who passed away from leukemia by donating the fundraised money to the Leukemia and Lymphoma society in his name.</p>\n<p>“We had a player on our 2004-2008 team named Stephan Meloy who passed away from leukemia so we donate the money every year in his name and his mother comes each year to support,” Herning said.</p>\n<p>A.S. F&amp;B voted to fully fund the event with the stipulation that Men’s Lacrosse use their one exception since A.S. F&amp;B does not fund t-shirts.</p>\n<p>Health &amp; Wellness requested $3,762 to host their quarterly Free HIV testing day, which provides students with free HIV tests on campus.</p>\n<p>A.S. F&amp;B voted to fully fund their request.</p>\n<p>The Political Science Graduate Student Association (PSGSA) requested $2,000 to host a Speaker’s Series. The event aims to provide information about political science graduate programs to undergraduate students. The event will be held in collaboration with Pi Sigma Alpha Delta, the undergraduate political science honors society.</p>\n<p>PSGSA representative and political science Ph.D. candidate Andrew Johnson said the event aims to connect current undergraduate students interested in political science with current political science graduate students.</p>\n<p>“I want to break down this barrier between graduate students and undergraduate students,” Johnson said. “We should be able to have conversations about political science outside of the classroom.”</p>\n<p>A.S. F&amp;B voted to table the request for a week with the stipulation PSGSA fill out an I-360 form.</p>\n<p>UCSB Chinese Students and Scholars Association (CSSA) requested $283 to host scholars from China who will provide information about majors, internships, research opportunities and career paths.</p>\n<p>CSSA representative and second-year economics and accounting major Xiaotong Diao said the event will help undergraduate students gain advice from Chinese scholars.</p>\n<p>“Last year, we invited several scholars from China and they talked about finding careers and choosing majors, since many freshmen are confused about those things,” Diao said.</p>\n<p>A.S. F&amp;B voted to partially fund the request, which the stipulation that CSSA not use the funding for plastic water bottles.</p>\n<p>Korean Campus Ministry (KCM) requested $7,000 to send 46 people to a KCM winter retreat introduced at last week’s meeting.</p>\n<p>A.S. F&amp;B voted to partially fund the request with $3,500 because only five members of the organization have confirmed their attendance at the conference.</p>\n<p>Active Minds requested $323 to host a mental awareness event “Stigma Free UCSB” on Nov. 19.</p>\n<p>Active Minds Representative and second-year psychology major Marisa Jones said Active Minds hopes to build on the success of last year’s event.</p>\n<p>“We are a mental health organization focused on reducing the stigma around mental illness and changing the conversation on mental health,” Jones said. “We’re hosting an event called Stigma Free UCSB. We also had it last year and it was a big success.”</p>\n<p>A.S. F&amp;B voted to fully fund their request.</p>\n<p>UCSB4Bernie requested $95 to hire two security guards for two hours for their second Democratic debate watching party on Nov. 14.</p>\n<p>UCSB4Bernie representative and third-year religious studies major Eric Villalobos said the first event was successful in bringing multiple campus organizations together.</p>\n<p>“The last Democratic Debate Watching event we had was a huge success,” Villalobos said. “We had Campus Republican show up as well as many progressive student groups like CALPIRG and System Change for Climate Change. Planned Parenthood and Generation Action were also there.”</p>\n<p>A.S. F&amp;B voted to fully fund their request.</p>\n<p>Health &amp; Wellness requested $11,500 to purchase a 24-hour vending machine for medication and sexual reproductive health products introduced at last week’s meeting.</p>\n<p>Health &amp; Wellness representative and third-year biology major Eyra Dordi said the machine would help provide contraception that students may find difficult to access.</p>\n<p>“This weekend most of the pharmacies around here ran out of Plan B, and that actually happens quite frequently,” Dordi said. “Planned Parenthood is also quite far and inconvenient for students.”</p>\n<p>A.S. F&amp;B voted to fully fund the request in a 13-0-0 vote.</p>\n<p>The Queer Commission (QCom) requested $10,824 to send 20 students to the National Creating Change Conference in Chicago.</p>\n<p>QCom representative and fourth-year sociology and psychology double major Leah Hardenbrook said the event helps students understand LGBTQIA+ issues from the international viewpoint.</p>\n<p>“The Creating Change Conference is for LGBTQIA+ folks and it’s held in a more international viewpoint,” Hardenbrook said. “There are many awesome LGBTQIA+ advocates there and it really highlights the international community.”</p>\n<p>A.S. F&amp;B voted to table the request until next week’s meeting.</p>\n<p>Students for Justice in Palestine (SJP) requested $500 for the honorarium to invite Palestinian-American human rights activist Remi Kanazi to speak during Palestinian Culture Week.</p>\n<p>SJP representative and second-year public policy and global studies double major Nawar Nemeh said the culture week is intended to educate students on Palestinian issues and culture.</p>\n<p>“We seek to educate students on Palestinian culture, the status of Palestinians and essentially what Palestinians are going through on this campus. Part of that is our Palestinian Culture Week,” Nemeh said.</p>\n<p>A.S. F&amp;B voted to fully fund the event.</p>\n<p>The Universty Center (UCen) requested $1,100 for their quarterly UStudy Program introduced at last week’s meeting.</p>\n<p>A.S. F&amp;B voted to partially fund the event $275 with the stipulation that the Recreation Center look into additional funding from University Center Governance Board.</p>\n<p>UCSB Poet’s Club requested $400 to host a poetry slam night in The Hub. The event would be an extension of the bi-weekly Thursday slam poetry nights the club hosts in I.V.</p>\n<p>UCSB Poet’s Club founder and fourth-year chemical engineering major Francis Cunningham said the event would give members an opportunity to perform their poetry in a more formal seating with a larger audience.</p>\n<p>“We want to hold a larger, more formal event in The Hub,” Cunningham said. “The reason we want to do this is to allow more experienced or ambitious members to debut in front of a larger crowd.”</p>\n<p>A.S. F&amp;B voted to fully fund the request.</p>\n<p>Indian Association of Santa Barbara (IASB) requested $3,500 to host a Diwali festival celebration on Nov. 14. Participants will be able to make lanterns and eat traditional Indian food.</p>\n<p>A.S. F&amp;B voted to fully fund the request with an 11-1-1 vote.</p>\n<p>Wildlife Society requested $458 to host a Planet Earth screening event in I.V. Theater introduced at last week’s meeting. Wildlife Society requested additional funding from AfterDark.</p>\n<p>A.S. F&amp;B voted to fully fund the request.</p>\n<div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66046\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66046\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-03/a-s-finance-and-business-committee-fully-funds-10-requests-partially-funds-three-tables-one/","id":2634,"author":{"id":127,"name":"Amy Koo"},"related":[2633,2632,2631],"comments":[],"followers":[]}]},"__N_SSG":true}