{"pageProps":{"article":{"title":"“Teach In” Event Held To Discuss Tuition Fees, Student Debt","category":"News","subcategory":"Campus","publish_date":"2015-11-06T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?resize=980%2C647&ssl=1","description":"The Attainable, Accessible, Affordable UCSB Coalition (AAAC) hosted an event titled “Teach In” at the MultiCultural Center theater Thursday night to educate students about tuition fees and student...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66193\" style=\"width: 760px\" class=\"wp-caption alignnone\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1827009590\" data-slb-internal=\"0\" data-slb-group=\"66206\"><img aria-describedby=\"caption-attachment-66193\" data-attachment-id=\"66193\" data-permalink=\"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/million-student-march-_by-vivian-bui-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?fit=2000%2C1325&amp;ssl=1\" data-orig-size=\"2000,1325\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1446668480\",\"copyright\":\"\",\"focal_length\":\"24\",\"iso\":\"4500\",\"shutter_speed\":\"0.01\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Million Student March _by Vivian Bui-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?fit=888%2C588&amp;ssl=1\" class=\"wp-image-66193\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1-1024x678.jpg?resize=750%2C497\" alt=\"Vivian Bui/Daily Nexus\" width=\"750\" height=\"497\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?resize=1024%2C678&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?resize=250%2C166&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?resize=500%2C330&amp;ssl=1 500w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Million-Student-March-_by-Vivian-Bui-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66193\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>The Attainable, Accessible, Affordable UCSB Coalition (AAAC) hosted an event titled “Teach In” at the MultiCultural Center theater Thursday night to educate students about tuition fees and student debt and to promote the upcoming “Million Student March.”</p>\n<p>AAAC collaborated with several other student organizations such as the Student Union, Office of the Student Advocate, Associated Students External Vice President of Student Affairs Office, UCSB-4-Bernie, A.S. Office of the President and UCSB University of California Student Association to inform attendees about issues surrounding the student march which will be held on Nov. 12 at 12:00 p.m. at Storke Plaza. UCSB will join over 90 other colleges, including all nine UC’s (excluding UC San Francisco), in marching to demand free public university tuition, the cancellation of all student debt and the installation of a $15 minimum wage for all campus workers.</p>\n<p>A.S. External Vice President of Statewide Affairs (EVPSA) and fourth-year sociology and Black studies double-major Mohsin Mirza said the Donahoe Higher Education Act, alternatively referred to as the Master Plan for Higher Education in California, made tuition free for UC schools when the UC system was first founded in the 60s. According to Mirza, the act was in place up until Ronald Reagan imposed a “student fee” to attend the universities and diverted UC funding to other, less productive activities.</p>\n<p>“[Reagan] saw the UCs as promoting — basically handing out free education to a whole bunch of would-be communists,” Mirza said. “He saw the UC’s principles to educate people as dangerous, and this tied into his ideas, which were generally against public spending.”</p>\n<p>I.G.N.I.T.E. Coordinator for the EVPSA office and fourth-year biology major Clare Idehen said Reagan diverted UC funding to prison spending and mass incarceration, which “disproportionally” affects Blacks and Latinos more than other ethnicities in America with one in three black men going to prison in their lifetime.</p>\n<p>“Since the 80s, we’ve seen a huge 800 percent increase in the amount of people going to prison, and almost half of all the people incarcerated in prisons right now are for non-violent drug charges,” Idehen said. “Why are our prisons full of people who are non-violent?”</p>\n<p>According to Idehen, there are better ways to use the 80 billion dollars spent per year on mass incarceration in America.</p>\n<p>“With 80 billion dollars, we could provide preschool for every three-and-four-year-old in America, finance roads, bridges and airport jobs,” Idehen said. “And most importantly, allocate tuition at every public university and college.”<strong> </strong></p>\n<p>Idehen said students around the globe are fighting for accessible education for all.</p>\n<p>“They’re fighting for the same thing we are,” Idehen said. “They’re not very different from us — they’re maybe 17 and 18, 19, maybe 16 years old going to college. They’re basically us. So it’s really great to stand in solidarity with these students, and I think it’s really important to know what’s happening.”</p>\n<p>UCSB United States Student Association Board of Directors Co-Chair and second-year political science major José Javier Magaña Mendoza said independent Vermont senator and democratic presidential candidate Bernie Sanders advocates for government subsidized college tuition through a Robin Hood Tax. According to Mendoza, it is an estate tax on stock and bond sales and a sales tax on commodities, debentures, derivatives and notes which will bring in an estimated 300 to 350 billion dollar in tax revenue.</p>\n<p>“How the tax works is that it’s just a small financial transaction tax on Wall Street, a tax that is 0.5 percent on stocks, 0.1 percent on bonds and 0.00 percent on derivatives,” Mendoza said. “This helps us because it will go to things such as jobs, housing, affordability, child care, healthcare, transportation and a big investment on the infrastructure. As students, it also goes to our higher education.”</p>\n<p>EVPSA officer, Teach In event organizer and second-year mathematics major Kyle Butts said internal UC worker union AFSCME 3299 supports the Million Student March because the union cares about students and agrees with the $15 minimum wage demand for all UC workers.</p>\n<p>“All nine UC’s, except UCSF, are holding marches, and AFSCME 3299 covers all those different areas, so they’re going to be having a voice in this, but mainly stand in solidarity,” Butts said.</p>\n<p>According to Butts, there has been a push for Chancellor Yang and the Vice Chancellors to attend the Million Student March.</p>\n<p>“All the A.S. Executives, the GSA president and the RHA president all signed letters requesting Chancellor Yang and all of the Vice Chancellors’ presence at this march,” Butts said. “We believe that this isn’t just a student issue or a worker’s issue, but this also has to do with UC as a whole.”</p>\n<p>Teach In speaker and third-year sociology major Alex Villegas said access to education is a global issue, and protests have been happening in London and Africa, with Africa’s protest breaking out into violence.</p>\n<p>“I don’t think a lot of people are really aware that our generation is facing this on a global level, and that we’re going to be impacted,” Villegas said. “It’s not just a temporary situation, but it’s something life-long.  It’s going to impact the future generations, and at the end of the day we’re going to end up inheriting all of this. Our leaders are setting us up for failure, so if we don’t take action now, we’re essentially all screwed.”</p>\n<p>Second-year sociology major Casey Ramirez said he attended because he is struggling to afford tuition.</p>\n<p>“Debt is hard, and paying for things are a hardship,” Ramirez said. “It’s causing issues with my parents — we’re middle class and they have bad credit, so it’s hard to get loans.”</p>\n<p>Mirza said it will take a change in policy to ease the “deep debt” students in America are accumulating.</p>\n<p>“The money exists. We have enough money, we’re the richest country in the world to pay for free higher education,” Mirza said. “We all know all too well the impact the cost college can have on our families. The question is how can we make it so that this isn’t the case, so we can have the principle of free higher education.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66206\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66206\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-06/teach-in-event-held-to-discuss-tuition-fees-student-debt/","id":2640,"author":{"id":137,"name":"Mohan Saxena"},"related":[2639,2638,2637],"comments":[],"followers":[]},"author":{"id":137,"name":"Mohan Saxena","biography":"Not available","articles":[2592,2619,2640,2654,2686,2687,4639],"portrait":"Not available"},"related":[{"title":"UCSB To Establish Chapter of Students for Sensible Drug Policy","category":"News","subcategory":"Campus","publish_date":"2015-11-05T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=980%2C647&ssl=1","description":"Students Cole Garcia and Ashcon Minoiefar are in the process of establishing a UCSB chapter of Students for Sensible Drug Policy (SSDP), an international organization advocating an end to the “war o...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66160\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"45091812\" data-slb-internal=\"0\" data-slb-group=\"66175\"><img aria-describedby=\"caption-attachment-66160\" data-attachment-id=\"66160\" data-permalink=\"https://dailynexus.com/2015-11-05/66175/ssdp_lorenzo-basilio-1/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=2000%2C1335&amp;ssl=1\" data-orig-size=\"2000,1335\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"\",\"camera\":\"NIKON D750\",\"caption\":\"\",\"created_timestamp\":\"1445898302\",\"copyright\":\"\",\"focal_length\":\"200\",\"iso\":\"2000\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"SSDP\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?fit=888%2C593&amp;ssl=1\" class=\"wp-image-66160\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1-1024x684.jpg?resize=750%2C501\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"750\" height=\"501\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=1024%2C684&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/SSDP_Lorenzo-Basilio-1.jpg?w=1776 1776w\" sizes=\"(max-width: 750px) 100vw, 750px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66160\" class=\"wp-caption-text\"><em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Students Cole Garcia and Ashcon Minoiefar are in the process of establishing a UCSB chapter of Students for Sensible Drug Policy (SSDP), an international organization advocating an end to the “war on drugs” approach to substance control.</p>\n<p>Garcia, a second-year biology major, and Minoiefar, a third-year history of public policy major, aim to educate students on the war on drugs, explore alternative approaches and promote smart decisions regarding drug use. A group of students at the University of Massachusetts Amherst led by Shea Gunther founded SSDP in 1998, and the organization has grown to include thousands of members from hundreds of campuses worldwide.</p>\n<p>UCSB’s SSDP chapter is currently going through the campus organization registration process with the Office of Student life and seeking a faculty advisor, but has already been active on campus and has a club constitution. For a chapter to be officially recognized by the organization, it must have at least three students and actively organize on campus.</p>\n<p>Pacific outreach coordinator for SSDP Frances Fu said she can help connect SSDP efforts across campuses.</p>\n<p>“For example, the UC Davis chapter is currently spearheading a Good Samaritan policy at their school and would like to make it a statewide effort,” Fu said in an email. “Part of my job is facilitating those relationships and partnerships.”</p>\n<p>Garcia said he hopes to help install a local Good Samaritan policy, which would grant legal immunity to someone who calls the police or medical personnel for an injured person.</p>\n<p>“A lot of times a person’s friends or peers are scared of law enforcement and the repercussions that would come with calling an ambulance and getting the authorities involved,” Garcia said. “We’d like to make it easier for people who need help with drugs and alcohol to seek help for something like an overdose.”</p>\n<p>Garcia said he hopes to convey to students the many effects of national and local drug policy.</p>\n<p>“I’d like for SSDP to educate students on how drug policy is related to a variety of other social issues, like unemployment and the economy, education, health care and racial injustice,” Garcia said. “If students understand how reforming drug policy will improve society in these other areas, then they will understand how necessary drug policy reform actually is.”</p>\n<p>To publicize the new chapter, members have been tabling and handing out information around campus. Garcia plans to eventually hold documentary screenings and invite guest speakers to campus to discuss drug policy.</p>\n<p>First-year political science major Catherine Lee says that SSDP will be a good addition to UCSB’s campus organizations because many students do not understand the implications of drug policy and the effects of drug use.</p>\n<p>“It sounds similar to what we learned in AlcoholEdu online over the summer, but I think this program will be more successful in communicating messages to students if they do everything in person through things like guest speakers and events,” Lee said. “Unfortunately, I don’t think most students registered most of the information presented to them online in AlcoholEdu.”</p>\n<p>Minoiefar said he decided to create the UCSB chapter of SSDP because he felt not having a local Good Samaritan policy discourages students from aiding others in in dangerous situations to avoid legal repercussions.</p>\n<p>Like Garcia, Minoiefar said he would like to change local policy to encourage students to intervene in potentially dangerous situations.</p>\n<p>“A big thing the chapter can do is push a policy like the Good Samaritan policy at the university,” Minoiefar said. “The school can put in its policy that if you get help for someone in need … and if it is decided that a person did it in good faith, they won’t be in trouble.”</p>\n<p>As the new chapter of SSDP grows at UCSB, Minoiefar said he hopes to amass a big enough following to continue running the program once both co-founders graduate.</p>\n<p>“These types of initiatives, like the Good Samaritan policy, tend to die out when a student like me leaves because then all the information and things I’ve learned leave with me,” Minoiefar said. “By building this chapter, we hope to be able to create new student leaders who can continue this.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66175\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66175\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/66175/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-05/66175/","id":2637,"author":{"id":140,"name":"Olivia Pla"},"related":[2636,2635,2634],"comments":[],"followers":[]},{"title":"LGBTQ Studies To Revitalize its Minor","category":"News","subcategory":"Campus","publish_date":"2015-11-05T08:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=980%2C647&ssl=1","description":"The Department of Feminist Studies plans to expand the LGBTQ Minor by adding three new classes; two in Winter quarter and one during Spring New Director of the lesbian, gay, bisexual, transgender and ...","content":"<div class=\"single-post-content\">\n            <h2>The Department of Feminist Studies plans to expand the LGBTQ Minor by adding three new classes; two in Winter quarter and one during Spring</h2>\n<p>New Director of the lesbian, gay, bisexual, transgender and queer (LGBTQ) studies minor and assistant professor Jennifer Tyburczy plans to revitalize the Department of Feminist Studies’ LGBTQ minor, which has been offered since 2004.</p>\n<p>Tyburczy aims to offer students a comprehensive background in new LGBTQ theories as well as the global history of LGBTQ studies. The minor currently provides an interdisciplinary examination of the lives, experiences, identities and representations of LGBTQ individuals. Students seeking the LGBTQ studies minor will take feminist studies courses in addition to a variety of interdisciplinary courses.</p>\n<p>Tyburczy said she wants the minor to connect with social issues from around the world and focus on LGBTQ developments within the UCSB student population.</p>\n<p>“Top priorities will include strengthening the intersections of gender and sexuality studies with race, ethnicity, class, and disability studies from a national and transnational lens, forging new social justice and scholarly ties across disciplines,” Tyburczy said in an email.</p>\n<p>Tyburczy said the minor is expanding with two new courses being offered during next Winter quarter and one new course during Spring quarter.</p>\n<p>“I will offer two new courses this winter: an upper-division undergraduate course called ‘Trans-Art’ that will explore transgender, genderqueer, and gender fluid artists and artworks across genres and geographies in the twentieth and twenty-first centuries and a queer theory graduate course,” Tyburczy said in email. “In the spring, I will offer an undergraduate version of queer theory.”</p>\n<p>According to Tyburczy, the minor will be tailored to better prepare the student body for future careers in a variety of fields.</p>\n<p>“Students will gain broad knowledge in a growing segment of the national and global population that remains little understood by mainstream institutions,” Tyburczy said in email. “This knowledge can be employed in a variety of arenas: from activism and public advocacy work, to the law and the health sciences, to the arts and educational environments.”</p>\n<p>Second-year communication major Ciara Baker, whose name has been changed to protect her identity, said the LGBTQ studies minor educates students on global issues concerning sexuality, gender and identities and understanding systematic marginalization through critical thinking.</p>\n<p>“I think the minor is important because it produces well-rounded students because of the intersectionality it covers and it also makes students more aware, so that they can be more inclusive and successful in any career that they choose,” Baker said in an email. “The LGBTQ minor allows UCSB students to broaden their field of study and understand race, gender, and other identities.”</p>\n<p>Third-year sociology major Madeline Stefani said she is pursuing the minor because it focuses on viewing “gender rigidity” as one of the main causes of inequality.</p>\n<p>“I think that it covers important movements in our history as humans that are not covered anywhere else and gives students the opportunity to explore social issues, especially ones relating to the LGBTQ community,” Stefani said in an email. “It’s another area of marginalization that is not really discussed in the history courses. I think it should be just as important as an ethnicity requirement.”</p>\n<p>Feminist studies professor Leila Rupp said many students pursue the minor to better understand the identities of their loved ones.</p>\n<p>“Some students do the minor for personal reasons, either because they are lesbian, gay, bisexual, transgender, or queer or have family members who are and want to understand the place of sexuality, in combination with other factors, in shaping life experiences,” Rupp said in an email.</p>\n<p>Rupp said students also enter the program to better recognize the problems of LGBTQ members in intellectual and career-oriented domains.</p>\n<p>“Some students pursue the minor for professional reasons, so that in their chosen careers they understand the lives, experiences, and identities of LGBTQ people,” Rupp said in an email. “And still others do the minor for primarily intellectual reasons, because they find the subject matter compelling.”</p>\n<p>A version of this story appeared on page 7 of the Thursday, November 5, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66166\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/lgbtq-studies-to-revitalize-its-minor/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66166\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/lgbtq-studies-to-revitalize-its-minor/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/lgbtq-studies-to-revitalize-its-minor/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-05/lgbtq-studies-to-revitalize-its-minor/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-05/lgbtq-studies-to-revitalize-its-minor/","id":2638,"author":{"id":117,"name":"Effie Sklavenitis"},"related":[2637,2636,2635],"comments":[],"followers":[]},{"title":"Jennicet Gutierrez Advocates for Marginalized Groups at the Hub","category":"News","subcategory":"Campus","publish_date":"2015-11-08T08:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?resize=760%2C507&ssl=1","description":"Trans Latina activist and undocumented immigrant Jennicet Gutierrez spoke in the Hub Thursday evening in the final installation of the Trans Revolution Series hosted by the UCSB Resource Center for Se...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66200\" style=\"width: 770px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"730639980\" data-slb-internal=\"0\" data-slb-group=\"66212\"><img aria-describedby=\"caption-attachment-66200\" data-attachment-id=\"66200\" data-permalink=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/gutierrez_by-riley-esguerra-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?fit=760%2C507&amp;ssl=1\" data-orig-size=\"760,507\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2.8\",\"credit\":\"Riley Esguerra\",\"camera\":\"Canon EOS 5D Mark III\",\"caption\":\"\",\"created_timestamp\":\"1446711954\",\"copyright\":\"\",\"focal_length\":\"148\",\"iso\":\"2000\",\"shutter_speed\":\"0.01\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Gutierrez_by Riley Esguerra-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?fit=760%2C507&amp;ssl=1\" class=\"size-full wp-image-66200\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?resize=760%2C507\" alt=\"Riley Esguerra/Daily Nexus\" width=\"760\" height=\"507\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?w=760&amp;ssl=1 760w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-1.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 760px) 100vw, 760px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66200\" class=\"wp-caption-text\">Riley Esguerra/Daily Nexus</p></div>\n<p><span style=\"font-weight: 400;\">Trans Latina activist and undocumented immigrant Jennicet Gutierrez spoke in the Hub Thursday evening in the final installation of the Trans Revolution Series hosted by the UCSB Resource Center for Sexual &amp; Gender Diversity.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez discussed her rise to prominence after interrupting President Barack Obama during the White House’s LGBT Pride Reception in June. At the reception, Gutierrez called the abuse of detained LGBTQ undocumented immigrants to Obama’s attention, demanding an end to their deportation.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said trans women who are also undocumented immigrants are placed in detention centers along with men, creating a situation where they often face harassment.</span></p>\n<p><span style=\"font-weight: 400;\">“Some of the conditions that our undocumented transgender women face is very heartbreaking and dehumanizing,” Gutierrez said.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said she was inspired by transgender activist and UCSB alumna Zoraida Reyes, and realized LGBTQ women and undocumented immigrants can lead activism movements.</span></p>\n<p><span style=\"font-weight: 400;\">“Zoraida [Reyes] showed me that we have the capacity to be at the center of the movement, to join the conversations, be an important part of it and move the movement in the right direction,” Gutierrez said.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said she sought legal advice before interrupting Obama at the White House and was told not to speak out because she could face criminal charges.</span></p>\n<p><span style=\"font-weight: 400;\">“I was being told to shut up, to take all the abuse — ‘You are a trans woman, you are undocumented, you are nothing,’” Gutierrez said.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said she is tired of being “dehumanized” and will challenge power even at the cost of her own life.</span></p>\n<div id=\"attachment_66199\" style=\"width: 770px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg\" data-slb-active=\"1\" data-slb-asset=\"1711786333\" data-slb-internal=\"0\" data-slb-group=\"66212\"><img aria-describedby=\"caption-attachment-66199\" data-attachment-id=\"66199\" data-permalink=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/gutierrez_by-riley-esguerra-2/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?fit=760%2C507&amp;ssl=1\" data-orig-size=\"760,507\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2.8\",\"credit\":\"Riley Esguerra\",\"camera\":\"Canon EOS 5D Mark III\",\"caption\":\"\",\"created_timestamp\":\"1446711956\",\"copyright\":\"\",\"focal_length\":\"148\",\"iso\":\"2000\",\"shutter_speed\":\"0.01\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Gutierrez_by Riley Esguerra-2\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?fit=760%2C507&amp;ssl=1\" class=\"size-full wp-image-66199\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?resize=760%2C507\" alt=\"Riley Esguerra/Daily Nexus\" width=\"760\" height=\"507\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?w=760&amp;ssl=1 760w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/11/Gutierrez_by-Riley-Esguerra-2.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 760px) 100vw, 760px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66199\" class=\"wp-caption-text\">Riley Esguerra/Daily Nexus</p></div>\n<p><span style=\"font-weight: 400;\">“My power has been taken away so many times, but by confronting the president, I regained my power and I regained my dignity,” Gutierrez said.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said that everyone is important in the movement to defend the rights of LGBTQ undocumented immigrants.</span></p>\n<p><span style=\"font-weight: 400;\">“We are the true leaders,” Gutierrez said. “Just the fact we exist is revolutionary. We are challenging the norms, social injustices.”</span></p>\n<p><span style=\"font-weight: 400;\">Director of UCSB’s Resource Center for Sexual &amp; Gender Diversity David Whitman said it is important to host activists like Gutierrez because students of color and undocumented students grow up with few role models they can identify with.</span></p>\n<p><span style=\"font-weight: 400;\">“[UCSB is] providing students with possibility models, where people can see themselves represented, sometimes for the first time in their whole life, [and] are able to gain a sense of confidence, sense of empowerment, a sense of encouragement,” Whitman said.</span></p>\n<p><span style=\"font-weight: 400;\">First-year political science major Ricardo Uribe said he enjoyed hearing Gutierrez’s life story and learned how to effectively work toward equality.</span></p>\n<p><span style=\"font-weight: 400;\">“If you want to make change, do so with respect; do so where you get your message across while you are respecting the people around you,” Uribe said.</span></p>\n<p><span style=\"font-weight: 400;\">Second-year political science major Mariel Islas said she first met Gutierrez at the UC Student Association congress last year and was compelled to attend Thursday’s discussion after seeing her take a stance at the White House.</span></p>\n<p><span style=\"font-weight: 400;\">“She is a trans Latina woman and undocumented — that’s a lot of marginalized communities and identities into one person, and just seeing her have so much power and so much courage — it’s inspiring,” Islas said.</span></p>\n<p><span style=\"font-weight: 400;\">Gutierrez said she enjoys reading poetry and concluded the evening by reading the audience a poem she wrote.</span></p>\n<p><span style=\"font-weight: 400;\">“The status quo wanted me to remain a broken soul; activism empowered and repaired my soul, and activism empowered my existence. Now I’m on a mission to challenge power and the status quo,” Gutierrez said.</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66212\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66212\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-08/jennicet-gutierrez-advocates-for-marginalized-groups-at-the-hub/","id":2639,"author":{"id":144,"name":"Jonathan Mendez"},"related":[2638,2637,2636],"comments":[],"followers":[]}]},"__N_SSG":true}