{"pageProps":{"article":{"title":"University Awards ‘Promise’ to New Scholars","category":"News","subcategory":"Campus","publish_date":"2015-10-15T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=980%2C647&ssl=1","description":"UC Santa Barbara’s Office of Financial Aid and Scholarships administered for the first time this year the Promise Scholar Program, which recognizes incoming undergraduates who show potential in acad...","content":"<div class=\"single-post-content\">\n            <p>UC Santa Barbara’s Office of Financial Aid and Scholarships administered for the first time this year the Promise Scholar Program, which recognizes incoming undergraduates who show potential in academic, research and student leadership positions and provides them a minimum of $120,000 in financial support.</p>\n<p>The program allows students and their families to plan for all four years of tuition as opposed to traditional financial aid programs, which are on a year-by-year basis. Scholars are given a minimum of $120,000 to go towards tuition, room and board, loan fees, health and books. The program was created by Assistant Vice Chancellor of Student Affairs Claudine Michel and Office of Financial Aid and Scholarships Director Michael Miller after they recognized a fundamental issue with the traditional financial aid program design.</p>\n<p>Miller said a major obstacle families with financial need face is having to commit to paying for four years of education though traditional financial aid programs only provide funding one year at a time.</p>\n<p>“I can’t think of any other major purchase that works that way,” Miller said in an email. “By providing students with a four-year outlook, they are able to focus on why they are here, which is to get a world class education and entrench themselves in the UCSB community.”</p>\n<p>According to Miller, UCSB stands as number three on the Top Colleges Doing the Most for Low-Income Students list by The Upshot, which measures colleges’ efforts on economic diversity.</p>\n<p>“We do a great deal for low income students at UCSB,” Miller said in an email. “Approximately 75% of undergraduates at UCSB have financial aid and we disburse about $400 million annually. For most families, a UCSB education would not be possible without some sort of financial aid.”</p>\n<p>Miller said the new Promise Scholars program is offered to dedicated students from areas of California where it is less common for high school graduates to attend UCSB.</p>\n<p>“We really were not sure how the program would be received so we made a modest number of offers and we focused on areas of the state we have not been able to recruit students to UCSB in the past,” Miller said in an email. “All of the students selected for the Promise Scholar program were highly meritorious and showed a great deal of potential.”</p>\n<p>Academic Initiatives Associate Director Mark Shishim said he is confident that this group of Promise Scholars will positively impact the UCSB community in more ways than one.</p>\n<p>“This is an extraordinary group of students – I’m confident their contributions to our University will be evident in scholarship, leadership and citizenship,” Shishim said in an email. “I’m honored to be a part of their journey and proud to welcome them to the Gaucho family.”</p>\n<p>Miller said he has very high hopes for the program and wants to see the students involved on campus without worrying about finances.</p>\n<p>“I would love to see our Promise Scholars become campus leaders, work closely with faculty, participate in research and give back to the UCSB community in some way,” Miller said in an email. “By eliminating the guessing game about whether they can afford to stay at UCSB, we are hoping to see positive results in all aspects of our students’ lives.”</p>\n<p>Miller said the program could change the way financial aid is administered across the UC.</p>\n<p>“I truly believe we are on to something with multiyear financial aid awards,” Miller said in an email. “If we remain thoughtful and continue to collaborate across our campus, I think this could revolutionize the way financial aid is administered at the University of California and beyond.”</p>\n<p>Promise Scholar Advisor Natalie Gonzalez said the promise scholars benefit from various resources and opportunities to which other students do not have access.<br>\n“One of the things they are invited to is a faculty night, and that is just for them to be able to meet other faculty members on campus,” Gonzalez said. “In the Winter Quarter will be workshops on budgeting and how to renew financial aid applications, making sure that they are meeting those deadlines as well.”</p>\n<p>Gonzalez said she wants to introduce Promise Scholars to research opportunities and other resources.</p>\n<p>“We will have more information on how to get involved in undergraduate research, how to talk to faculty members, how to seek mentorship, and overall how to be exposed to the different resources that UCSB has to offer,” Gonzalez said.</p>\n<p>Gonzalez also said she hopes the program will build a support system for the scholars that will increase retention.</p>\n<p>“I hope they have peers that they can contact and connect with in order to have that home away from home support system with each other, but also with staff, faculty and other community members that are here to support them,” Gonzalez said.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-65437\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/university-awards-promise-to-new-scholars/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-65437\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/university-awards-promise-to-new-scholars/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/university-awards-promise-to-new-scholars/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/university-awards-promise-to-new-scholars/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-10-15/university-awards-promise-to-new-scholars/","id":2688,"author":{"id":118,"name":"Peeka Zimmerman"},"related":[2687,2686,2685],"comments":[],"followers":[]},"author":{"id":118,"name":"Peeka Zimmerman","biography":"Not available","articles":[2407,2490,2504,2533,2541,2543,2544,2551,2557,2580,2616,2618,2688,2702,2703,2728,2737,2749,2778,2780,2792,2802,2803,2825,2846,2855,2860,2881,2885,2899,2900,2904,2908,2913,2920,2934,2943,2945,2946,2962,2970,2977,3443,3609,3617,3856,4590,4606,4626,4629,4656,4722,4741,4786,4801,4813],"portrait":"Not available"},"related":[{"title":"Gun Control Activism Discussed During Open Meeting at UCSB","category":"News","subcategory":"Campus","publish_date":"2015-10-12T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/New-Logo-Featured-e1527757142402.jpg?resize=980%2C647&ssl=1","description":"Chicano/Chicana Studies Professor Ralph Armbruster and Graduate Student Association vice president of committees and planning Timothy Irvine hosted an open meeting Thursday evening in front of the Stu...","content":"<div class=\"single-post-content\">\n            <p>Chicano/Chicana Studies Professor Ralph Armbruster and Graduate Student Association vice president of committees and planning Timothy Irvine hosted an open meeting Thursday evening in front of the Student Resource Building (SRB) to discuss gun-control activism at UCSB.</p>\n<p>Armbruster and Irvine organized a candlelight vigil last week honoring the victims of the Umpqua Community College shooting. They planned the most recent meeting as a follow-up for those interested in joining a UCSB-based movement for stricter gun control. The group will meet again next week to discuss gun reform at the local level.</p>\n<p>Armbruster said while he believes people need time to “express their emotions” following events such as the Umpqua Community College shooting, the UCSB community needs to come together to discuss what action should be taken to advocate for stricter gun control.</p>\n<p>“I think you do need time to process, mourn and cry,” Armbruster said. “On the other hand, after you do that, there needs to be something else.”</p>\n<p>Armbruster said the pro-gun lobby has prevented gun control reform laws through “distorting” the word “freedom” and the American ideal surrounding it.</p>\n<p>“That buzzword, the discourse of just that one word, I think is so captivating, that they did a really fine job in trying to convince people that somehow, someway gun control equals lack of freedom, lack of liberty,” Armbruster said.</p>\n<p>Armbruster also said while some argue guns provide owners with protection and safety, he believes the prevalence of guns in the United States causes “insecurity.”</p>\n<p>“You never know who might be walking around here and might open up on you,” Armbruster said. “I’d rather be in a situation where I knew UCSB is gun free.”<br>\nFirst-year psychology major Jackie Rodriguez said it “frustrates” her that people in supposedly safe places, like schools, can be in danger of mass shootings.<br>\n“Like the kids from Sandy Hook, they didn’t get to have a boyfriend or girlfriend, they didn’t get to learn how to ride a bike, they didn’t get to do stuff like that,” Rodriquez said. “If I can do anything to fix that for my own children when I get older then that’s what I’m going to do.”</p>\n<p>Fourth-year sociology and history double major Katie Jacobson said she was pleased with the turnout at the meeting.</p>\n<p>“It’s nice that other people came, it wasn’t as large as the vigil but there was people who still showed up,” Jacobson said. “It was nice to hear from people that they were also sharing the same ideas that we need to do something.”</p>\n<p>Irvine said he is glad undergraduates came to the meeting to get involved because he enjoys working with them and serving as a “resource.”</p>\n<p>“They are about as bitter and jaded as I am already, but they just care,” Irvine said. “They are so passionate and I really love being around them and I love providing my knowledge.”</p>\n<p>First-year economics major Willey Campbell said he attended last week’s vigil to “pay his respects” to the victims of the shooting, but the event inspired him to engage in the gun-control movement.</p>\n<p>“Just seeing the impact that it had on everyone here made me want to come back and talk about how there should be more done about gun reforms,” Campbell said. “Having people that are very passionate about something like this that want to go out and make a change was something that was really motivating to me and something I wanted to be a part of especially as a first-year coming in.”</p>\n<p>The next meeting will be held this Thursday at 8 p.m. outside the SRB.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-65234\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-12/gun-control-activism-discussed-during-open-meeting-at-ucsb/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-65234\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-12/gun-control-activism-discussed-during-open-meeting-at-ucsb/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-12/gun-control-activism-discussed-during-open-meeting-at-ucsb/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-12/gun-control-activism-discussed-during-open-meeting-at-ucsb/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-10-12/gun-control-activism-discussed-during-open-meeting-at-ucsb/","id":2685,"author":{"id":144,"name":"Jonathan Mendez"},"related":[2684,2683,2682],"comments":[],"followers":[]},{"title":"Bike Safety On the Rise While Theft Decreases","category":"News","subcategory":"Campus","publish_date":"2015-10-15T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?resize=980%2C647&ssl=1","description":"UCSB improves bike safety and theft prevention by encouraging students to register their bikes and implementing new campaigns and committees to lower the number of thefts The biking situation at UCSB ...","content":"<div class=\"single-post-content\">\n            <p style=\"text-align: center;\"><strong>UCSB improves bike safety and theft prevention by encouraging students to register their bikes and implementing new campaigns and committees to lower the number of thefts</strong></p>\n<div id=\"attachment_65419\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg\" data-slb-active=\"1\" data-slb-asset=\"423233273\" data-slb-internal=\"0\" data-slb-group=\"65434\"><img aria-describedby=\"caption-attachment-65419\" data-attachment-id=\"65419\" data-permalink=\"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/bike_lorenzo-basilio/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?fit=2000%2C1111&amp;ssl=1\" data-orig-size=\"2000,1111\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1444215219\",\"copyright\":\"\",\"focal_length\":\"85\",\"iso\":\"100\",\"shutter_speed\":\"0.00025\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Bike_Lorenzo Basilio\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?fit=250%2C139&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?fit=888%2C493&amp;ssl=1\" class=\"size-large wp-image-65419\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio-1024x569.jpg?resize=888%2C493\" alt=\"UCSB has over 15,000 bikes registered through the Community Service Organization Registration Program, and yet still manages to keep the campus a relatively safe biking and skateboarding environment for its sudents. Lorenzo Basilio/Daily Nexus\" width=\"888\" height=\"493\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?resize=1024%2C569&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?resize=250%2C139&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/10/Bike_Lorenzo-Basilio.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-65419\" class=\"wp-caption-text\"><em>UCSB has over 15,000 bikes registered through the Community Service Organization Registration Program, and yet still manages to keep the campus a relatively safe biking and skateboarding environment for its sudents.</em> Lorenzo Basilio/Daily Nexus</p></div>\n<p>The biking situation at UCSB has been improving, with a reduction from over 300 reported thefts annually in 2010 to less than 200 thefts in 2014.</p>\n<p>UCSB has over 15,000 bicyclists on campus, a third of which are registered by the Community Service Organization (CSO) bike registration program. Associated Students Bike Committee (ASBC) and Corporal Matthew Stern from UCPD, the designated bicycle and skateboard safety officer, are largely in charge of all things bicycle related on the UCSB campus, from registration to bike path maintenance.</p>\n<p>First-year psychology major Stevi Ibonie said she bikes to and from class and has picked up on the bike traffic patterns in the three weeks she’s been on campus.<br>\n“I think that [bike paths] can be [crowded] at certain times of the day,” Ibonie said. “…people have a lot of 9 a.m.’s, so when you’re biking to your 9 a.m. class sometimes there’s a million people [on the paths] but then sometimes, when you’re biking back later in the day, like four or five, there’s not too many people and it’s kind of nice. So it kind of depends.”</p>\n<p>Third-year biopsychology major Neha Nayak said she was recently involved in a bike accident on campus.</p>\n<p>“I just got into an accident yesterday,” Nayak said. “I usually bike to campus [from Isla Vista] and then walk because I don’t like how crowded [the bike paths are]. But then I was walking, and he was going really fast, and I wasn’t looking that way, and he crashed into me, and we both got really hurt.”</p>\n<p>ASBC chair and second-year economics and accounting major Tiffany Wu said ASBC updated its Facebook page to include safety information about campus biking tips. According to Wu, inexperience with biking in crowded places and incorrect bike etiquette are the biggest causes of inefficiencies and accidents.</p>\n<p>“Biking was pretty hectic in the first few weeks when there were [first years] coming in and learning how to bike and how to navigate the bike paths,” Wu said. “Mostly, I feel like there’s not really a tradition of using hand signals at UCSB. That’s why we’re trying to navigate our committee towards a more educational path.”</p>\n<p>Stern said the biking “culture” has changed compared to when he biked on campus as a student.</p>\n<p>“Biking is what I did primarily when I came here,” Stern said. “I was also a CSO so I was on bikes pretty much 40 hours a week on campus. When I went to school here, iPods weren’t popular yet — nobody could afford them — so nobody had headphones, nobody had phones and people would actually have conversations on the bike lanes.”</p>\n<p>According to Stern, there is an alternative program for students who receive citations for breaking a bike-related law to attend a bike safety class for $35 instead of paying a fine upwards of $200.</p>\n<p>“When I was in school, we didn’t have the option of taking a class; we had to pay the whole fee of the citation … It wasn’t effective in terms of educating people,” Stern said. “We’re not out there to penalize students, we just want to make the environment safer for everybody.”</p>\n<p>Stern said the bicycle registration program deters theft and is bringing UCSB’s stolen bike recovery rate to 30-33 percent, which is six times the national average.</p>\n<p>“A bike that’s unregistered that is reported to a law enforcement agency statistically has about a one percent chance of recovery,” Stern said. “Bike registration is required on campus by law, and that’s primarily why it’s so effective. If I can get 100 percent compliance, I guarantee you we’d be recovering more bikes.”</p>\n<p>According to Stern, he is planning a new committee to reduce bike theft throughout Santa Barbara County.</p>\n<p>“It started off informally, and it grew into a bunch of concerned community members,” Stern said. “We’ve got people from law enforcement from the sheriff’s department and the city of Santa Barbara, along with some bicycle retailers and some county personnel.”</p>\n<p>Stern also said he is planning a campaign in March tentatively called “Dude, Where’s My Bike?” and plans to use GPS bait bikes set around campus posed as normal bikes, which law enforcement will use to apprehend perpetrators if the bikes are stolen.</p>\n<p>“The idea is it’s a full month campaign during bicycle safety month,” Stern said. “[We’ll] operate our GPS bait bikes… do a sweep of the entire campus and bicycle racks, recover as many stolen bicycles as we can and identify as many thieves [as we can].”</p>\n<p>Stern says the most important thing in bike safety is to be aware of your surroundings when biking and to follow the rules of the road.</p>\n<p>“If [bikers] make a conscious effort to pay attention to their surroundings and maybe take things a little slower than they normally would, then I think that would really reduce bike accidents,” Stern said. “It’s a misconception that bicycles always have the right of way … In Isla Vista, [in] more than 90 percent of bike [and] car accidents, the bicyclist is actually found at fault.”</p>\n<p>If you have any questions bicycle or skateboard related, email Corp. Stern at matt.stern@police.ucsb.edu.</p>\n<p>Read about more about bike safety tips at facebook.com/UCSB.BikeComm.</p>\n<p>Report any your lost bicycle or any information about a stolen bicycle to UCPD dispatch at (805) 893-3446.</p>\n<p><em>A version of this story appeared on p. 8 of the Oct. 15, 2015 edition of the</em> Daily Nexus.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-65434\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-65434\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-10-15/bike-safety-on-the-rise-while-theft-decreases/","id":2686,"author":{"id":137,"name":"Mohan Saxena"},"related":[2685,2684,2683],"comments":[],"followers":[]},{"title":"Active Minds of UCSB To Attend Health Conference","category":"News","subcategory":"Campus","publish_date":"2015-11-12T08:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?resize=980%2C647&ssl=1","description":"UCSB’s Active Minds chapter will attend the Active Minds 12th National Mental Health on Campus Conference at UC Irvine this weekend to network with chapters from across the nation. Active Minds aims...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_66393\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1544702489\" data-slb-internal=\"0\" data-slb-group=\"66415\"><img aria-describedby=\"caption-attachment-66393\" data-attachment-id=\"66393\" data-permalink=\"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/active-minds-irvine_courtesy-of-wikipedia-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?fit=2000%2C1500&amp;ssl=1\" data-orig-size=\"2000,1500\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Active Minds Irvine_Courtesy of Wikipedia-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?fit=250%2C188&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?fit=888%2C666&amp;ssl=1\" class=\"wp-image-66393 size-large\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1-1024x768.jpg?resize=888%2C666\" alt=\"Active Minds Irvine_Courtesy of Wikipedia-1\" width=\"888\" height=\"666\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?resize=1024%2C768&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?resize=250%2C188&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/11/Active-Minds-Irvine_Courtesy-of-Wikipedia-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-66393\" class=\"wp-caption-text\">Photo courtesy of uci.edu</p></div>\n<p>UCSB’s Active Minds chapter will attend the Active Minds 12th National Mental Health on Campus Conference at UC Irvine this weekend to network with chapters from across the nation.</p>\n<p>Active Minds aims to use education to eradicate the stigma associated with seeking mental health treatment. The conference will allow members to interact with mental health experts, activists and leaders.</p>\n<p>UCSB Active Minds Co-President and fourth-year psychology major Melissa Boomer said this will be the first time in years that the UCSB chapter can attend the conference, because it is the first time the conference will be on the West Coast.</p>\n<p>“Active Minds National has been traditionally based on the East Coast,” Boomer said. “It was just really far away and really difficult to get funding for [the] long flight — things like that.”</p>\n<p>According to Boomer, the conferences are aimed at bringing Active Minds chapters together from around the country to share ideas the can help people struggling with mental health issues and combat the stigma surrounding mental health treatment.</p>\n<p>“We have the ability to seriously create really useful ideas and things that we can do to help our goals together,” Boomer said. “We get a lot of help with leadership and ideas for advocacy — ideas for getting funding since we’re a nonprofit — things like that.”</p>\n<p>Boomer said the “shining stars” of the chapters across the country will lead workshops, which the UCSB chapter will attend.</p>\n<p>“What we get from the conferences is being able to see exemplary work being done by campuses and being able to be taught by them — you know, this is what we’re doing right, so you can get all of the pieces … these [are] all really great ideas. How can we incorporate that into what we’re doing on our campus?” Boomer said.</p>\n<p>UCSB Active Minds Social Media Officer and third-year biopsychology major Crystal Groel said she looks forward to attending the workshops and meeting members of other chapters.</p>\n<p>“There are definitely things that are going to educate people on how to deal with mental illness and how to help those that are going through mental health problems,” Groel said. “It’ll be a good education for me and other people, and just being involved with a community of people who want to get the same thing you do.”</p>\n<p>UCSB Active Minds event coordinator and third-year biopsychology major Joren Adams said the Associated Students Finance and Business Committee provided funding for UCSB Active Minds to attend conference, but not every member can attend.</p>\n<p>“We basically were able to take, per finance board stipulation, nine officers and three general members, but I think that only one general member is going,” Adams said.</p>\n<p>Adams said he is looking forward to meeting students doing similar work at their institutions.<br>\n“I just think there is going to be, again, the ability to learn from other people, because we’ve isolated ourselves on campus,” Adams said. “We’re, like, kind of the only real groups that talk about mental health on our campus, so it’d be nice to meet with other groups that talk about mental health on their campus.”</p>\n<p>UCSB Active Minds member and second-year global studies major Kaylee Peterson said she joined Active Minds earlier this year after seeing the Send Silence Packing display on campus, which featured backpacks representing lives of college students lost to suicide.</p>\n<p>“I got involved with Active Minds because I think mental health is a really important issue on campus, and as well just in general in our society,” Peterson said. “I really want to learn the tools to talk about mental health and erase the stigma in our society, as well as make it a more open topic.”</p>\n<p>A version of this story appeared on p. 12 of the Thursday, Nov. 12, issue of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-66415\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-66415\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-11-12/active-minds-of-ucsb-to-attend-health-conference/","id":2687,"author":{"id":137,"name":"Mohan Saxena"},"related":[2686,2685,2684],"comments":[],"followers":[]}]},"__N_SSG":true}