{"pageProps":{"article":{"title":"Students Win New Venture Competition With BAC Monitor Startup","category":"News","subcategory":"Campus","publish_date":"2015-05-22T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"This year’s New Venture Competition (NVC) Finals awarded its annual $10,000 grand prize to student tech start up Milo, a business projected to create a device that proactively monitors the blood alc...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63740\" style=\"width: 490px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg\" data-slb-active=\"1\" data-slb-asset=\"715414583\" data-slb-internal=\"0\" data-slb-group=\"63713\"><img aria-describedby=\"caption-attachment-63740\" data-attachment-id=\"63740\" data-permalink=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/nvc_checks_outside_015/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=480%2C343&amp;ssl=1\" data-orig-size=\"480,343\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"NVC_Checks_Outside_015\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=250%2C179&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=480%2C343&amp;ssl=1\" class=\"size-full wp-image-63740\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?resize=480%2C343\" alt=\"Photo courtesy of UCSB Technology Management Program\" width=\"480\" height=\"343\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?w=480&amp;ssl=1 480w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?resize=250%2C179&amp;ssl=1 250w\" sizes=\"(max-width: 480px) 100vw, 480px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63740\" class=\"wp-caption-text\"><em>Photo courtesy of UCSB Technology Management Program</em></p></div>\n<p>This year’s New Venture Competition (NVC) Finals awarded its annual $10,000 grand prize to student tech startup Milo, a business projected to create a device that proactively monitors the blood alcohol content (BAC) of individual consumers.</p>\n<p>The NVC is hosted by the UCSB Technology Management Program, which gives entrepreneurial students and researchers on campus the opportunity to develop cutting-edge startups with expert guidance and mentorship. This year’s finalists featured augmented reality video-conferencing business Caugnate, chemotherapy diagnostics company Chemoguard, marketing analytics startup Insiight, hotel door key app Sesamo, cricket flour-producing business Slightly Nutty and the NVC winners, Milo.</p>\n<p>For the “tech-driven” award category, startups Chemoguard and Cognate split second place and Milo won first place, while Slightly Nutty and Sesamo split second place and Insiight won first place in the “market-pull” category. Milo also won the $10,000 grand prize and $2,500 People’s Choice Award, while Chemogaurd won the $5,000 Elings Prize.</p>\n<p>NVC sponsor, venture capitalist and alumnus Jason Spievak, whose software company Invoca hires mostly Gaucho graduates, said the NVC Finals present a vital opportunity for investors to discover promising young potential startups.</p>\n<p>“There’s lots of great stuff coming out of UCSB, and the depth and scope of the engineering talent here compared to when I was in school has become very impressive,” Spievak said. “From a material science perspective, it’s now the number one school in the world.”</p>\n<p>According to Spievak, the NVC develops industry and job production for the benefit of the local and global community.</p>\n<p>“Locally, it creates jobs and it keeps people in Santa Barbara, which is a win,” Spievak said. “Globally there are those occasional technologies like Integrated Fluidics that truly have the potential to save a lot of lives and change the world, and those are innovations that are happening right here on campus.”</p>\n<p>Milo member and computer science graduate student Daniel Imberman said his startup is already in talks with an incubator featuring a technology host angel, and that all his group members are interested in moving the business forward.</p>\n<p>“The high point was the second we got that first working trial,” Imberman said. “Up until then I was just kind of not sure what we were doing was going to amount to anything, but once I saw that data chart it was like, ‘Oh my god. We actually have something.’”</p>\n<p>According to Imberman, participating in the NVC has allowed him to gain knowledge and experience that transcends traditional business and technology curriculum.</p>\n<p>“I’ve learned more and worked more in the past three months than I have I the past two years,” Imberman said. “I’ve had daily 8 a.m. to midnight days. If I wasn’t in school, I was working on this all the time. Honestly even if we hadn’t won a dime I would’ve walked out with so much more business knowledge and just ready to attack the world based on this one competition.”</p>\n<p>Fourth year biochemistry major and Chemogaurd member Letitia Mueller, the only female finalist to win an award in the tech-driven category, said if her startup receives seed capital, it could “open up a whole new world of how to do chemotherapy.”</p>\n<p>“If we have a way to make chemo more effective, we could have people survive through chemo with higher dosages,” Mueller said. “If they can tolerate them or avoid the drugs they can’t tolerate, then that makes chemo more efficient and improves quality of life and reduces costs.”</p>\n<p>Mueller is one of three females to have made it to the NVC finals, along with graduate student in the Bren School of Environmental Science Megan Miranda of Slightly Nutty, who tied for the second place award in the market-pull category, and psychology graduate student Katie Koehler of Insiight, who won first place in market-pull.</p>\n<p>According to Mueller, the lack of female representation in the competition reflects an overall male-dominant trend in the tech industry that she hopes to see eliminated in years to come.</p>\n<p>“People sometimes don’t understand the gravity of the situation when you are one of the few women in your field.” Mueller said. “That being said, it’s really important for women to realize that there are so many avenues you can go down that haven’t been travelled by females. Why is the NVC 90 percent male dominated? It shouldn’t have to be that way.”</p>\n<p><em>[<strong>Correction:</strong> A previous version of this article incorrectly stated that Letitia Mueller was the only female to win the New Venture Competition Finals. In actuality, finalists Megan Miranda of Slightly Nutty and Katie Koehler of Insiight won awards in the “market-pull” category. </em></p>\n<p><em>Also, a previous version of this article incorrectly quoted Jason Spievak as referencing to a company called Asta Fluidics instead of the correct </em><em>Integrated Fluidics. The </em>Daily Nexus<em> apologizes for these errors.]</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63713\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63713\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/","id":2724,"author":{"id":158,"name":"Carissa Quiambao"},"related":[2723,2722,2721],"comments":[],"followers":[]},"author":{"id":158,"name":"Carissa Quiambao","biography":"Not available","articles":[2724,2758,3013,3045,3051,3069,3103,3118,3469,3623,3626,6974,6977,7074,7691],"portrait":"Not available"},"related":[{"title":"Recap: Off-Campus Senator Candidate Forum","category":"News","subcategory":"Campus","publish_date":"2017-04-19T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=980%2C647&ssl=1","description":"The candidates for off-campus senator kicked off the second day of campaigning on Tuesday, meeting at the candidate forum in The Hub to relay their stances on various issues as potential senators.","content":"<div class=\"single-post-content\">\n            <p>The candidates for off-campus senator kicked off the second day of campaigning on Tuesday, meeting at the candidate forum in The Hub to relay their stances on various issues as potential senators.</p>\n<p>Taking part in the off-campus senator forum were five Isla Vista Party candidates — Brandon Mora, Sami Kaayal, Veronica Leeman, Alexandra Gessesse and Ilene Ochoa — and six Campus United candidates — Kristen Armellini, Adham Btaddini, Deepika Chandrashekar, Sophia Dycaico, Sam Cook and Dominick DiCesare.</p>\n<p>Campus United candidates for off-campus senator — Alison Sir, Adnan Mansur, Anthony Pimentel, Evan Quash and Dhishal Jayasinghe — participated in the forum with the collegiate senator candidates due to an Elections Board scheduling mishap.</p>\n<p>Candidates Carla Martinez, Siboney Arias, Mara Joy Abubo and Justin Deckard did not show for Tuesday’s forum.</p>\n<p>Each candidate was given one minute to introduce themselves and their party position. Steven Kwok, the forum moderator, posed two questions for candidate response, allotting one minute each. The candidates were allocated 30 seconds for final remarks.</p>\n<p>Kwok first asked the candidates how they would ensure that the LGBTQ community on campus feels safe and recognized. The second question addressed the role the university should play regarding Deltopia.</p>\n<p>Responses to the issues presented by these questions and overarching goals were identified by each candidate as summarized below:</p>\n<ul>\n<li>Ochoa, a third-year communication major, said she hoped for a greater presence for the LGBTQ community on campus. Regarding Deltopia, Ochoa said the successful community outreach done by UC Isla Vista (UCIV) this year was indicative of what the I.V. community should represent.</li>\n</ul>\n<ul>\n<li>Cook, a first-year political science major, said he understands the importance in providing a space for the LGBTQ community to share their voice. As vice president of Santa Catalina Hall Council, he said he has helped to created events for LGBTQ students in the hall. Cook said the UCIV program played a crucial role in Deltopia this year, and the university’s provision of the Warm Up concert was a great incentive as well, proving that “the University has truly come full circle on how they view Deltopia and it will only get better from here.”</li>\n</ul>\n<ul>\n<li>Mora, a third-year political science and sociology double major, said he would like to see the expansion of non-gendered bathrooms on campus so the LGBTQ community can be more included on campus. Mora said the university should ensure that the police presence in Isla Vista stays true to the approachable demeanor they held this year, rather than the more hostile demeanor Mora said the police assumed in prior years.</li>\n</ul>\n<ul>\n<li>Gessesse, a first-year history of public policy and sociology double major, said she wants to expand the definition of safe spaces for the LGBTQ community on campus to include restrooms and bathrooms. Gessesse said she wants the university to work closely alongside the I.V. Community Services District (CSD) during Deltopia. According to Gessesse, “the university spent a lot of money on advertisements that could be geared towards partnership towards creating safety with I.V. CSD.”</li>\n</ul>\n<ul>\n<li>Btaddini, a second-year political science major, said he wants to “empower the students here that are making an effort to fight for the LGBTQ community and represent students on campus.” Regarding the university’s role during Deltopia, Btaddini said the university should foster the kind of culture that does not punish students on big events, but looks out for their safety.</li>\n</ul>\n<ul>\n<li>Dycaico, a second-year history of public policy major, said if elected, she plans to reach out to LGBTQ communities to ensure they are heard and represented. She said the role the university plays in holding alternative events during Deltopia is an effective safety measure, especially when coupled with the help of UCIV.</li>\n</ul>\n<ul>\n<li>DiCesare, a third-year computer science major, said he plans to use his platform “to bring different groups and ideologies on this campus together so we can have a better environment for this campus no matter who you are or what you identify as.” DiCesare said he believes students, as members of the university and as a part of the Isla Vista community, should all take steps during Deltopia to ensure that students are safe in all instances.</li>\n</ul>\n<ul>\n<li>Leeman, a second-year mathematical science and German double major, said she wants to reach out to professors to ensure they are incorporating “inclusive language in their syllabi and lectures” for the LGBTQ community. Leeman said the university’s role during Deltopia should be more proactive and less reactive and focus on educating students about why it is in their best interest to protect Isla Vista.</li>\n</ul>\n<ul>\n<li>Chandrashekar, a first-year communication major, said that if elected, she plans on making it a point to start a conversation with the LGBTQ community, go to their meetings and hear what their concerns are. She also said students should have a voice in regard to the university funding of precautionary advertisements against Deltopia and where that funding may be better spent.</li>\n</ul>\n<ul>\n<li>Kaayal, a second-year biology major, said he hopes to promote as many safe spaces on campus for the LGBTQ community as possible. Concerning the university’s role during Deltopia, Kaayal said he hopes to promote the idea of community policing. He said he believes the university should increase the jurisdiction of CSOs instead of bringing police in from other areas.</li>\n</ul>\n<ul>\n<li>Armellini, a second-year history of public policy major, said she wants to “amplify” the voices in the LGBTQ community and “make sure they’re heard and taken care of.” She said the University’s approach to Deltopia should involve providing students with education, events and communication.</li>\n</ul>\n<ul>\n<li>Mansur, a third-year statistics major, said he wants to help students get jobs after graduation, and plans to make Career Services more accessible. He also wants to increase alumni connections with current students. If elected, he said he wants to help students know where their student fees are going.</li>\n</ul>\n<ul>\n<li>Sir, a first-year political science major, said she wants to represent minority communities and increase visibility of student resources. If elected, Sir said she wants to expand the A.S. Food Bank to Isla Vista so students can have access to it when off campus.</li>\n</ul>\n<ul>\n<li>Pimentel, a second-year political major, said he wants to help keep student fees affordable and facilitate student-run businesses. If elected, he said he wants to serve as the liaison between the student body and the university administration and use A.S. to empower students.</li>\n</ul>\n<ul>\n<li>Quash, a first-year statistical science and black studies double major, said he wants to increase off-campus students’ representation. If elected, Quash said he plans to achieve his goals as a senator through maintaining an open dialogue between A.S. and the administration to address issues such as college affordability.</li>\n</ul>\n<ul>\n<li>Jayasinghe, a second-year philosophy and global studies double major, said he wants to fix the biggest problems in Isla Vista including parking and work alongside the CSD. If elected, Jayasinghe said he hopes to use his experience of working in the External Vice President of Local Affairs (EVPLA) office to improve the community and open the dialogue to include all opinions.</li>\n</ul>\n<p>Campaigning for A.S. Elections began Sunday and will continue for the next two weeks until voting results are announced on the night of April 27.</p>\n<p>Profiles of all 51 A.S. candidates can be found <a href=\"http://dailynexus.com/interactives/aselections2017/\">here</a>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77079\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77079\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/","id":2723,"author":{"id":100,"name":"Anjalie Tandon"},"related":[2722,2721,2720],"comments":[],"followers":[]},{"title":"Recap: On-Campus and University-Owned Housing Senator Candidate Forum","category":"News","subcategory":"Campus","publish_date":"2017-04-18T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?resize=980%2C647&ssl=1","description":"Soon after A.S. elections week took off, nine candidates for on-campus and university-owned housing senators discussed resident assistant welfare during a public forum in the Hub on Monday.","content":"<div class=\"single-post-content\">\n            <p><span style=\"font-weight: 400;\">Soon after A.S. elections week took off, nine candidates for on-campus and university-owned housing senators discussed resident assistant welfare during a public forum in the Hub on Monday.</span></p>\n<div id=\"attachment_77044\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-77044\" data-attachment-id=\"77044\" data-permalink=\"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/monday-a-s-elections-by-jenny-luo-3/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Monday A.S. Elections by Jenny Luo-3\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-large wp-image-77044\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3-1024x682.jpg?resize=888%2C591\" alt=\"\" width=\"888\" height=\"591\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?resize=768%2C512&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Monday-A.S.-Elections-by-Jenny-Luo-3.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-77044\" class=\"wp-caption-text\">From left to right: Charles Neumann, Derek Yang, Juan Manuel Perez Tejada Mir, Alexa Hernandez, Kiavash Sadeghi, Steven Ho, Jorge Santos, Dylan Goldman and Vanessa Maldonado.<em> Jenny Luo / Daily Nexus</em></p></div>\n<p><span style=\"font-weight: 400;\">Participating in the on-campus senator forum were four I.V. Party candidates — Steven Ho, Jorge Santos, Dylan Goldman and Vanessa Maldonado — and four Campus United candidates — Charles Neumann, Alexa Hernandez, Derek Yang, and Kia Sadeghi. </span></p>\n<p><span style=\"font-weight: 400;\">Campus United’s Juan Perez Tejada also participated as a candidate for university-owned housing senator.</span></p>\n<p><span style=\"font-weight: 400;\">Salvador Hernandez-Arellano, a first-year political science major running for on-campus senator, and Andrea Reyes, a third-year communication major running for university-owned housing senator, did not attend the forum.</span></p>\n<p><span style=\"font-weight: 400;\">Each candidate had one minute to make an opening statement about their platform. Andrew Doerr, the forum moderator, then asked each candidate two questions and each candidate had thirty seconds to make a concluding statement. </span></p>\n<p><span style=\"font-weight: 400;\">Doerr first asked the candidates to identify the most important issue affecting on-campus residents. The second question, posed by the audience, addressed resident assistant (R.A.) welfare.</span></p>\n<p><span style=\"font-weight: 400;\">Each prospective senator identified a set of issues that they wanted to address. Listed below are some of their goals.</span></p>\n<ul>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ho, a first-year biology and Asian-American studies double major, said he wants to help underrepresented students feel more comfortable on campus. He said he wants to focus his efforts as a senator on food insecurity, allocating student fees for R.A. programs and increasing transparency in the senate. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Neumann, a first-year global studies major, said if elected, he hopes to increase the representation of the international student community. He said he plans to work on making college more affordable and hopes to create a liaison position to strengthen the relationship between A.S. and R.A.s.  </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Hernandez, a first-year economics and accounting major, said he is “passionate about making college more affordable for everyone.” If elected, she hopes to designate a C.A.P.S. counselor for R.A.s and personally reach out to them herself. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Tejada Mir, a second-year economics and accounting major, said he wants to address tuition hikes with the state. When asked about R.A. welfare, he said “being there for them is a huge deal,” and wants residents to reach out to R.A.s to “lend them a hand … and acknowledge their presence.”</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Yang, a first-year political science and chemistry double major, said he wants to implement rollover and guest meal swipes for the dining commons, as well as increase the number of study spaces on campus. If elected, Yang said he wants to be a liaison for R.A.s and provide a specific C.A.P.S. counselor to address their needs.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Santos, a first-year political science major, said he plans to improve the mental health resources on campus. When asked about R.A. welfare, Santos said he wants to create an A.S.-funded “mental-health social” for the R.A.s.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Sadeghi, a first-year political science major, stated he wants to limit the amount of stress for students and increase convenience on campus through providing more water stations in the resident halls and bike lanes at the Arbor. Sadeghi said he wants to partner with C.A.P.S. to provide a program for R.A.s as well as improve the relationship between R.A.s and residents.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Goldman, a first-year physics major, said he wants to increase the amount of diversity in S.T.E.M. classes. He also said the rising cost of tuition is the most important issue affecting UCSB students. If elected, he said wants to create a catered mental health group and change the drug and alcohol policy to help R.A.s become healthier leaders.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Maldonado, a first-year undeclared student, said she wants to revise UCSB’s alcohol and drug program, which puts “unnecessary stress on student’s mental health.” When asked about R.A. welfare, she said she wants to increase R.A. approachability for students by changing the alcohol and drug policy for residents.</span></li>\n</ul>\n</ul>\n<p><span style=\"font-weight: 400;\">Campaigning for A.S. Elections began 8 p.m. Sunday and will continue for the next two weeks until voting results are announced on the night of Apr. 27.</span></p>\n<p><span style=\"font-weight: 400;\">Profiles of all 51 A.S. candidates can be found </span><a href=\"http://dailynexus.com/interactives/aselections2017/\" target=\"_blank\"><span style=\"font-weight: 400;\">here</span></a><span style=\"font-weight: 400;\">.</span></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77052\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77052\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-18/recap-on-campus-and-university-owned-housing-senator-candidate-forum/","id":2722,"author":{"id":99,"name":"Parry Dong"},"related":[2721,2720,2719],"comments":[],"followers":[]},{"title":"Recap: Collegiate Senator Candidate Forum","category":"News","subcategory":"Campus","publish_date":"2017-04-18T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?resize=980%2C647&ssl=1","description":"The candidates running for transfer senator, the College of Letters and Science senators, the College of Creative Studies senator and the College of Engineering senator took to the stage Tuesday after...","content":"<div class=\"single-post-content\">\n            <p><span style=\"font-weight: 400;\">The candidates running for transfer senator, the College of Letters and Science senators, the College of Creative Studies senator and the College of Engineering senator took to the stage Tuesday afternoon as A.S. election candidate forums continued for a second day in The Hub.</span></p>\n<div id=\"attachment_77070\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-77070\" data-attachment-id=\"77070\" data-permalink=\"https://dailynexus.com/2017-04-18/environmentalists-protest-arctic-oil-drilling-naysayers-wine-about-it/tuesday-debates-by-josh-ortiz-2/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Tuesday Debates by Josh Ortiz-2\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-large wp-image-77070\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2-1024x682.jpg?resize=888%2C591\" alt=\"\" width=\"888\" height=\"591\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?resize=250%2C167&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?resize=768%2C512&amp;ssl=1 768w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-2.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-77070\" class=\"wp-caption-text\"><em>Josh Ortiz/Daily Nexus</em></p></div>\n<p><span style=\"font-weight: 400;\">Candidates for transfer senator included Naia Al-Anbar, </span><span style=\"font-weight: 400;\">running with the Isla Vista Party, and</span><span style=\"font-weight: 400;\"> Kian </span><span style=\"font-weight: 400;\">Maalizadeh, running with Campus United.</span></p>\n<p><span style=\"font-weight: 400;\">Campus United candidates running for College of Letters and Science senator included Stoddy Carey, Grayson Hernandez, Brooke Kopel and Andrew Banicki. Isla Vista Party candidates included Grecia Martinez.</span></p>\n<p><span style=\"font-weight: 400;\">Bongi Makatini, a second-year biology major running for L&amp;S senator with the Isla Vista Party, did not attend the forum.</span></p>\n<p><span style=\"font-weight: 400;\">Sophia Uemura is the unopposed Isla Vista Party candidate for the College of Creative Studies senator.</span></p>\n<p><span style=\"font-weight: 400;\">Micah Almas is the Isla Vista Party candidate for the College of Engineering senator and Blake Diamond is the Campus United candidate.</span></p>\n<div id=\"attachment_77071\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-77071\" data-attachment-id=\"77071\" data-permalink=\"https://dailynexus.com/2017-04-18/environmentalists-protest-arctic-oil-drilling-naysayers-wine-about-it/tuesday-debates-by-josh-ortiz-3/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Tuesday Debates by Josh Ortiz-3\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-large wp-image-77071\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3-1024x682.jpg?resize=888%2C591\" alt=\"\" width=\"888\" height=\"591\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=768%2C512&amp;ssl=1 768w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-77071\" class=\"wp-caption-text\"><em>Josh Ortiz/Daily Nexus</em></p></div>\n<p><span style=\"font-weight: 400;\">Steven Kwok mediated the forum and asked the candidates two questions created by audience members. The first question pertained to the use of hate speech on campus, while the second one asked the candidates how they plan to work with the administration to achieve their goals as senators.</span></p>\n<p><span style=\"font-weight: 400;\">The candidates were given 30 seconds for opening and closing remarks. </span></p>\n<p><span style=\"font-weight: 400;\">The candidates explained to audience members their plans for improving the lives of UCSB students. Here are some of the highlights:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Al-Anbar, a third-year anthropology major, said she wants to “pioneer” a transfer commission and help marginalized students feel more represented on campus. She said she believes that while there is a constitutional right to free speech, the university should “not entertain” hate speech and help maintain an environment free from violence.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Maalizadeh, a third-year biology major, said he wants to improve CLAS access for transfer students and expand transfer orientation, two issues he wants to work on with the university administrators. He said it is an “amazing time” to be a transfer student, and he wants to focus his efforts on increasing support for them. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Carey, a second-year global studies and geography double major, said he wants to use his “passion for academics” and “ability to strive as a leader” to serve his community. According to Carey, hate speech should not be tolerated on campus, and he hopes he can “use existing channels” of communication with campus administrators to achieve his goals as a senator.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Hernandez, a third-year political science major, said she wants students to know how A.S. can affect change on campus. She also said she wants to “streamline” the dialogue between A.S. and university administrators and work to decrease tuition and increase class enrollment availability. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Kopel, a second-year political science major, said she wants to ensure that student fees are seen through student resources. Kopel said she believes hate speech can make some students “feel alienated” on campus and wants to help facilitate productive dialogue between differing groups. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Banicki, a first-year biology major, said he wants to create more outdoor study spaces and hammocks on campus. He also said he wants to emphasize mental health and extend resources to students who may feel overwhelmed. As the president of the Santa Catalina South Residence Hall, he said he already “has a foot in the door” to work with university administrators. </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Martinez, a second-year sociology and economics double major, said she wants to increase representation of minority groups on campus. If elected, she said, she hopes to make college life more affordable and accessible to students.      </span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Uemura, a first-year chemistry major, said she wants to implement a mental health counselor for CCS and ensure an open dialogue with campus administrators. She said she believes there is a “fine line” between hate speech and free speech and said she hopes to maintain CCS as a “very safe space” that is welcome to everyone.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Almas, a second-year chemical engineering major, said he wants to work on making college more affordable for students, citing the high costs of tutoring and textbooks. He said he wants to create an open dialogue with administrators to ensure that the College of Engineering can be a safe and affordable environment.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Diamond, a second-year electrical engineering major, said he is excited about the future of A.S. and wants to increase students’ awareness about the university’s “incredible” resources including UCIV and the Community Housing Office. He said he believes engineers are underrepresented and wants to increase mental health resources for them. </span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Campaigning for A.S. Elections began Sunday and will continue for the next two weeks until voting results are announced on the night of April 27.</span></p>\n<p><span style=\"font-weight: 400;\">Profiles of all 51 A.S. candidates can be found </span><a href=\"http://dailynexus.com/interactives/aselections2017/\"><span style=\"font-weight: 400;\">here</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p></p><div id=\"attachment_77069\" style=\"width: 1034px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-77069\" data-attachment-id=\"77069\" data-permalink=\"https://dailynexus.com/2017-04-18/environmentalists-protest-arctic-oil-drilling-naysayers-wine-about-it/tuesday-debates-by-josh-ortiz-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Tuesday Debates by Josh Ortiz-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"size-large wp-image-77069\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1-1024x682.jpg?resize=888%2C591\" alt=\"\" width=\"888\" height=\"591\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?resize=768%2C512&amp;ssl=1 768w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?w=2000&amp;ssl=1 2000w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-1.jpg?w=1776 1776w\" sizes=\"(max-width: 888px) 100vw, 888px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-77069\" class=\"wp-caption-text\"><em>Josh Ortiz/Daily Nexus</em></p></div><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77076\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/collegiate-senator-candidate-forum/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77076\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/collegiate-senator-candidate-forum/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/collegiate-senator-candidate-forum/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-18/collegiate-senator-candidate-forum/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-18/collegiate-senator-candidate-forum/","id":2721,"author":{"id":84,"name":"Maura Fox"},"related":[2720,2719,2718],"comments":[],"followers":[]}]},"__N_SSG":true}