{"pageProps":{"article":{"title":"UCSB Professors Discuss Historical View on ISIL","category":"News","subcategory":"Campus","publish_date":"2015-05-21T07:00:00.000Z","full_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?resize=600%2C401&ssl=1","description":"International Association for Political Science Students (IAPSS) and UCSB History club co-hosted a talk titled “ISIS: A Historical Perspective” at Buchanan Hall Wednesday night during which UCSB h...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63669\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63669\" data-attachment-id=\"63669\" data-permalink=\"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/professor-sherene-seikaly-may-20th-2015/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?fit=600%2C401&amp;ssl=1\" data-orig-size=\"600,401\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.5\",\"credit\":\"Hari Patel\\/Daily Nexus\",\"camera\":\"NIKON D600\",\"caption\":\"Professor Sherene Seikaly, May 20th, 2015.\",\"created_timestamp\":\"1432149312\",\"copyright\":\"Hari Patel\\/Daily Nexus\",\"focal_length\":\"200\",\"iso\":\"1250\",\"shutter_speed\":\"0.0025\",\"title\":\"Professor Sherene Seikaly, May 20th, 2015.\",\"orientation\":\"0\"}' data-image-title=\"ISIS\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?fit=600%2C401&amp;ssl=1\" class=\"size-full wp-image-63669\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?resize=600%2C401\" alt=\"Professor Sherene Seikaly. Hari Patel/Daily Nexus\" width=\"600\" height=\"401\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/ISIS_Hari-Patel-1.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-63669\" class=\"wp-caption-text\">Professor Sherene Seikaly talks in Buchanan about the origins of ISIL. <em>Hari Patel/Daily Nexus</em></p></div>\n<p>International Association for Political Science Students (IAPSS) and UCSB History club co-hosted a talk titled “ISIS: A Historical Perspective” at Buchanan Hall Wednesday night during which UCSB history professors discussed the origins of the terrorist group, Islamic State of Iraq and the Levant (ISIL).</p>\n<p>UCSB history professors Sherene Seikaly and Adam Sabra began the talk by discussing the Islamic State from its historical origins. Seikaly described what ISIL is, what they stand for, how the group came to be and the violence they have committed. Sabra discussed sectarianism, the Arab Spring and compared ISIL to the terrorist group Al-Qaeda.</p>\n<p>According to Seikaly, the terrorist group was influenced by Saddam Hussein’s authoritarian regime and developed after the United States’ invasion of Iraq. Seikaly said ISIL was not a direct result of Islamic or religious “essentialism.”</p>\n<p>“What I think is important about looking at the history of Arab authoritarianism in Iraq and in Syria and the role of U.S. intervention is understanding that ISIS is a product of historical context,” Seikaly said.</p>\n<p>Sabra said the reason for ISIL’s success in recruiting diverse followers, such as doctors and other professionals from around the world, is that the group claims to be the Islamic government left after Muhammed’s death, or the caliphate.</p>\n<p>“A significant number of people have come, for example, from Europe,” Sabra said. “There have been others who’ve come from other parts of the Arab world — Tunisia has a particularly large contingent. We don’t really know how many more people may be attracted to this movement in the long run.”</p>\n<p>According to Sabra, ISIL recruits people by posting videos about celebration and triumph in addition to their violent footage of executions.</p>\n<p>“ISIS has done a very good job of recruiting people with their slick videos — not all their videos are about violence,” Sabra said. “After they took Mosul, they had all these videos about celebration and their great victory.”</p>\n<p>Seikaly said although ISIL pledged allegiance to Al-Qaeda, the group is more than an offshoot of the militant organization: It actively looks to govern and adjudicate a community and aspires to build a state.</p>\n<p>According to Sabra, people draw false conclusions and fail to understand how ISIL developed, which leads to difficulty when attempting to solve the political problems in the Middle East.</p>\n<p>“If you know the history, it’s much easier to understand how this has happened, and to also assess the future possibilities for continuing expansion or perhaps ending this movement eventually,” Sabra said.</p>\n<p>UCSB History Club president and fourth-year history of public policy major Darren Chen said people should strive to understand the historical background of the terrorist group and understand ISIL from a different perspective.</p>\n<p>“Obviously we understand that there’s ISIS from a political science perspective, there’s ISIS from a global studies perspective, but people never really had a historical perspective. When you have a historian, it gives you a much different view,” Chen said.</p>\n<p> </p>\n<p>A version of this story appeared on page 3 of Thursday, May 21, 2015’s print edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63681\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63681\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-21/ucsb-professors-discuss-historical-view-on-isil/","id":2726,"author":{"id":154,"name":"Christopher Chen"},"related":[2725,2724,2723],"comments":[],"followers":[]},"author":{"id":154,"name":"Christopher Chen","biography":"Not available","articles":[2684,2726,2734,2821,2866,2886,2958,2973,3436,4681,4794],"portrait":"Not available"},"related":[{"title":"Recap: Off-Campus Senator Candidate Forum","category":"News","subcategory":"Campus","publish_date":"2017-04-19T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2017/04/Tuesday-Debates-by-Josh-Ortiz-3.jpg?resize=980%2C647&ssl=1","description":"The candidates for off-campus senator kicked off the second day of campaigning on Tuesday, meeting at the candidate forum in The Hub to relay their stances on various issues as potential senators.","content":"<div class=\"single-post-content\">\n            <p>The candidates for off-campus senator kicked off the second day of campaigning on Tuesday, meeting at the candidate forum in The Hub to relay their stances on various issues as potential senators.</p>\n<p>Taking part in the off-campus senator forum were five Isla Vista Party candidates — Brandon Mora, Sami Kaayal, Veronica Leeman, Alexandra Gessesse and Ilene Ochoa — and six Campus United candidates — Kristen Armellini, Adham Btaddini, Deepika Chandrashekar, Sophia Dycaico, Sam Cook and Dominick DiCesare.</p>\n<p>Campus United candidates for off-campus senator — Alison Sir, Adnan Mansur, Anthony Pimentel, Evan Quash and Dhishal Jayasinghe — participated in the forum with the collegiate senator candidates due to an Elections Board scheduling mishap.</p>\n<p>Candidates Carla Martinez, Siboney Arias, Mara Joy Abubo and Justin Deckard did not show for Tuesday’s forum.</p>\n<p>Each candidate was given one minute to introduce themselves and their party position. Steven Kwok, the forum moderator, posed two questions for candidate response, allotting one minute each. The candidates were allocated 30 seconds for final remarks.</p>\n<p>Kwok first asked the candidates how they would ensure that the LGBTQ community on campus feels safe and recognized. The second question addressed the role the university should play regarding Deltopia.</p>\n<p>Responses to the issues presented by these questions and overarching goals were identified by each candidate as summarized below:</p>\n<ul>\n<li>Ochoa, a third-year communication major, said she hoped for a greater presence for the LGBTQ community on campus. Regarding Deltopia, Ochoa said the successful community outreach done by UC Isla Vista (UCIV) this year was indicative of what the I.V. community should represent.</li>\n</ul>\n<ul>\n<li>Cook, a first-year political science major, said he understands the importance in providing a space for the LGBTQ community to share their voice. As vice president of Santa Catalina Hall Council, he said he has helped to created events for LGBTQ students in the hall. Cook said the UCIV program played a crucial role in Deltopia this year, and the university’s provision of the Warm Up concert was a great incentive as well, proving that “the University has truly come full circle on how they view Deltopia and it will only get better from here.”</li>\n</ul>\n<ul>\n<li>Mora, a third-year political science and sociology double major, said he would like to see the expansion of non-gendered bathrooms on campus so the LGBTQ community can be more included on campus. Mora said the university should ensure that the police presence in Isla Vista stays true to the approachable demeanor they held this year, rather than the more hostile demeanor Mora said the police assumed in prior years.</li>\n</ul>\n<ul>\n<li>Gessesse, a first-year history of public policy and sociology double major, said she wants to expand the definition of safe spaces for the LGBTQ community on campus to include restrooms and bathrooms. Gessesse said she wants the university to work closely alongside the I.V. Community Services District (CSD) during Deltopia. According to Gessesse, “the university spent a lot of money on advertisements that could be geared towards partnership towards creating safety with I.V. CSD.”</li>\n</ul>\n<ul>\n<li>Btaddini, a second-year political science major, said he wants to “empower the students here that are making an effort to fight for the LGBTQ community and represent students on campus.” Regarding the university’s role during Deltopia, Btaddini said the university should foster the kind of culture that does not punish students on big events, but looks out for their safety.</li>\n</ul>\n<ul>\n<li>Dycaico, a second-year history of public policy major, said if elected, she plans to reach out to LGBTQ communities to ensure they are heard and represented. She said the role the university plays in holding alternative events during Deltopia is an effective safety measure, especially when coupled with the help of UCIV.</li>\n</ul>\n<ul>\n<li>DiCesare, a third-year computer science major, said he plans to use his platform “to bring different groups and ideologies on this campus together so we can have a better environment for this campus no matter who you are or what you identify as.” DiCesare said he believes students, as members of the university and as a part of the Isla Vista community, should all take steps during Deltopia to ensure that students are safe in all instances.</li>\n</ul>\n<ul>\n<li>Leeman, a second-year mathematical science and German double major, said she wants to reach out to professors to ensure they are incorporating “inclusive language in their syllabi and lectures” for the LGBTQ community. Leeman said the university’s role during Deltopia should be more proactive and less reactive and focus on educating students about why it is in their best interest to protect Isla Vista.</li>\n</ul>\n<ul>\n<li>Chandrashekar, a first-year communication major, said that if elected, she plans on making it a point to start a conversation with the LGBTQ community, go to their meetings and hear what their concerns are. She also said students should have a voice in regard to the university funding of precautionary advertisements against Deltopia and where that funding may be better spent.</li>\n</ul>\n<ul>\n<li>Kaayal, a second-year biology major, said he hopes to promote as many safe spaces on campus for the LGBTQ community as possible. Concerning the university’s role during Deltopia, Kaayal said he hopes to promote the idea of community policing. He said he believes the university should increase the jurisdiction of CSOs instead of bringing police in from other areas.</li>\n</ul>\n<ul>\n<li>Armellini, a second-year history of public policy major, said she wants to “amplify” the voices in the LGBTQ community and “make sure they’re heard and taken care of.” She said the University’s approach to Deltopia should involve providing students with education, events and communication.</li>\n</ul>\n<ul>\n<li>Mansur, a third-year statistics major, said he wants to help students get jobs after graduation, and plans to make Career Services more accessible. He also wants to increase alumni connections with current students. If elected, he said he wants to help students know where their student fees are going.</li>\n</ul>\n<ul>\n<li>Sir, a first-year political science major, said she wants to represent minority communities and increase visibility of student resources. If elected, Sir said she wants to expand the A.S. Food Bank to Isla Vista so students can have access to it when off campus.</li>\n</ul>\n<ul>\n<li>Pimentel, a second-year political major, said he wants to help keep student fees affordable and facilitate student-run businesses. If elected, he said he wants to serve as the liaison between the student body and the university administration and use A.S. to empower students.</li>\n</ul>\n<ul>\n<li>Quash, a first-year statistical science and black studies double major, said he wants to increase off-campus students’ representation. If elected, Quash said he plans to achieve his goals as a senator through maintaining an open dialogue between A.S. and the administration to address issues such as college affordability.</li>\n</ul>\n<ul>\n<li>Jayasinghe, a second-year philosophy and global studies double major, said he wants to fix the biggest problems in Isla Vista including parking and work alongside the CSD. If elected, Jayasinghe said he hopes to use his experience of working in the External Vice President of Local Affairs (EVPLA) office to improve the community and open the dialogue to include all opinions.</li>\n</ul>\n<p>Campaigning for A.S. Elections began Sunday and will continue for the next two weeks until voting results are announced on the night of April 27.</p>\n<p>Profiles of all 51 A.S. candidates can be found <a href=\"http://dailynexus.com/interactives/aselections2017/\">here</a>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-77079\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-77079\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2017-04-19/recap-off-campus-senator-candidate-forum/","id":2723,"author":{"id":100,"name":"Anjalie Tandon"},"related":[2722,2721,2720],"comments":[],"followers":[]},{"title":"Students Win New Venture Competition With BAC Monitor Startup","category":"News","subcategory":"Campus","publish_date":"2015-05-22T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"This year’s New Venture Competition (NVC) Finals awarded its annual $10,000 grand prize to student tech start up Milo, a business projected to create a device that proactively monitors the blood alc...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63740\" style=\"width: 490px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg\" data-slb-active=\"1\" data-slb-asset=\"715414583\" data-slb-internal=\"0\" data-slb-group=\"63713\"><img aria-describedby=\"caption-attachment-63740\" data-attachment-id=\"63740\" data-permalink=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/nvc_checks_outside_015/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=480%2C343&amp;ssl=1\" data-orig-size=\"480,343\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"NVC_Checks_Outside_015\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=250%2C179&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?fit=480%2C343&amp;ssl=1\" class=\"size-full wp-image-63740\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?resize=480%2C343\" alt=\"Photo courtesy of UCSB Technology Management Program\" width=\"480\" height=\"343\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?w=480&amp;ssl=1 480w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/NVC_Checks_Outside_015.jpg?resize=250%2C179&amp;ssl=1 250w\" sizes=\"(max-width: 480px) 100vw, 480px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63740\" class=\"wp-caption-text\"><em>Photo courtesy of UCSB Technology Management Program</em></p></div>\n<p>This year’s New Venture Competition (NVC) Finals awarded its annual $10,000 grand prize to student tech startup Milo, a business projected to create a device that proactively monitors the blood alcohol content (BAC) of individual consumers.</p>\n<p>The NVC is hosted by the UCSB Technology Management Program, which gives entrepreneurial students and researchers on campus the opportunity to develop cutting-edge startups with expert guidance and mentorship. This year’s finalists featured augmented reality video-conferencing business Caugnate, chemotherapy diagnostics company Chemoguard, marketing analytics startup Insiight, hotel door key app Sesamo, cricket flour-producing business Slightly Nutty and the NVC winners, Milo.</p>\n<p>For the “tech-driven” award category, startups Chemoguard and Cognate split second place and Milo won first place, while Slightly Nutty and Sesamo split second place and Insiight won first place in the “market-pull” category. Milo also won the $10,000 grand prize and $2,500 People’s Choice Award, while Chemogaurd won the $5,000 Elings Prize.</p>\n<p>NVC sponsor, venture capitalist and alumnus Jason Spievak, whose software company Invoca hires mostly Gaucho graduates, said the NVC Finals present a vital opportunity for investors to discover promising young potential startups.</p>\n<p>“There’s lots of great stuff coming out of UCSB, and the depth and scope of the engineering talent here compared to when I was in school has become very impressive,” Spievak said. “From a material science perspective, it’s now the number one school in the world.”</p>\n<p>According to Spievak, the NVC develops industry and job production for the benefit of the local and global community.</p>\n<p>“Locally, it creates jobs and it keeps people in Santa Barbara, which is a win,” Spievak said. “Globally there are those occasional technologies like Integrated Fluidics that truly have the potential to save a lot of lives and change the world, and those are innovations that are happening right here on campus.”</p>\n<p>Milo member and computer science graduate student Daniel Imberman said his startup is already in talks with an incubator featuring a technology host angel, and that all his group members are interested in moving the business forward.</p>\n<p>“The high point was the second we got that first working trial,” Imberman said. “Up until then I was just kind of not sure what we were doing was going to amount to anything, but once I saw that data chart it was like, ‘Oh my god. We actually have something.’”</p>\n<p>According to Imberman, participating in the NVC has allowed him to gain knowledge and experience that transcends traditional business and technology curriculum.</p>\n<p>“I’ve learned more and worked more in the past three months than I have I the past two years,” Imberman said. “I’ve had daily 8 a.m. to midnight days. If I wasn’t in school, I was working on this all the time. Honestly even if we hadn’t won a dime I would’ve walked out with so much more business knowledge and just ready to attack the world based on this one competition.”</p>\n<p>Fourth year biochemistry major and Chemogaurd member Letitia Mueller, the only female finalist to win an award in the tech-driven category, said if her startup receives seed capital, it could “open up a whole new world of how to do chemotherapy.”</p>\n<p>“If we have a way to make chemo more effective, we could have people survive through chemo with higher dosages,” Mueller said. “If they can tolerate them or avoid the drugs they can’t tolerate, then that makes chemo more efficient and improves quality of life and reduces costs.”</p>\n<p>Mueller is one of three females to have made it to the NVC finals, along with graduate student in the Bren School of Environmental Science Megan Miranda of Slightly Nutty, who tied for the second place award in the market-pull category, and psychology graduate student Katie Koehler of Insiight, who won first place in market-pull.</p>\n<p>According to Mueller, the lack of female representation in the competition reflects an overall male-dominant trend in the tech industry that she hopes to see eliminated in years to come.</p>\n<p>“People sometimes don’t understand the gravity of the situation when you are one of the few women in your field.” Mueller said. “That being said, it’s really important for women to realize that there are so many avenues you can go down that haven’t been travelled by females. Why is the NVC 90 percent male dominated? It shouldn’t have to be that way.”</p>\n<p><em>[<strong>Correction:</strong> A previous version of this article incorrectly stated that Letitia Mueller was the only female to win the New Venture Competition Finals. In actuality, finalists Megan Miranda of Slightly Nutty and Katie Koehler of Insiight won awards in the “market-pull” category. </em></p>\n<p><em>Also, a previous version of this article incorrectly quoted Jason Spievak as referencing to a company called Asta Fluidics instead of the correct </em><em>Integrated Fluidics. The </em>Daily Nexus<em> apologizes for these errors.]</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63713\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63713\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-22/students-win-new-venture-competition-with-bac-monitor-startup/","id":2724,"author":{"id":158,"name":"Carissa Quiambao"},"related":[2723,2722,2721],"comments":[],"followers":[]},{"title":"Scientists Debate Harms and Benefits of GMOs","category":"News","subcategory":"Campus","publish_date":"2015-05-21T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"UCSB Arts & Lectures and the Interdisciplinary Humanities Center (IHC) co-hosted a debate titled “The 2015 Arthur N. Rupe Debate: The Use of Genetically Modified Organisms in Food” at Campbell Hal...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63675\" style=\"width: 610px\" class=\"wp-caption alignleft\"><img aria-describedby=\"caption-attachment-63675\" data-attachment-id=\"63675\" data-permalink=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/dr-angelika-hilbeck-campbell-hall-may-20th-2015/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?fit=600%2C401&amp;ssl=1\" data-orig-size=\"600,401\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.2\",\"credit\":\"Hari Patel\\/Daily Nexus\",\"camera\":\"NIKON D600\",\"caption\":\"Dr. Angelika Hilbeck, Campbell Hall, May 20th, 2015.\",\"created_timestamp\":\"1432153594\",\"copyright\":\"Hari Patel\\/Daily Nexus\",\"focal_length\":\"185\",\"iso\":\"1600\",\"shutter_speed\":\"0.003125\",\"title\":\"Dr. Angelika Hilbeck, Campbell Hall, May 20th, 2015.\",\"orientation\":\"0\"}' data-image-title=\"Dr. Angelika Hilbeck, Campbell Hall, May 20th, 2015.\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?fit=600%2C401&amp;ssl=1\" class=\"wp-image-63675 size-full\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?resize=600%2C401\" alt=\"Dr. Angelika Hilbeck Hari Patel/Daily Nexus\" width=\"600\" height=\"401\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?w=600&amp;ssl=1 600w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-2.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-63675\" class=\"wp-caption-text\">Dr. Angelika Hilbeck. <em>Hari Patel/Daily Nexus</em></p></div>\n<div id=\"attachment_63674\" style=\"width: 610px\" class=\"wp-caption alignright\"><img aria-describedby=\"caption-attachment-63674\" data-attachment-id=\"63674\" data-permalink=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/dr-pamela-c-ronald-campbell-hall-may-20th-2015/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?fit=600%2C401&amp;ssl=1\" data-orig-size=\"600,401\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.2\",\"credit\":\"Hari Patel\\/Daily Nexus\",\"camera\":\"NIKON D600\",\"caption\":\"Dr. Pamela C. Ronald, Campbell Hall, May 20th, 2015.\",\"created_timestamp\":\"1432153227\",\"copyright\":\"Hari Patel\\/Daily Nexus\",\"focal_length\":\"200\",\"iso\":\"1600\",\"shutter_speed\":\"0.003125\",\"title\":\"Dr. Pamela C. Ronald, Campbell Hall, May 20th, 2015.\",\"orientation\":\"0\"}' data-image-title=\"Dr. Pamela C. Ronald, Campbell Hall, May 20th, 2015.\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?fit=600%2C401&amp;ssl=1\" class=\"wp-image-63674 size-full\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?resize=600%2C401\" alt=\"Dr. Pamela C. Ronald. Hari Patel/Daily Nexus\" width=\"600\" height=\"401\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/GMO_Hari-Patel-1.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-63674\" class=\"wp-caption-text\">Dr. Pamela C. Ronald.<em> Hari Patel/Daily Nexus</em></p></div>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>UCSB Arts &amp; Lectures and the Interdisciplinary Humanities Center (IHC) co-hosted a debate titled “The 2015 Arthur N. Rupe Debate: The Use of Genetically Modified Organisms in Food” at Campbell Hall Wednesday night to deliberate the harms and benefits of genetically modified organisms (GMOs).</p>\n<p>GMOs are living organisms whose genetic codes have been artificially manipulated through the use of various genetic engineering techniques. UC Davis plant pathology professor Pamela C. Ronald and Swiss Federal University senior scientific researcher in the Institute of Integrative Biology Angelika Hilbeck debated on whether the use of GMOs in food is safe, and the role GMOs play in world hunger and poverty. The Chronicle of Higher Education senior reporter Paul Voosen moderated the debate.</p>\n<p>IHC director and German and Slavic studies professor Susan Derwin said the use of GMOs exemplifies the idea of “Anthropocene,” or human influence on the planet.</p>\n<p>“Humans now have the ability to manipulate nature in radical ways and for their own ends,” Derwin said. “In the epic of the Anthropocene, as weather becomes more extreme and as the global population grows, the manipulation of nature promises to increase crop yields and diversify the places where food can be grown.”</p>\n<p>According to Ronald, genetic engineering is neither new nor dangerous and inventions such as “golden rice,” a strain of rice supplemented with vitamin A created through genetic engineering, can be used to combat world hunger.</p>\n<p>“After forty years of commercial use in medicine, cheeses, wine and plants, there has not been a single instance of harm to human health or the environment,” Ronald said. “Instead of worrying about the genes that are in our food … we must ask if farmers and rural communities can thrive and be sure that everyone can afford the food.”</p>\n<p>Ronald said the public’s fear of genetic engineering is due to misinformation, and is a major obstacle in distributing golden rice to rural communities.</p>\n<p>“500,000 children go blind every year because of lack of vitamin A,” Ronald said. “Half of these children will die. We have a lot of fear mongering and what really distresses me is that it is preventing this rice from reaching the children. It’s something we take for granted every day.”</p>\n<p>According to Hilbeck, hunger and vitamin A deficiency in developing countries are part of a much larger issue that genetic engineering alone cannot fix.</p>\n<p>“The kids die because they are poor. We have to address causes of hunger and poverty,” Hilbeck said. “If you don’t address the underlying causes for hunger and poverty, singling out an individual issue will not help. We are helping those kids already by giving them vitamin A pills right now.”</p>\n<p>Hilbeck said the best solution to ending world hunger and poverty is a system that can sustain itself for a long period of time.</p>\n<p>“We need the best solution, the most sustainable solution — not focus on which technology that is — I personally don’t care what technology that is,” Hilbeck said. “I want the problem to be solved, but in a system that in itself functions and works so we can have it run for hundreds of years.”</p>\n<p>Second-year chemical engineering major Christopher Nyambura said shifting industrial agriculture to a more efficient system should be the main focus.</p>\n<p>“We need to start changing the way we farm — changing the way we grow crops, meat, all these things, — before we start introducing GMOs,” Nyambura said. “People are dying, people don’t have food. That’s what we need to tackle —  people getting fed and how we can do it as efficiently as possible, as best as possible.”</p>\n<p>According to Hilbeck, debating over GMOs lead to discussions about greater topics such as industrialized agricultures and the dangers associated with it.</p>\n<p>“It’s about much more than GMOs,” Hilbeck said. “They stand in for a system that requires change and if that’s what it takes — GMOs — then that’s what it is. They trigger this debate. As long as we keep arguing, and we keep talking respectfully to each other, listening to each other and try to accommodate, we can move this place forward and progress.”</p>\n<p> </p>\n<p>A version of this story appeared on page 4 of May 21, 2015’s print edition of the <em>Daily Nexus.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63680\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63680\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-21/scientists-debate-harms-and-benefits-of-gmos/","id":2725,"author":{"id":157,"name":"Kendra Witt"},"related":[2724,2723,2722],"comments":[],"followers":[]}]},"__N_SSG":true}