{"pageProps":{"article":{"title":"Open Forum To Discuss Sexual Assault Policy","category":"News","subcategory":"Campus","publish_date":"2015-05-28T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"The “It’s Not On Us, It’s On You” campaign led by survivors of sexual assault Alejandra Melgoza, Lexi Weyrick and Melissa Vasquez will host an open forum discussion between students and univer...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63979\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1728342679\" data-slb-internal=\"0\" data-slb-group=\"63917\"><img aria-describedby=\"caption-attachment-63979\" data-attachment-id=\"63979\" data-permalink=\"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/protest-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?fit=2000%2C1331&amp;ssl=1\" data-orig-size=\"2000,1331\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"4.5\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1431524572\",\"copyright\":\"\",\"focal_length\":\"14\",\"iso\":\"2000\",\"shutter_speed\":\"0.025\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Sit in\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-63979\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1-1024x681.jpg?resize=600%2C399\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"399\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?resize=1024%2C681&amp;ssl=1 1024w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?resize=250%2C166&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?w=2000&amp;ssl=1 2000w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/06/Protest-1.jpg?w=1776 1776w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63979\" class=\"wp-caption-text\">Students and administrators will come together on Friday to discuss demands made by students. <em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Students and administrators will come together on Friday to discuss demands made by students during the May 13 sit-in.</p>\n<p>The “It’s Not On Us, It’s On You” campaign led by survivors of sexual assault Alejandra Melgoza, Lexi Weyrick and Melissa Vasquez will host an open forum discussion between students and university administrators on Friday in the State Street room of the University Center at 10 a.m.</p>\n<p>Melgoza, Weyrick and Vasquez led a 13-hour sit-in at Chancellor Henry T. Yang’s office on May 13 to demand specific policies to improve the university’s handling of sexual assault cases. One of the stipulations made in the discussion that concluded the sit-in was an agreement to hold a public forum which Yang would attend. Interim Vice Chancellor of Student Affairs Mary Jacob, Senior Associate Dean of Student Life Debbie Fleming and additional administrators, including members of the Office of Judicial Affairs, have also committed to participate in the forum.</p>\n<p>The forum will include clarification of the demands and further discussion of plans to meet the students’ requests. On the event Facebook page, organizers cautioned those who plan to attend that administrators are mandatory reporters, meaning students should not share details of their experiences of sexual violence or sexual assault if they do not wish to “inadvertently begin an investigation.”</p>\n<p>Gaucho Consent Co-Chair, Take Back the Night Executive Board member and second-year sociology major Lexi Weyrick said the forum will provide students an opportunity to voice their concerns to administrators on issues related to sexual violence and sexual assault.</p>\n<p>“It’s a good setup for students to be able to air their grievances, for administration to see that this isn’t just about the three of us, to make sure that people are aware of the implications of sexual assault and sexual violence on the campus as a whole,” Weyrick said.</p>\n<p>Second-year Chican@ studies and history of public policy double major Alejandra Melgoza said the event aims to provide students the opportunity to present their concerns on sexual violence and sexual assault to Yang in person.</p>\n<p>“It is an open forum for students to voice their concerns to Chancellor Yang and also to voice their concerns about our demands and help brainstorm ideas on how to further improve them or actually get them to happen,” Melgoza said. “It is just really a meeting for students to come talk to the Chancellor about their concerns — since it is pretty hard to get a meeting with him, we figured this would be a good way to have students talk to him face to face.”</p>\n<p>Fleming said while Yang is often limited in the amount of time he can speak with students in person about their concerns, other members-of the administration frequently work one-on-one with students.</p>\n<p>“The Chancellor has a pretty full calendar, and so it is challenging sometimes for students,” Fleming said. “Certainly, a lot of us at Students Affairs spend a lot of time working with students directly.”</p>\n<p>Fleming also said administrators have discussed plans to increase the amount of communication between students and administrators with It’s Not On Us, It’s On You leaders.</p>\n<p>“What we probably need is some more regular opportunities to hear from students,” Fleming said. “We’ve talked about establishing more of a permanent group that students can be part of that would meet just on a regular basis, maybe quarterly, with those of us that work in these areas to share.”</p>\n<p>First-year global studies major Catt Phan said she spent six hours at the sit-in and plans to attend the forum because she believes it is “crucial” for students to hold the university accountable for the ways they have handled sexual assault in past years.</p>\n<p>“It seems like admin and judicial affairs care more about our student fees instead of our sanity and bodies,” Phan said in an email. “It’s up to us to have productive dialogue because if change doesn’t happen now, it’s not going to happen later.”</p>\n<p>Phan said she believes sexual violence may be the biggest issue on campus and in Isla Vista and the university needs to better educate students on the importance of consent.</p>\n<p>“With the reputation of a ‘party school,’ there is a higher risk of sexual assault and unfortunately not enough people are educated about the sexual violence issues,” Phan said in an email. “We need to educate people and de-stigmatize sexual assault … the idea of consent needs to be further emphasized and survivors need to feel safe enough to come forth with their stories.”</p>\n<p>Associated Students External Vice President of Local Affairs office fellow and first year psychology major Alissa Gomez said she hopes to see a large number of students at the event because she believes sexual violence and sexual assault are issues affecting students both on campus and on a national level.</p>\n<p>“I’m hoping that people will feel free to voice their opinions as needed and that they’ll get to say what they feel is needed to their administrators,” Gomez said. “We have the ability as college students to make this change not only on our campus, but on campuses across the nation.”</p>\n<p>Weyrick said while she is uncertain how many students will turn out to participate in the discussion, the campaign as a whole has received positive feedback.</p>\n<p>“We’ve had a lot of interest. I feel like there will be a good amount of people, even if it’s just even to like critique our demands I feel like there will be turnout,” Weyrick said. “Also, to address Chancellor Yang, having that opportunity, I think, will get turnout.”</p>\n<p>Last Thursday, Melgoza, Vasquez and Weyrick planned to speak in public forum at the UC Board of Regents meeting to present their demands to UC President Janet Napolitano and Governor Jerry Brown, but were unable to attend due to flight cancelations and delays, according to Weyrick.</p>\n<p>“We got to the airport in plenty of time to catch our flight, but it was overbooked and so they wouldn’t let us on the plane even though we had reserved seats,” Weyrick said. “So that started just a snowball effect — we couldn’t get on the standby for the second, our third flight got cancelled, the fourth flight was delayed an hour.”</p>\n<p>Weyrick said although she, Melgoza and Vasquez were unable to attend the meeting, they still plan to make their demands known at a system-wide level.</p>\n<p>“We were unable to attend the Regents meeting, but we do still have a meeting with [UC Senior Vice President and Chief Compliance and Audit Officer] Sheryl Vacca in the works, so we’re still meeting with her, regardless,” Weyrick said. “We have a guarantee of a meeting, we are just scheduling it now. It will definitely be in the next couple of weeks.”</p>\n<p>A version of this story appeared on page 1 of the Thursday, May 28, 2015 print issue of the <em>Daily Nexus</em>.</p>\n<p>[Correction: This article originally stated Alejandra Melgoza is a second-year Chican@ studies and political science double major. However, Melgoza is a second year double majoring in Chican@ studies and history of public policy.]</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63917\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63917\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-28/open-forum-to-discuss-sexual-assault-policy/","id":2735,"author":{"id":96,"name":"Megan Mineiro"},"related":[2734,2733,2732],"comments":[],"followers":[]},"author":{"id":96,"name":"Megan Mineiro","biography":"Not available","articles":[2382,2386,2475,2567,2730,2735,2797,2823,2909,2948,2981,2990,3586,3605,3870,3895,3915,4407,4654,4682,4799],"portrait":"Not available"},"related":[{"title":"One Year Later: Candlelit Vigil and March Remembers Students Lost","category":"News","subcategory":"Campus","publish_date":"2015-05-24T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?resize=600%2C399&ssl=1","description":"Storke Tower rang out six times Saturday evening to begin a moment of silence as part of the Candlelit Vigil and March held to commemorate the students lost in the events of May 23 last year. UC Santa...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63745\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg\" data-slb-active=\"1\" data-slb-asset=\"1601361702\" data-slb-internal=\"0\" data-slb-group=\"63790\"><img aria-describedby=\"caption-attachment-63745\" data-attachment-id=\"63745\" data-permalink=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/2015-vigil_lorenzo-basilio-2/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?fit=600%2C399&amp;ssl=1\" data-orig-size=\"600,399\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2.8\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1432411065\",\"copyright\":\"\",\"focal_length\":\"14\",\"iso\":\"2500\",\"shutter_speed\":\"0.05\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"2015 Vigil_Lorenzo Basilio-2\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?fit=600%2C399&amp;ssl=1\" class=\"size-full wp-image-63745\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?resize=600%2C399\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"399\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?w=600&amp;ssl=1 600w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-2.jpg?resize=250%2C166&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63745\" class=\"wp-caption-text\">Students and residents gather at People’s Park to raise blue lights in honor of six students lost in the events of May 23 last year. <em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Storke Tower rang out six times Saturday evening to begin a moment of silence as part of the Candlelit Vigil and March held to commemorate the students lost in the events of May 23 last year.</p>\n<p>UC Santa Barbara students, faculty and staff, law enforcement, local government officials and I.V. community members gathered in Storke Plaza alongside the victims’ families to remember George Chen, Katie Cooper, James Hong, Chris Martinez, David Wang and Veronika Weiss. Following a dance piece titled <em>Not One More</em> and an a capella performance of “Amazing Grace,” participants walked to People’s Park carrying Blunite blue LED lights.</p>\n<p>Associated Students Program Board organized the night’s event, which included an open mic in the park for speakers who wished to share memories of the victims. The vigil concluded with a video screening, paying tribute to the students lost and highlighting the solidarity demonstrated within the I.V. community following the tragedy.</p>\n<p>Chancellor Henry T. Yang said UCSB will continue to honor the lives lost on May 23 last year.</p>\n<p>“Tragedy will not tear us apart but bring us closer together,” Yang said. “We will never forget the loss we suffered a year ago, but we remember not just with sadness, but with fondness.”</p>\n<p>UCSB has established six unique memorial scholarships in honor of each of the victims, according to Yang.</p>\n<p>“We can make their lives more meaningful by the way we choose to live our own, and we can make the lives of others more meaningful in the ways we choose to honor them,” Yang said. “We will uphold their memory now and in years to come with six individual memorial scholarships … individualized to reflect their character and their passions.”</p>\n<p>Academic Senate chair and sociology professor Kum-Kum Bhavnani read a letter on behalf of the Hong family which stated the need for a cultural shift away from violence.</p>\n<p>“James believed in a world without evil, a world where tragic instances like this would never occur. We hope it will become a reality,” the Hong family stated in the letter. “Parenting and mental well-being should be focused on more in family, school and society. We should put more emphasis on moral values and teach kids to see the good in others and respect others.”</p>\n<p>Richard Martinez, father of Chris Martinez, said those affected by the tragedy should continue to live their lives as a testament to those lost.</p>\n<p>“For our absent brothers, daughters, sisters and friends, for their sake we must also live,” Martinez said. “We can mourn for those we lost, and we can go on living. There is no contradiction in this. We must remember that making something of this life is not an affront to the dead.”</p>\n<p>Alan Martinez, uncle of Chris Martinez, said he continues to mourn as memories of the tragedy resurface.</p>\n<p>“I’ve been a little afraid of being in a world where people expect me to be over it after a year,” Martinez said. “Every time I forget it, if it’s for a few minutes or a few hours, remembering it again is like going through it again. Every time you forget about it and remember it you have to accept it again.”</p>\n<div id=\"attachment_63764\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg\" data-slb-active=\"1\" data-slb-asset=\"1244942648\" data-slb-internal=\"0\" data-slb-group=\"63790\"><img aria-describedby=\"caption-attachment-63764\" data-attachment-id=\"63764\" data-permalink=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/2015-vigil_lorenzo-basilio-21/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?fit=600%2C399&amp;ssl=1\" data-orig-size=\"600,399\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2.8\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1432413353\",\"copyright\":\"\",\"focal_length\":\"70\",\"iso\":\"2500\",\"shutter_speed\":\"0.02\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"2015 Vigil_Lorenzo Basilio-21\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?fit=600%2C399&amp;ssl=1\" class=\"size-full wp-image-63764\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?resize=600%2C399\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"399\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?w=600&amp;ssl=1 600w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-21.jpg?resize=250%2C166&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63764\" class=\"wp-caption-text\">Isla Vista residents created a memorial in front of IV Deli Mart in remembrance of Chris Martinez. <em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Kelly Wang, mother of George Chen, said she hopes to see social and political changes prevent future shootings.</p>\n<p>“I pray there will be an end of the senseless killing of innocents,” Wang said. “Murderers must be punished with no excuse, no exception, and no reservation. As a victim family, we hope that this horrible massacre was a wake up call and no time shall be wasted in striving for future prevention.”</p>\n<p>Counseling and Psychological Services director Jeanne Stanford said she was glad to see the victims’ families in attendance at the memorial event.</p>\n<p>“They were able to absorb the love that this community has and to share with us how they’re doing, and I think that’s important for the students to know,” Stanford said.</p>\n<p>Computer science professor Phillip Conrad said he taught George, James and David in CMPSC 40: Foundations of Computer Science. According to Conrad, the three students were well-liked and he has positive memories of them sitting in the front row of his class.</p>\n<p>“It is a convention, that when someone is taken from us, we only remember the good things, we only speak of the good things. But as I told James, George and David’s parents today, in their case there are only good things to say,” Conrad said. “People only said good things of George, David and James when they were with us, because that’s all there was to say.”</p>\n<blockquote><p>Tragedy will not tear us apart but bring us closer together. We will never forget the loss we suffered a year ago, but we remember not just with sadness, but with fondness. – Chancellor Henry T. Yang</p></blockquote>\n<p>Stephanie Barlev, Weiss’ water polo teammate of four years, said a quote from Weiss inspired her to speak during open mic.</p>\n<p>“I would like share it with everyone else, ‘If I could live my life over again, I wouldn’t change anything … I am happy with my life.’ I ask that everyone live like Veronika Weiss did,” Barlev said. “Living every second with the friends closest to you, being spontaneous and laughing obnoxiously.”</p>\n<p>Joni Kent, aunt of Cooper, said the lights at the memorial event reminded her of Cooper’s personality.</p>\n<p>“Katie was a light,” Kent said. “She would have absolutely loved this.”</p>\n<p>Second-year Santa Barbara City College student Kyle Sullivan said he comforted Cooper and Weiss in their final moments.</p>\n<p>“They were so beautiful even in their last moments. I did everything that I could to make their passing from this life to the next, as comfortable and as painless as possible,” Sullivan said.</p>\n<p>Sullivan also said having experienced the May 23 shooting, he believes individuals should work to improve gun safety.</p>\n<p>“I witnessed firsthand the violence that guns can cause,” Sullivan said. “This will continue until we speak up and change things. I want my children to be able to walk around with peace of mind, knowing they will not be shot down in the street.”</p>\n<div id=\"attachment_63786\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg\" data-slb-active=\"1\" data-slb-asset=\"1440456052\" data-slb-internal=\"0\" data-slb-group=\"63790\"><img aria-describedby=\"caption-attachment-63786\" data-attachment-id=\"63786\" data-permalink=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/2015-vigil_lorenzo-basilio-43/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?fit=600%2C401&amp;ssl=1\" data-orig-size=\"600,401\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"2.8\",\"credit\":\"\",\"camera\":\"NIKON D610\",\"caption\":\"\",\"created_timestamp\":\"1432411648\",\"copyright\":\"\",\"focal_length\":\"200\",\"iso\":\"3200\",\"shutter_speed\":\"0.00625\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"2015 Vigil_Lorenzo Basilio-43\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?fit=600%2C401&amp;ssl=1\" class=\"wp-image-63786 size-full\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?resize=600%2C401\" alt=\"Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"401\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/05/2015-Vigil_Lorenzo-Basilio-43.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-63786\" class=\"wp-caption-text\">Students and I.V. residents participate in a memorial walk from Storke Plaza to People’s Park, passing through Pardall Tunnel<em>. Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>Fourth-year communication and sociology double major Christina Laskorunsky said she felt the I.V. community was united through the event.</p>\n<p>“I thought it was so touching that not just the school, but every business in I.V. sort of stopped what they were doing during the vigil,” Laskorunsky said. “Coming together with your friends, people you’ve just met, people you’ve never met.”</p>\n<p>Second-year art and psychology major Sophia Barkhudarova said the vigil was inclusive for all attendees, even for first-year students who were not present last year during the shooting.</p>\n<p>“I have some friends that are freshmen too that didn’t experience it firsthand like some of us did, but we all came together anyways and it was a really good community movement,” Barkhudarova said.</p>\n<p>Fourth-year global studies major and A.S. Program Board commissioner Benjamin Simons said a united I.V. can make positive changes.</p>\n<p>“The community is looking for a change, and we all can do stuff together to make that change,” Simons said. “I think the safety of I.V. really relies upon the community coming together.”</p>\n<p>A.S. President and third-year history of public policy major Jimmy Villarreal said while I.V. is “moving forward” through remembrance events, individuals have different healing processes.</p>\n<p>“It’s an ongoing process. Everyone kind of heals at their own rates,” Villarreal said. “Some people are done, they’ve closed this chapter in their lives. Some people they’re only just beginning to think about this.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63790\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63790\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-24/one-year-later-students-remembered-in-candlelit-vigil-and-march/","id":2733,"author":{"id":13,"name":"Staff Report"},"related":[2732,2731,2730],"comments":[],"followers":[]},{"title":"Speaker Gives Talk Against Same-Sex Marriage","category":"News","subcategory":"Campus","publish_date":"2015-05-27T07:00:00.000Z","full_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?resize=980%2C647&ssl=1","description":"UCSB Anscombe Society held its inaugural lecture Tuesday night at Buchanan Hall, hosting former George Mason University economics professor and Ruth Institute president and founder Jennifer Roback Mor...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63824\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63824\" data-attachment-id=\"63824\" data-permalink=\"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/marriage_alex-payne-1/\" data-orig-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?fit=2000%2C1333&amp;ssl=1\" data-orig-size=\"2000,1333\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5.6\",\"credit\":\"\",\"camera\":\"Canon EOS REBEL T3\",\"caption\":\"\",\"created_timestamp\":\"1432622582\",\"copyright\":\"\",\"focal_length\":\"55\",\"iso\":\"1600\",\"shutter_speed\":\"0.01\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Marriage_Alex Payne-1\" data-image-description=\"\" data-medium-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?fit=888%2C591&amp;ssl=1\" class=\"wp-image-63824\" src=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?resize=600%2C400\" alt=\"Alexander Payne/Daily Nexus\" width=\"600\" height=\"400\" srcset=\"https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?w=2000&amp;ssl=1 2000w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?resize=250%2C167&amp;ssl=1 250w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?resize=1024%2C682&amp;ssl=1 1024w, https://i1.wp.com/dailynexus.com/wp-content/uploads/2015/05/Marriage_Alex-Payne-1.jpg?w=1776 1776w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-63824\" class=\"wp-caption-text\">Jennifer Roback Morse gave a talk Tuesday night detailing the argument against same-sex marriage. <em>Alexander Payne/Daily Nexus</em></p></div>\n<p>UCSB Anscombe Society held its inaugural lecture Tuesday night at Buchanan Hall, hosting former George Mason University economics professor and Ruth Institute president and founder Jennifer Roback Morse to present arguments against same-sex marriage in a talk titled “Same-Sex Marriage: Why Not?”</p>\n<p>Anscombe Society aims to define marriage as “the exclusive, monogamous union of a man and a woman and its role as an institution which is necessary for the healthy family, and thus for a healthy society” and promotes traditional family values. Morse argued against same-sex marriage by outlining values of heterosexual unions. Prior to the talk, members of the queer community chanted inside the lecture hall to protest the ideas to be presented by Morse.</p>\n<p>According to Morse, non-traditional marriage negatively affects how children connect to parents.</p>\n<p>“The marriage debate is really about children; all the other issues you hear about can be handled some other way than re-defining marriage,” Morse said. “If we’re going to re-define marriage, we’re somehow re-defining the institution that attaches one generation to another.”</p>\n<p>Morse said forms of “third-party reproduction” like surrogacy are “structural injustices,” because they separate children from their biological parents.</p>\n<p>“Kids need and deserve their own parents and same-sex marriage will enshrine into law the opposite. Same-sex marriage will require the law to say that it’s a myth that kids need their own mothers and fathers,” Morse said.</p>\n<p>Anscombe Society president and third-year philosophy major Carlos Flores said the debate on same-sex marriage often lacks important arguments favoring heterosexual unions.</p>\n<p>“In particular, many who support same-sex marriage seem to have never heard the case for why same-sex marriage ought to not be accepted,” Flores said. “They have accepted straw men which they easily knock down.”</p>\n<p>According to Morse, same-sex marriage “victimizes” people in unexpected ways.</p>\n<p>“I get that we’re going to have genderless marriage soon, but I just want to say there are going to unanticipated consequences,” Morse said.</p>\n<p>Flores said while the talk revealed “worthwhile reasons” to oppose same-sex marriage, he doubts those in favor will change their mind.</p>\n<p>“Because people have very strong feelings on the topic of same-sex marriage, often due to personal struggles,” Flores said. “I think it is unrealistic to expect anyone firmly in support of same-sex marriage to change their mind.”</p>\n<p>Second-year communication and feminist studies double major Kevin Tang participated in the protest and said Morse’s argument ignores the importance of love in a family unit.</p>\n<p>“She cares so much about traditional family structures that I feel she leaves out the most important aspect of a true family, which is love and support, and I believe that our community is a family that provides exactly what her talk lacked,” Tang said.</p>\n<p>Fourth-year earth science major Julian Consoli said he opposes same-sex marriage for religious reasons but did not feel Morse presented well-constructed arguments.</p>\n<p>“I think the basis for her arguments are in religion, in God — which I actually agree with — but I don’t think she was really able to present those really clearly. I was a little disappointed,” Consoli said.</p>\n<p>Consoli also said it is important for “liberal schools” that largely support gay marriage to consider other views.</p>\n<p>“I feel like we should hear other people’s opinions, so I think that’s very important so I did appreciate that. Instead of always butting heads, we should be able to come together and discuss these things,” Consoli said. “I think it’s civil of us.”</p>\n<p> </p>\n<p>[Correction: This article originally stated A.S. Queer Commission protested outside the lecture hall where the event took place. Some of the students involved in the protest were members of the queer community, however were not protesting in affiliation with the commission. In addition, the protestors were not escorted out of the event by Community Service Officers (CSOs), but left on their own accord.]</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63835\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63835\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-27/speaker-gives-talk-against-same-sex-marriage/","id":2734,"author":{"id":154,"name":"Christopher Chen"},"related":[2733,2732,2731],"comments":[],"followers":[]},{"title":"Talk Examines Military, University Sexual Assault","category":"News","subcategory":"Campus","publish_date":"2015-05-22T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?resize=355%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?resize=600%2C400&ssl=1","description":"The Campus Advocacy Resources & Education office hosted a lecture on military sexual trauma (MST) by assistant professor at the USC School of Social Work Kristen Zalesky in the Flying A room Thursday ...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_63708\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-63708\" data-attachment-id=\"63708\" data-permalink=\"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/military_paris-cullen-2/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?fit=600%2C400&amp;ssl=1\" data-orig-size=\"600,400\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5.6\",\"credit\":\"\",\"camera\":\"Canon EOS 1100D\",\"caption\":\"\",\"created_timestamp\":\"1432206640\",\"copyright\":\"\",\"focal_length\":\"55\",\"iso\":\"1000\",\"shutter_speed\":\"0.02\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Military\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?fit=600%2C400&amp;ssl=1\" class=\"size-full wp-image-63708\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?resize=600%2C400\" alt=\"Paris Cullen/Daily Nexus\" width=\"600\" height=\"400\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?w=600&amp;ssl=1 600w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/05/Military_Paris-Cullen-2.jpg?resize=250%2C167&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-63708\" class=\"wp-caption-text\">USC professor Kristen Zaleska spoke Thursday about the prevalence of sexual assault within the armed forces, and the similarities and differences between sexual assault in the military and on university campuses.<em> Paris Cullen/Daily Nexus</em></p></div>\n<p>The Campus Advocacy Resources &amp; Education office hosted a lecture on military sexual trauma (MST) by assistant professor at the USC School of Social Work Kristen Zalesky in the Flying A room Thursday morning.</p>\n<p>Zalesky’s talk highlighted the prevalence of sexual assault in the military and drew parallels between the experiences of civilian sexual assault survivors and sexual assault survivors serving in the military. Zalesky detailed the incidence of MST compared to civilians and discussed stark similarities and contrasts between sexual assault in the military and in civilian life. About a dozen students, primarily interns in the CARE advocacy office, attended the lecture.</p>\n<p>According to Zalesky, there is a parallel between sexual assault at universities and within the military. According to Zaleski, one in two women and one in 12 men experience MST in the course of their service.</p>\n<p>“When you are in a Greek system or university system you have your own reporting process,” Zalesky said. “You have your own police department you have your own way of tracking sexual trauma and you have a culture in which you are kind of confined, and when we’re talking about the military, we’re talking about that in the same way.”</p>\n<p>Zalesky said the military and UC face similar difficulties in addressing sexual assault, and neither are particularly effective.</p>\n<p>“[UC system’s framework] rarely results in a conviction of the assailant and it’s also true for the military,” Zalesky said. “This university culture, it’s not that different from someone who is 18 and chooses military service, in terms of the sexual boundaries.”</p>\n<p>Zalesky also said the common ideas surrounding how sexual assault occurs usually do not match reality.</p>\n<p>“These are the typical assumptions we make about sexual assault: it’s a random guy in a dark alley; it’s someone we don’t know; they have a weapon,” Zalesky said. “Most often, people who are raped are raped by somebody they have a trusting relationship with — it’s a family member, it’s a boyfriend, it’s an ex-boyfriend, it’s a best friend.”</p>\n<p>According to Zalesky, this difference between the idea of a typical perpetrators and the reality of who they usually are makes reporting more difficult.</p>\n<p>“That’s why when you look at rape reports it’s so hard to get somebody to report because it wasn’t so clear. He wasn’t wearing a mask in a dark alley as a stranger with a knife right? It was your best friend who you’ve partied with for a year and a half,” Zalesky said. “The reason that we hesitate to report sexual assaults is because we’re so confused because it doesn’t match up with the construct of what we imagined.”</p>\n<p>Zalesky also said those in the armed forces who report are typically required to stay in service, as leave for survivors is not granted most of the time, which makes avoiding assailants virtually impossible. For this and other reasons, sexual assault survivors in the military have fewer options than their civilian counterparts, Zalesky said.</p>\n<p>“From day one this is your brother, this is your sister right? We are a military family,” Zalesky said. “Even if you want to take time off, even if you want to go see your mom, you can’t because you signed this [enlistment] contract.”</p>\n<p>Zalesky also said the number of male survivors of MST are roughly equal to the number of female survivors — just over 300,000 survivors of both genders — but males are far less likely to report than females.</p>\n<p>“Men are being brutalized as often during military service, but women come forward and it’s more socially acceptable to be a woman that’s been raped than a man that’s been raped … we have an epidemic of men who aren’t talking about their sexual assault.”</p>\n<p>Zalesky closed with a brief discussion on advocacy and how to help survivors, followed by a question and answer session with the audience. Zalesky said a more effective strategy for combating MST is not necessarily to encourage women to “not get raped” but rather encourage a culture of bystander intervention.</p>\n<p>Third-year global studies and feminist studies double major Clair Breen said student engagement in issues related to MST is important for continuing advocacy on the problem.</p>\n<p>“I think anything we can do is awesome, especially as college students,” Breen said. “Advocacy work is hard though because it’s hard to see a difference.”</p>\n<p>Breen also said her main take-away from the presentation was related to the difficulties MST survivors face in addressing their assaults.</p>\n<p>“I took away that it’s very hard to report in the military — that it’s a really prevalent issue,” Breen said.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63730\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63730\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-22/talk-examines-military-university-sexual-assault/","id":2732,"author":{"id":156,"name":"Peter Mounteer"},"related":[2731,2730,2729],"comments":[],"followers":[]}]},"__N_SSG":true}