{"pageProps":{"article":{"title":"Guest Professor Lectured on Vaccination and Public Policy","category":"News","subcategory":"Campus","publish_date":"2015-04-30T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"Northwestern University economics professor Charles Manski gave a lecture titled “Mandating Vaccination with Unknown Indirect Effects” to outline different methods of making public policy decision...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_62946\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg\" data-slb-active=\"1\" data-slb-asset=\"160084902\" data-slb-internal=\"0\" data-slb-group=\"62960\"><img aria-describedby=\"caption-attachment-62946\" data-attachment-id=\"62946\" data-permalink=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/manski_vivian-bui-2/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=600%2C397&amp;ssl=1\" data-orig-size=\"600,397\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"1.4\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1430318787\",\"copyright\":\"\",\"focal_length\":\"50\",\"iso\":\"280\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Manski_Vivian Bui-2\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=250%2C165&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=600%2C397&amp;ssl=1\" class=\"size-full wp-image-62946\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=600%2C397\" alt=\"Vivian Bui/Daily Nexus\" width=\"600\" height=\"397\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=250%2C165&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=500%2C330&amp;ssl=1 500w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-62946\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>Northwestern University economics professor Charles Manski gave a lecture titled “Mandating Vaccination with Unknown Indirect Effects” to outline different methods of making public policy decisions regarding compulsory vaccinations.</p>\n<p>Manski is an elected member of the National Academy of Sciences and an econometrician in the field of rational choice theory, which involves using applied economics to make decisions. The talk focused on how to make public policy decisions using incomplete data and information, specifically whether vaccinations in the U.S. should be decentralized or compulsory.</p>\n<p>According to Manski, welfare economics involves a “social planner” who makes beneficial decisions on behalf of the community and often has to make judgements with limited information, making it difficult for the planner to determine optimal choices for issues such as mandated vaccines.</p>\n<p>“So the kind of knowledge that’s assumed in the literature around social planning, that the planner actually knows everything you need to know in order to solve optimization problems — in the real world we don’t have that kind of knowledge,” Manski said. “We may know some of these things, but we don’t know all of it. It’s definitely going to be true with the vaccination problem.”</p>\n<blockquote><p>It’s a really hard thing to make policy decisions that are controversial like vaccine decisions when our knowledge about the effects of vaccines is incomplete. – Economics professor Peter Kuhn</p></blockquote>\n<p>Manski said elementary decision theory provides specific procedures for decision making using partial information and is a two part process that involves first eliminating the comparatively worse or “dominated” decision option and then determining a method of choosing a generally optimal or “undominated” option. Manski said he believes there are multiple ways of deciding which method is “dominated,” contrary to arguments that there exists one particular way to maximize optimality.</p>\n<p>“The whole point of decision theory is to try to have a kind of explicit procedures for making decisions with limited information,” Manski said. “The harder part — where there’s no agreement to this day — is how we are going to choose a dominated policy.”</p>\n<p>According to Manski, in a decentralized healthcare system such as that of the U.S. people do not consider the social and external consequences of their private medical decisions. This issue leads to government intervention in deciding voluntary or mandatory treatments, particularly vaccinations for contagious diseases.</p>\n<p>Manski said there is a lack of knowledge about the benefits of vaccinations despite the common belief that the more people who are vaccinated, the less chance of a disease.</p>\n<div id=\"attachment_62945\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62945\" data-attachment-id=\"62945\" data-permalink=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/manski_vivian-bui-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=600%2C397&amp;ssl=1\" data-orig-size=\"600,397\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5.3\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1430318602\",\"copyright\":\"\",\"focal_length\":\"66\",\"iso\":\"6400\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Manski_Vivian Bui-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=250%2C165&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=600%2C397&amp;ssl=1\" class=\"size-full wp-image-62945\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=600%2C397\" alt=\"Vivian Bui/Daily Nexus\" width=\"600\" height=\"397\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=250%2C165&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=500%2C330&amp;ssl=1 500w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-62945\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>Manski said the process of determining the social cost function of mandated vaccines uses a simple model that consists of two variables — the costs of getting sick and the costs of being vaccinated. Vaccination will likely lower the frequency of illness, but may also increase medical costs, lead to side effects and infringe on personal medical choices.</p>\n<p>“Mandatory vaccinations improve public health relative to decentralization [and] lowers the illness rate,” Manski said. “On the other hand, mandating vaccination means more people are going to get vaccinated, and that’s going to increase the cost of production of the vaccine, the vaccines may have some side effects, and then they have the real political issue of so called reducing personal freedom.”</p>\n<p>According to Manski, he used the simple model he constructed and applied econometrics to lay out multiple methods of making an optimal choice when determining whether to mandate vaccines with partial information.</p>\n<p>“I sought to assist decision making by juxtaposing several well-known criteria and comparing the policies they generate,” Manski said. “Whether a public health agency should use one of these or some other criterion to cope with uncertainty is ultimately a matter to be decided by the agency.”</p>\n<p>Economics professor Peter Kuhn said Manski effectively presented several options for making judgements on controversial issues like vaccination.</p>\n<p>“It’s a really hard thing to make policy decisions that are controversial like vaccine decisions when our knowledge about the effects of vaccines is incomplete,” Kuhn said. “Professor Manski gives us a good way of making decisions in that world and a way that is dispassionate and scientific and also respects the beliefs and values of everyone in society.”</p>\n<p>Economics professor Shelly Lundberg said Manksi’s talk shed light on how “tremendously important” it is to understand the constraints of public decision-making.</p>\n<p>“I think the paper is not so much vaccination,” Lundberg said. “It’s about dealing with the uncertainty when you’re making public policy decisions and how very difficult that is. I think we have to recognize more explicitly the limits of what we know.”</p>\n<p>A version of this story appeared on page 6 of the Thursday, April 30, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-62960\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-62960\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/","id":2776,"author":{"id":161,"name":"Cheryl Sun"},"related":[2775,2774,2773],"comments":[],"followers":[]},"author":{"id":161,"name":"Cheryl Sun","biography":"Not available","articles":[2342,2590,2757,2768,2776,2777,2834,2853,2878,3455,4655,4700,4749,4785],"portrait":"Not available"},"related":[{"title":"Senate Covers Funding Requests, 2015-2016 Budget","category":"News","subcategory":"Campus","publish_date":"2015-04-30T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"On Wednesday, the Associated Student Senate discussed proposals to fund student groups, stirring up controversy","content":"<div class=\"single-post-content\">\n            <h2>On Wednesday, the Associated Student Senate discussed proposals to fund student groups, stirring up controversy</h2>\n<div id=\"attachment_62942\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62942\" data-attachment-id=\"62942\" data-permalink=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/senate_lorenzo-basilio-1-6/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=600%2C399&amp;ssl=1\" data-orig-size=\"600,399\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.2\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1430337049\",\"copyright\":\"\",\"focal_length\":\"200\",\"iso\":\"2500\",\"shutter_speed\":\"0.004\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate_Lorenzo Basilio-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=600%2C399&amp;ssl=1\" class=\"size-full wp-image-62942\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?resize=600%2C399\" alt=\"Student senators try to keep themsleves entertained during last night’s meeting, during which they discussed monetary issues. Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"399\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?w=600&amp;ssl=1 600w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?resize=250%2C166&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-62942\" class=\"wp-caption-text\">Student senators try to keep themsleves entertained during last night’s meeting, during which they discussed monetary issues. <em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>The Associated Students Senate met Wednesday night in the Flying A room of the UCen to discuss how to spend the remainder of its unallocated budget for the 2014-2015 year.</p>\n<p>UCSB Active Minds and the Persian Student Group both requested funding for future events. Senate voted to fund Active Minds and denied the Persian Student Group’s request because it already received funding this school year.</p>\n<p>Co-president of UCSB Active Minds Lilia Goldenberg said the group will host guest speaker Meg Hutchinson and an open-mic night for students on May 20 to discuss the events of May 23 last year.</p>\n<p>“[Hutchinson is] a poet and a songwriter who uses yoga and meditation and suffers from bipolar disorder,” Goldenberg said. “We’re opening it up into an open mic night afterwards in light of the tragedy, so we want to bring out student artists and pretty much anyone who wants to express anything that they feel in regards to the tragedy.”</p>\n<blockquote><p>There should be exceptions to every rule for certain things, including things like sexual assault, mental health. There are some issues that are bigger than normal precedents and I think we should fully fund them. – A.S. CCS Collegiate Senator Liam Stanton</p></blockquote>\n<p>A.S. Senator and second-year economics and accounting major Steven Kwok said Senate should grant Active Minds’ request for $1,000 to fund the event, despite Senate’s precedent to not fund Office of Student Life (OSL) student groups.</p>\n<p>“I know we set a precedent not funding OSL groups, but because of the gravity of all things coming together next month I think we should grant this request,” Kwok said.</p>\n<p>A.S. CCS Collegiate Senator and second-year CCS physics major Liam Stanton said he agreed with Kwok that Senate should make an exception to the rule given the sensitivity of the issue.</p>\n<p>“There should be exceptions to every rule for certain things, including things like sexual assault, mental health,” Stanton said. “There are some issues that are bigger than normal precedents and I think we should fully fund them.”</p>\n<p>The Senate voted to grant the full $1,000 for the event.</p>\n<p>A.S. Chief Financial Officer and fourth-year psychology major Andre Theus said Senate should not fund the Persian Student Group’s request for $500 for food at the upcoming Persian Student Group culture show because it already granted the group funding earlier in the year.</p>\n<p>“If you had read the minutes, you would have known that,” Theus said. “Lead with your heart on decisions, but also lead with the legal code.”</p>\n<p>Theus said A.S. must adhere to the legal code because it affects future decisions for unallocated funds.</p>\n<p>“We set a precedent of not using that Senate unallocated money,” Theus said. “That’s not what the purpose is.”</p>\n<blockquote><p>The University of California system was built on a foundation of quality, affordability and accessibility for the state. And, yet, in the last few decades, the state of California has shown a pattern of consistent disinvestment in how it funds higher education — currently students are paying for the bulk of the funding for higher education. – A.S. Chief Financial Officer Andre Theus</p></blockquote>\n<p>A.S. President and fourth-year psychology and sociology double major Ali Guthy said Senate can pull money from the Internal Vice President’s (IVP’s) special projects fund because she recently increased its funding.</p>\n<p>“Senate unallocated funding has been used to fund A.S. groups that need additional revenue for programs or projects,” Guthy said. “When I was going through the budget, my top priority was re-funding groups that got cut. I did increase special projects funding for IVP so that’s where senate can pull from for some of its projects.”</p>\n<p>Senator Matthew Santos said he did not feel comfortable voting on Guthy’s proposed budget with so many senators absent.</p>\n<p>“Right now there are more proxies here than there are people,” Santos said. “I’d much rather take a vote with all of our senators present because I’d rather have Daisy and Nadia and Koo and Iseah and Firenze and Jenna.”</p>\n<p>The senate voted to table the budget proposal for one week.</p>\n<p>Theus said the UC system has lost sight of its original goal to bring an affordable education to its students.</p>\n<p>“The University of California system was built on a foundation of quality, affordability and accessibility for the state,” Theus said. “And, yet, in the last few decades, the state of California has shown a pattern of consistent disinvestment in how it funds higher education — currently students are paying for the bulk of the funding for higher education.”</p>\n<p>Theus said he updated the Financial Resource Guide to show students where UC tuition goes.</p>\n<p>“This guide has been designed to help students understand how much they pay on the UC level, the UCSB level and into the Associated Students,” Theus said. “This resource aims to make these fees more transparent for you and to help you navigate the complicated financial procedures that revolve around funding.”</p>\n<p>Letters and Science Collegiate Senator and third-year history of public policy major Zach Goulhiane said the Study Bean, the Davidson Library coffee counter, will operate 24/7 during dead and finals week again Spring Quarter.</p>\n<p>“We got the results for the 24-hour café,” Goulhiane said. “We lost only 500 dollars, so that’s good, so they put it past the board again and they accepted it so we’re gonna have a 24-hour café again for this quarter.”</p>\n<p>According to External Vice President of Statewide Affairs and fourth-year political science major Melvin Singh, the recently launched “Dear Governor Brown” campaign to address tuition hikes is attracting national attention and creating a platform for students to discuss concerns.</p>\n<p>“It’s been about 24 hours, but I have people from elsewhere messaging me saying, ‘Why is this a California thing?’” Singh said. “‘Why don’t you make it a nationwide thing?’ Basically, we created a place for people to talk about problems and validate what’s going on when it comes to tuition increases.”</p>\n<p>A version of this story appeared on page 4 of the Thursday, April 30, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-62958\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-62958\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/","id":2775,"author":{"id":160,"name":"Alyssa Schmidt"},"related":[2774,2773,2772],"comments":[],"followers":[]},{"title":"Talk Aims to Challenge Borders of Public Education","category":"News","subcategory":"Campus","publish_date":"2015-04-30T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"Professor will speak tonight to discuss undocumented students’ engagement in activism in the public education system","content":"<div class=\"single-post-content\">\n            <h2>Professor will speak tonight to discuss undocumented students’ engagement in activism in the public education system</h2>\n<div id=\"attachment_62965\" style=\"width: 285px\" class=\"wp-caption alignleft\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1572611968\" data-slb-internal=\"0\" data-slb-group=\"62959\"><img aria-describedby=\"caption-attachment-62965\" data-attachment-id=\"62965\" data-permalink=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/najera_ucr-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=480%2C600&amp;ssl=1\" data-orig-size=\"480,600\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5\",\"credit\":\"\",\"camera\":\"Canon PowerShot SX50 HS\",\"caption\":\"\",\"created_timestamp\":\"1420727316\",\"copyright\":\"\",\"focal_length\":\"21.238\",\"iso\":\"400\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Najera_UCR-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=200%2C250&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=480%2C600&amp;ssl=1\" class=\" wp-image-62965\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?resize=275%2C344\" alt=\"Courtesy of mcc.sa.UCSB.edu\" width=\"275\" height=\"344\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?w=480&amp;ssl=1 480w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?resize=200%2C250&amp;ssl=1 200w\" sizes=\"(max-width: 275px) 100vw, 275px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-62965\" class=\"wp-caption-text\"><em>Courtesy of mcc.sa.UCSB.edu</em></p></div>\n<p>UC Riverside Professor Jennifer Najera will give a talk tonight at 6 p.m. in the MultiCultural Center (MCC) lounge on work being done within the undocumented student movement to create new learning spaces and to expand people’s perspectives on who can be a teacher.</p>\n<p>The talk, titled “Challenging the Borders of Education: Undocumented Students and Public Pedagogy,” is part of the MCC’s Race Matters series that features professors leading discussions on the types of adversity different racial groups face. Najera will focus her discussion on how undocumented students are engaging in activism in the public education system.</p>\n<p>Najera said students should be aware of minority groups on and around campus.</p>\n<p>“If we want to be informed and engaged in our society, we cannot ignore our neighbors and what they might be going through,” Najera said. “It is important for UCSB students to know who is in their community, what issues, politics these people are facing and the situation they are in to help us make better choices.”</p>\n<p>MCC publicist and marketing coordinator Carol Dinh said Najera’s talk aims to create a safe atmosphere for students to discuss undocumented students’ challenges.</p>\n<p>“This lecture in particular will help bring more attention to the status of undocumented students at our university, with the aim of creating a safe space where students can ask questions and learn how to be proactive to defend the right to education for all young people,” Dinh said.</p>\n<blockquote><p>If we want to be informed and engaged in our society, we cannot ignore our neighbors and what they might be going through. – UC Riverside Professor Jennifer Najera</p></blockquote>\n<p>Only five to 10 percent of undocumented students graduating high school have the opportunity to attend a university, and even fewer receive financial aid, according to Dinh.</p>\n<p>“[These students] are an integral part of our campus … and are a marginalized group that are ‘unseen,’ as their status is often times kept private,” Dinh said.</p>\n<p>Najera said undocumented students are diligent in educating themselves and others about their cause.</p>\n<p>“What I have seen in my research is that they are actively creating learning experiences outside their classrooms,” Najera said. “They are involved on an everyday level and on education projects, whether it be educating themselves about immigration policies or ways they could be participating in the community to educating other people.”</p>\n<p>Third-year math major Isabel Czarnecki said undocumented students have the same right to education as their native-born peers.</p>\n<p>“I think it’s a great cause because even if you aren’t documented, everyone deserves a right to an education,” Czarnecki said. “I don’t think their citizenship should declare the education they can or cannot get.”</p>\n<p>Dinh said the MCC hopes students who attend the talk will leave with a different perspective on undocumented students.</p>\n<p>“We hope that by exposing students to the adversities faced by undocumented students that they can slowly begin to shift and shape their world view and language,” Dinh said.</p>\n<p>According to Dinh, the MCC created the Race Matters series to educate students on the challenges their classmates may be facing.</p>\n<p>“Race Matters is a series of interactive discussions that probe or explore issues related to race on a deeper level and examines its continued impact on marginalized communities within larger societal structures,” Dinh said. “The MCC hopes to broaden awareness and contribute to an ongoing dialogue and reflection on important issues.”</p>\n<p>A version of this story appeared on page 5 of the Thursday, April 30, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-62959\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-62959\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/","id":2774,"author":{"id":162,"name":"Kelly Lin"},"related":[2773,2772,2771],"comments":[],"followers":[]},{"title":"UC Riverside Professor Advocates for Undocumented Students","category":"News","subcategory":"Campus","publish_date":"2015-05-01T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"UC Riverside Associate Professor of ethnic studies Jennifer Nájera gave a talk in the MultiCultural Center Lounge Thursday evening titled “Challenging the Borders of Education: Undocumented Student...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_62965\" style=\"width: 254px\" class=\"wp-caption alignleft\"><a href=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg\" data-slb-active=\"1\" data-slb-asset=\"1047024810\" data-slb-internal=\"0\" data-slb-group=\"63014\"><img aria-describedby=\"caption-attachment-62965\" data-attachment-id=\"62965\" data-permalink=\"https://dailynexus.com/2015-04-30/talk-aims-to-challenge-borders-of-public-education/najera_ucr-1/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=480%2C600&amp;ssl=1\" data-orig-size=\"480,600\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5\",\"credit\":\"\",\"camera\":\"Canon PowerShot SX50 HS\",\"caption\":\"\",\"created_timestamp\":\"1420727316\",\"copyright\":\"\",\"focal_length\":\"21.238\",\"iso\":\"400\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Najera_UCR-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=200%2C250&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?fit=480%2C600&amp;ssl=1\" class=\" wp-image-62965\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?resize=244%2C305\" alt=\"Courtesy of mcc.sa.UCSB.edu\" width=\"244\" height=\"305\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?w=480&amp;ssl=1 480w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Najera_UCR-1.jpg?resize=200%2C250&amp;ssl=1 200w\" sizes=\"(max-width: 244px) 100vw, 244px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-62965\" class=\"wp-caption-text\">Courtesy of mcc.sa.UCSB.edu</p></div>\n<p>UC Riverside Associate Professor of ethnic studies Jennifer Nájera gave a talk in the MultiCultural Center Lounge Thursday evening titled “Challenging the Borders of Education: Undocumented Students and Public Pedagogy” to discuss how undocumented immigrants maneuver public education.</p>\n<p>During her talk, Nájera recounted her experiences meeting with undocumented students and the struggles that their community faces in education and immigration reform. Nájera’s past encounters with undocumented immigrants inspired her to do anthropological research for Providing Opportunities, Dreams, and Education in Riverside (PODER), an organization dedicated to serving undocumented students at UC Riverside.</p>\n<p>According to Nájera, people need to be taught to view undocumented students as people rather than as a certain stereotype or a number in order to understand issues associated with immigration.</p>\n<p>“That’s where the public pedagogy comes in,” Nájera said, “taking advantage of ways that people can educate others outside the classroom about who community members are, what they contribute, what their dreams and aspirations are.”</p>\n<p>Nájera said she hopes to increase general understanding of the undocumented community through her research.</p>\n<p>“I hope that it broadens peoples’ understanding of the way activism occurs: not always in big demonstrations but in small ways – micro politics,” Nájera said. “And also I hope that it stretches the way we perceive education and where it can occur, not just in classrooms, but outside how people are creating spaces of learning.”</p>\n<p>According to Nájera, she wants to work with members of PODER to help adapt UCR facilities to adequately serve undocumented students.</p>\n<p>“Last year they [PODER] were able to lobby the office of student affairs to create an undocumented students task force representative from all of the major staffing entities: housing, financial aid, counseling, career services,” Nájera said. “They wanted to make sure that in each of these areas where students were going to be present that they had some kind of training about undocumented students.”</p>\n<p>Second-year sociology and Asian American studies double major Madison Villanueva said she is an undocumented student, and identified with Nájera’s talk. Villanueva said the lack of medical options is one obstacle undocumented immigrants face in the U.S.</p>\n<p>“I do feel that there are more uncertainties that face us who are undocumented after graduating,” Villanueva said in an email. “Currently, there isn’t anything statewide that guarantees some sort of healthcare for all undocumented immigrants.”</p>\n<p>Despite the hardships undocumented students face in the U.S., returning to their countries of origin may mean worse conditions, according to Villanueva.</p>\n<p>“Many undocumented folks also come from countries that are practically in shambles from violence and destroyed economies and returning to these countries are not options,” Villanueva said in an email.</p>\n<p>Villanueva said, as a member of the undocumented community, she experiences more than just the pressures of being a student.</p>\n<p>“The uncertainty of my parents’ future because we are undocumented adds to the stress of being a college student,” Villanueva said in an email. “On top of that, I need to support my family financially while supporting myself at school while trying to not get caught up in anything in the over-policed Isla Vista (because anything police related as an undocumented immigrant is closely related to the threat of deportation.)”</p>\n<p>According to Villanueva, she is glad to have found support at UCSB to help overcome her obstacles.</p>\n<p>“Being undocumented definitely exacerbates pressure and stresses of being a college student, and if it wasn’t for a small supportive community I found in UCSB, I honestly don’t know how I could thrive or even survive,” Villanueva said in an email.</p>\n<p>MCC Acting Programmer Kelsey Thibdeau said she believes Nájera’s research is crucial for helping people understand how the undocumented students “fit into our larger societal structure.”</p>\n<p>“The mission for the MCC is to be a safe space where we can explore some of these difficult issues of race, sexuality, issues that don’t necessarily get brought up in other spaces here,” Thibdeau said. “We like to believe that we are promoting different types of programming and events that reach out to underrepresented populations on our community campus.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63014\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/uc-riverside-professor-advocates-for-undocumented-students/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63014\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/uc-riverside-professor-advocates-for-undocumented-students/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/uc-riverside-professor-advocates-for-undocumented-students/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/uc-riverside-professor-advocates-for-undocumented-students/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-01/uc-riverside-professor-advocates-for-undocumented-students/","id":2773,"author":{"id":163,"name":"Shelly Lu"},"related":[2772,2771,2770],"comments":[],"followers":[]}]},"__N_SSG":true}