{"pageProps":{"article":{"title":"A.S. External Affairs Committee Talks Tuition Hikes, Bills, Self-Governance","category":"News","subcategory":"Campus","publish_date":"2015-05-08T07:00:00.000Z","full_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/01/1456763_10152153038379879_1125226773_n.jpg?resize=253%2C230&ssl=1","mobile_thumbnail":"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/01/1456763_10152153038379879_1125226773_n.jpg?resize=253%2C339&ssl=1","description":"The Associated Students Senate External Affairs Committee (EAC) met Thursday evening in the UCen’s Goleta Valley Room to discuss two bills and upcoming events.","content":"<div class=\"single-post-content\">\n            <p>The Associated Students Senate External Affairs Committee (EAC) met Thursday evening in the UCen’s Goleta Valley Room to discuss two bills and upcoming events.</p>\n<p>Off-campus Senator Michelle Moreh authored both pieces of legislature — the first, A Bill to Create Article XVIII: Isla Vista Community Space Governance of the By-Laws of the Associated Students UCSB, and the second, A Bill to Create Policy 35: The Standing Policies &amp; Procedures of the Pardall Center of The Standing Policies and Procedures of the Associated Students of UCSB.</p>\n<p>Moreh said specific rules on voting rights and membership subcommittees for the Pardall Center should be clearer in A Bill to Create Article XVII.</p>\n<p>“We want to ensure that this article allows for entire Isla Vista community space governance, but we also want to make sure that anything that has to do with positions that are important or pertain to just the Pardall Center is clarified for just the Pardall Center,” Moreh said.</p>\n<p>Moreh said an A.S. in I.V. Governance Board could potentially manage the Pardall Center if A.S. does not establish a special administration.</p>\n<p>“I would imagine that these future spaces would have somewhat of a different charge, and if they don’t, then maybe this existing committee could manage spaces with similar missions,” Moreh said.</p>\n<p>The committee tabled the bill to allow senators more time to become familiar with its language, according to Moreh.</p>\n<p>“It’s something that is pretty big since we are creating something, and I just wouldn’t want anyone to come and say, ‘I don’t feel as though there was enough time for senators to look at it,’” Moreh said. “We want to create something that is going to be a model that we can work under for years to come.”</p>\n<p>Moreh said a temporary committee comprised of members of I.V. Tenants Union (IVTU), I.V. Community Relations Committee (IVCRC) and Pardall Center staff members will continue to hold meetings Mondays at 4 p.m. beginning May 11 in the conference room of the Pardall Center to discuss the facility’s administration.</p>\n<p>“The way that the [committee] was made was so that anyone could join and become a voting member. Ideally, we would have advertised that, but we didn’t have enough time to get the word out,” Moreh said. “Anyone can come — it is an open meeting — but those are the people currently discussing it.”</p>\n<p>According to Moreh, the committee tabled the bill to allow for the inclusion of amendments that give IVTU and the Legal Resource Center autonomy as renting tenants of the Pardall Center.</p>\n<p>“IVTU and LRC want to be able to have as much autonomy as possible since they are tenants and they should have the ability to run their own space,” Moreh said. “They are on the board, but we also guaranteed them that there would be something in this legislation that would say they have autonomy.”</p>\n<p>EAC sent A Bill to Create the Standing Policies &amp; Procedures of the Pardall Center of The Standing Policies and Procedures of the A.S. UCSB to the consent calendar.</p>\n<p>A Bill to Create Policy 35 will foster more connections between A.S. and I.V., according to Moreh.</p>\n<p>“It is hard because the only one is Pardall Center right now,” Moreh said. “The point is to eventually have so many different paths.”</p>\n<p>Moreh said the bill lays out the expectations, behaviors, parking, advertising and other “dos and don’ts” for use of the Pardall Center.</p>\n<p>“It is important to have because we have had some issues in the Pardall Center and, like any public space, there needs to be a set of policies that governs this space so that we can enforce respectful behavior,” Moreh said.</p>\n<p>After discussing both bills, EAC moved to a discussion on campaigns to address tuition hikes and the upcoming Week of Healing to remember the events of May 23 last year.</p>\n<p>First-year political science and Asian American studies double major Akshaya Natarajan said A.S. is using the “Dear Governor Brown” campaign and a recently released online petition to combat tuition hikes</p>\n<p>“The petition is specifically asking Governor Brown to commit to invest $100 million in the UC system which would freeze tuition which would offset tuition hikes,” Natarajan said.</p>\n<p>Natarajan also discussed “We’re Fucked,” a project to publicize problems caused by state disinvestment in higher education.</p>\n<p>“Our tuition is going up, we aren’t able to pay for very basic necessities, our little brothers and little sisters won’t be able to go to college,” Natarajan said.</p>\n<p>According to Natarajan, A.S. will soon table, host a panel discussion with faculty, share student testimonials and distribute t-shirts to educate students about Dear Governor Brown.</p>\n<p>Second-year history of public policy major and Off-campus Senator Paola Dela Cruz said there will be an art gallery, memorial garden and other installments for the Week of Healing.</p>\n<p>“The Parks District worked closely with the families, they made sure each bench was designed to represent each student,” Dela Cruz said.</p>\n<p>Representative-at-large Senator Victor Garcia said the Residence Halls Association (RHA) is participating in BLUNITE, a memorial art installment made up of blue LED lights.</p>\n<p>“RHA has actually bought 300 LED lights for each [residence] hall — so around like 2,700 lights — and they’re going to be distributed at each front desk so residents can come and pick up a light and put a light on their windowsill,” Garcia said.</p>\n<p>EAC Chair and third-year anthropology major Carlos Lopez concluded the meeting with information about the AB 3 Sacramento Lobby Day this Wednesday. According to Lopez, organizers plan to bring I.V. residents to Sacramento to promote Assemblymember Das Williams’ I.V. self-governance bill, AB 3, before its hearing in the California State Assembly Committee on Local Government.</p>\n<p>“We are trying to get at least 20 people to go up there to honestly show there is community-supported favor of AB 3 instead of just homeowners — who are going to drive up there because they don’t have school — to say that they don’t want it, or people that are opposed to it in general,” Lopez said.</p>\n<p>[Correction: This article originally quoted Michelle Moreh as saying “this existing committee could manage spaces with similar commissions,” however the correct quote reads “this existing committee could manage spaces with similar missions.” The article also stated the EAC could potentially manage the Pardall Center, while Moreh in fact said an A.S. in I.V. Governance Board could be created to potentially manage the Pardall Center. The article said this was the first EAC meeting, but the committee has met on previous Mondays at 4 p.m. In addition, Moreh said the bill was tabled to allow for the inclusion of amendments to give IVTU and the Legal Resource Center the majority of power, when the amendments actually allowed IVTU and the Legal Resource Center autonomy as renting tenants.]</p>\n<p><em>This story was updated as of 11:23 p.m. on May 12, 2015.</em></p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63266\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-08/a-s-external-affairs-committee-talks-tuition-hikes-bills-self-governance/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63266\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-08/a-s-external-affairs-committee-talks-tuition-hikes-bills-self-governance/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-08/a-s-external-affairs-committee-talks-tuition-hikes-bills-self-governance/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-08/a-s-external-affairs-committee-talks-tuition-hikes-bills-self-governance/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-08/a-s-external-affairs-committee-talks-tuition-hikes-bills-self-governance/","id":2778,"author":{"id":118,"name":"Peeka Zimmerman"},"related":[2777,2776,2775],"comments":[],"followers":[]},"author":{"id":118,"name":"Peeka Zimmerman","biography":"Not available","articles":[2407,2490,2504,2533,2541,2543,2544,2551,2557,2580,2616,2618,2688,2702,2703,2728,2737,2749,2778,2780,2792,2802,2803,2825,2846,2855,2860,2881,2885,2899,2900,2904,2908,2913,2920,2934,2943,2945,2946,2962,2970,2977,3443,3609,3617,3856,4590,4606,4626,4629,4656,4722,4741,4786,4801,4813],"portrait":"Not available"},"related":[{"title":"Senate Covers Funding Requests, 2015-2016 Budget","category":"News","subcategory":"Campus","publish_date":"2015-04-30T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"On Wednesday, the Associated Student Senate discussed proposals to fund student groups, stirring up controversy","content":"<div class=\"single-post-content\">\n            <h2>On Wednesday, the Associated Student Senate discussed proposals to fund student groups, stirring up controversy</h2>\n<div id=\"attachment_62942\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62942\" data-attachment-id=\"62942\" data-permalink=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/senate_lorenzo-basilio-1-6/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=600%2C399&amp;ssl=1\" data-orig-size=\"600,399\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"3.2\",\"credit\":\"\",\"camera\":\"NIKON D700\",\"caption\":\"\",\"created_timestamp\":\"1430337049\",\"copyright\":\"\",\"focal_length\":\"200\",\"iso\":\"2500\",\"shutter_speed\":\"0.004\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Senate_Lorenzo Basilio-1\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=250%2C166&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?fit=600%2C399&amp;ssl=1\" class=\"size-full wp-image-62942\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?resize=600%2C399\" alt=\"Student senators try to keep themsleves entertained during last night’s meeting, during which they discussed monetary issues. Lorenzo Basilio/Daily Nexus\" width=\"600\" height=\"399\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?w=600&amp;ssl=1 600w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Senate_Lorenzo-Basilio-11.jpg?resize=250%2C166&amp;ssl=1 250w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-62942\" class=\"wp-caption-text\">Student senators try to keep themsleves entertained during last night’s meeting, during which they discussed monetary issues. <em>Lorenzo Basilio/Daily Nexus</em></p></div>\n<p>The Associated Students Senate met Wednesday night in the Flying A room of the UCen to discuss how to spend the remainder of its unallocated budget for the 2014-2015 year.</p>\n<p>UCSB Active Minds and the Persian Student Group both requested funding for future events. Senate voted to fund Active Minds and denied the Persian Student Group’s request because it already received funding this school year.</p>\n<p>Co-president of UCSB Active Minds Lilia Goldenberg said the group will host guest speaker Meg Hutchinson and an open-mic night for students on May 20 to discuss the events of May 23 last year.</p>\n<p>“[Hutchinson is] a poet and a songwriter who uses yoga and meditation and suffers from bipolar disorder,” Goldenberg said. “We’re opening it up into an open mic night afterwards in light of the tragedy, so we want to bring out student artists and pretty much anyone who wants to express anything that they feel in regards to the tragedy.”</p>\n<blockquote><p>There should be exceptions to every rule for certain things, including things like sexual assault, mental health. There are some issues that are bigger than normal precedents and I think we should fully fund them. – A.S. CCS Collegiate Senator Liam Stanton</p></blockquote>\n<p>A.S. Senator and second-year economics and accounting major Steven Kwok said Senate should grant Active Minds’ request for $1,000 to fund the event, despite Senate’s precedent to not fund Office of Student Life (OSL) student groups.</p>\n<p>“I know we set a precedent not funding OSL groups, but because of the gravity of all things coming together next month I think we should grant this request,” Kwok said.</p>\n<p>A.S. CCS Collegiate Senator and second-year CCS physics major Liam Stanton said he agreed with Kwok that Senate should make an exception to the rule given the sensitivity of the issue.</p>\n<p>“There should be exceptions to every rule for certain things, including things like sexual assault, mental health,” Stanton said. “There are some issues that are bigger than normal precedents and I think we should fully fund them.”</p>\n<p>The Senate voted to grant the full $1,000 for the event.</p>\n<p>A.S. Chief Financial Officer and fourth-year psychology major Andre Theus said Senate should not fund the Persian Student Group’s request for $500 for food at the upcoming Persian Student Group culture show because it already granted the group funding earlier in the year.</p>\n<p>“If you had read the minutes, you would have known that,” Theus said. “Lead with your heart on decisions, but also lead with the legal code.”</p>\n<p>Theus said A.S. must adhere to the legal code because it affects future decisions for unallocated funds.</p>\n<p>“We set a precedent of not using that Senate unallocated money,” Theus said. “That’s not what the purpose is.”</p>\n<blockquote><p>The University of California system was built on a foundation of quality, affordability and accessibility for the state. And, yet, in the last few decades, the state of California has shown a pattern of consistent disinvestment in how it funds higher education — currently students are paying for the bulk of the funding for higher education. – A.S. Chief Financial Officer Andre Theus</p></blockquote>\n<p>A.S. President and fourth-year psychology and sociology double major Ali Guthy said Senate can pull money from the Internal Vice President’s (IVP’s) special projects fund because she recently increased its funding.</p>\n<p>“Senate unallocated funding has been used to fund A.S. groups that need additional revenue for programs or projects,” Guthy said. “When I was going through the budget, my top priority was re-funding groups that got cut. I did increase special projects funding for IVP so that’s where senate can pull from for some of its projects.”</p>\n<p>Senator Matthew Santos said he did not feel comfortable voting on Guthy’s proposed budget with so many senators absent.</p>\n<p>“Right now there are more proxies here than there are people,” Santos said. “I’d much rather take a vote with all of our senators present because I’d rather have Daisy and Nadia and Koo and Iseah and Firenze and Jenna.”</p>\n<p>The senate voted to table the budget proposal for one week.</p>\n<p>Theus said the UC system has lost sight of its original goal to bring an affordable education to its students.</p>\n<p>“The University of California system was built on a foundation of quality, affordability and accessibility for the state,” Theus said. “And, yet, in the last few decades, the state of California has shown a pattern of consistent disinvestment in how it funds higher education — currently students are paying for the bulk of the funding for higher education.”</p>\n<p>Theus said he updated the Financial Resource Guide to show students where UC tuition goes.</p>\n<p>“This guide has been designed to help students understand how much they pay on the UC level, the UCSB level and into the Associated Students,” Theus said. “This resource aims to make these fees more transparent for you and to help you navigate the complicated financial procedures that revolve around funding.”</p>\n<p>Letters and Science Collegiate Senator and third-year history of public policy major Zach Goulhiane said the Study Bean, the Davidson Library coffee counter, will operate 24/7 during dead and finals week again Spring Quarter.</p>\n<p>“We got the results for the 24-hour café,” Goulhiane said. “We lost only 500 dollars, so that’s good, so they put it past the board again and they accepted it so we’re gonna have a 24-hour café again for this quarter.”</p>\n<p>According to External Vice President of Statewide Affairs and fourth-year political science major Melvin Singh, the recently launched “Dear Governor Brown” campaign to address tuition hikes is attracting national attention and creating a platform for students to discuss concerns.</p>\n<p>“It’s been about 24 hours, but I have people from elsewhere messaging me saying, ‘Why is this a California thing?’” Singh said. “‘Why don’t you make it a nationwide thing?’ Basically, we created a place for people to talk about problems and validate what’s going on when it comes to tuition increases.”</p>\n<p>A version of this story appeared on page 4 of the Thursday, April 30, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-62958\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-62958\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-04-30/senate-covers-funding-requests-2015-2016-budget/","id":2775,"author":{"id":160,"name":"Alyssa Schmidt"},"related":[2774,2773,2772],"comments":[],"followers":[]},{"title":"Guest Professor Lectured on Vaccination and Public Policy","category":"News","subcategory":"Campus","publish_date":"2015-04-30T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"Northwestern University economics professor Charles Manski gave a lecture titled “Mandating Vaccination with Unknown Indirect Effects” to outline different methods of making public policy decision...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_62946\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg\" data-slb-active=\"1\" data-slb-asset=\"160084902\" data-slb-internal=\"0\" data-slb-group=\"62960\"><img aria-describedby=\"caption-attachment-62946\" data-attachment-id=\"62946\" data-permalink=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/manski_vivian-bui-2/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=600%2C397&amp;ssl=1\" data-orig-size=\"600,397\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"1.4\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1430318787\",\"copyright\":\"\",\"focal_length\":\"50\",\"iso\":\"280\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Manski_Vivian Bui-2\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=250%2C165&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?fit=600%2C397&amp;ssl=1\" class=\"size-full wp-image-62946\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=600%2C397\" alt=\"Vivian Bui/Daily Nexus\" width=\"600\" height=\"397\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=250%2C165&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-2.jpg?resize=500%2C330&amp;ssl=1 500w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"></a><p id=\"caption-attachment-62946\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>Northwestern University economics professor Charles Manski gave a lecture titled “Mandating Vaccination with Unknown Indirect Effects” to outline different methods of making public policy decisions regarding compulsory vaccinations.</p>\n<p>Manski is an elected member of the National Academy of Sciences and an econometrician in the field of rational choice theory, which involves using applied economics to make decisions. The talk focused on how to make public policy decisions using incomplete data and information, specifically whether vaccinations in the U.S. should be decentralized or compulsory.</p>\n<p>According to Manski, welfare economics involves a “social planner” who makes beneficial decisions on behalf of the community and often has to make judgements with limited information, making it difficult for the planner to determine optimal choices for issues such as mandated vaccines.</p>\n<p>“So the kind of knowledge that’s assumed in the literature around social planning, that the planner actually knows everything you need to know in order to solve optimization problems — in the real world we don’t have that kind of knowledge,” Manski said. “We may know some of these things, but we don’t know all of it. It’s definitely going to be true with the vaccination problem.”</p>\n<blockquote><p>It’s a really hard thing to make policy decisions that are controversial like vaccine decisions when our knowledge about the effects of vaccines is incomplete. – Economics professor Peter Kuhn</p></blockquote>\n<p>Manski said elementary decision theory provides specific procedures for decision making using partial information and is a two part process that involves first eliminating the comparatively worse or “dominated” decision option and then determining a method of choosing a generally optimal or “undominated” option. Manski said he believes there are multiple ways of deciding which method is “dominated,” contrary to arguments that there exists one particular way to maximize optimality.</p>\n<p>“The whole point of decision theory is to try to have a kind of explicit procedures for making decisions with limited information,” Manski said. “The harder part — where there’s no agreement to this day — is how we are going to choose a dominated policy.”</p>\n<p>According to Manski, in a decentralized healthcare system such as that of the U.S. people do not consider the social and external consequences of their private medical decisions. This issue leads to government intervention in deciding voluntary or mandatory treatments, particularly vaccinations for contagious diseases.</p>\n<p>Manski said there is a lack of knowledge about the benefits of vaccinations despite the common belief that the more people who are vaccinated, the less chance of a disease.</p>\n<div id=\"attachment_62945\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62945\" data-attachment-id=\"62945\" data-permalink=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/manski_vivian-bui-1/\" data-orig-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=600%2C397&amp;ssl=1\" data-orig-size=\"600,397\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"5.3\",\"credit\":\"\",\"camera\":\"NIKON D5100\",\"caption\":\"\",\"created_timestamp\":\"1430318602\",\"copyright\":\"\",\"focal_length\":\"66\",\"iso\":\"6400\",\"shutter_speed\":\"0.008\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Manski_Vivian Bui-1\" data-image-description=\"\" data-medium-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=250%2C165&amp;ssl=1\" data-large-file=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?fit=600%2C397&amp;ssl=1\" class=\"size-full wp-image-62945\" src=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=600%2C397\" alt=\"Vivian Bui/Daily Nexus\" width=\"600\" height=\"397\" srcset=\"https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=250%2C165&amp;ssl=1 250w, https://i0.wp.com/dailynexus.com/wp-content/uploads/2015/04/Manski_Vivian-Bui-1.jpg?resize=500%2C330&amp;ssl=1 500w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-62945\" class=\"wp-caption-text\"><em>Vivian Bui/Daily Nexus</em></p></div>\n<p>Manski said the process of determining the social cost function of mandated vaccines uses a simple model that consists of two variables — the costs of getting sick and the costs of being vaccinated. Vaccination will likely lower the frequency of illness, but may also increase medical costs, lead to side effects and infringe on personal medical choices.</p>\n<p>“Mandatory vaccinations improve public health relative to decentralization [and] lowers the illness rate,” Manski said. “On the other hand, mandating vaccination means more people are going to get vaccinated, and that’s going to increase the cost of production of the vaccine, the vaccines may have some side effects, and then they have the real political issue of so called reducing personal freedom.”</p>\n<p>According to Manski, he used the simple model he constructed and applied econometrics to lay out multiple methods of making an optimal choice when determining whether to mandate vaccines with partial information.</p>\n<p>“I sought to assist decision making by juxtaposing several well-known criteria and comparing the policies they generate,” Manski said. “Whether a public health agency should use one of these or some other criterion to cope with uncertainty is ultimately a matter to be decided by the agency.”</p>\n<p>Economics professor Peter Kuhn said Manski effectively presented several options for making judgements on controversial issues like vaccination.</p>\n<p>“It’s a really hard thing to make policy decisions that are controversial like vaccine decisions when our knowledge about the effects of vaccines is incomplete,” Kuhn said. “Professor Manski gives us a good way of making decisions in that world and a way that is dispassionate and scientific and also respects the beliefs and values of everyone in society.”</p>\n<p>Economics professor Shelly Lundberg said Manksi’s talk shed light on how “tremendously important” it is to understand the constraints of public decision-making.</p>\n<p>“I think the paper is not so much vaccination,” Lundberg said. “It’s about dealing with the uncertainty when you’re making public policy decisions and how very difficult that is. I think we have to recognize more explicitly the limits of what we know.”</p>\n<p>A version of this story appeared on page 6 of the Thursday, April 30, 2015 print edition of the <em>Daily Nexus</em>.</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-62960\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-62960\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-04-30/guest-professor-lectured-on-vaccination-and-public-policy/","id":2776,"author":{"id":161,"name":"Cheryl Sun"},"related":[2775,2774,2773],"comments":[],"followers":[]},{"title":"Artist to Speak on Activism, Expression","category":"News","subcategory":"Campus","publish_date":"2015-05-01T07:00:00.000Z","full_thumbnail":"Not available","mobile_thumbnail":"Not available","description":"Visual artist Julio Salgado will give a talk titled “Queer, Undocumented & Unafraid” in the Theater and Dance building on Saturday to discuss his work as an activist, which will be followed by an ...","content":"<div class=\"single-post-content\">\n            <div id=\"attachment_62995\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-62995\" data-attachment-id=\"62995\" data-permalink=\"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/salgado/\" data-orig-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?fit=1200%2C800&amp;ssl=1\" data-orig-size=\"1200,800\" data-comments-opened=\"1\" data-image-meta='{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}' data-image-title=\"Salgado\" data-image-description=\"\" data-medium-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?fit=250%2C167&amp;ssl=1\" data-large-file=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?fit=888%2C592&amp;ssl=1\" class=\"wp-image-62995\" src=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado-1024x683.jpg?resize=600%2C400\" alt=\"© Jesus Iñiguez of Huffington Post\" width=\"600\" height=\"400\" srcset=\"https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?resize=1024%2C683&amp;ssl=1 1024w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?resize=250%2C167&amp;ssl=1 250w, https://i2.wp.com/dailynexus.com/wp-content/uploads/2015/04/Salgado.jpg?w=1200&amp;ssl=1 1200w\" sizes=\"(max-width: 600px) 100vw, 600px\" data-recalc-dims=\"1\"><p id=\"caption-attachment-62995\" class=\"wp-caption-text\"><em>© Jesus Iñiguez of Huffington Post</em></p></div>\n<p>Visual artist Julio Salgado will give a talk titled “Queer, Undocumented &amp; Unafraid” in the Theater and Dance building on Saturday to discuss his work as an activist, which will be followed by an art workshop in which attendees can participate.</p>\n<p>Salgado’s talk, hosted by the Research Center of Sexual and Gender Diversity (RCSGD), will explore the challenges he faced as a queer and undocumented man of color in the United States and how those experiences shaped his life. Originally born in Mexico, Salgado moved to Long Beach, California at the age of 12, where he was raised.</p>\n<p>Salgado identifies as an “artivist,” an activist who spreads ideas through art. According to Salgado, he began exploring art as a child to cope with the struggle of language barriers.</p>\n<p>“I’ve been making art all my life ever since I moved to this country,” Salgado said. “I feel that art — especially visual art and drawing — have been a way for me to communicate, especially when I didn’t speak English.”</p>\n<p>Salgado said the hardships he faced helped him realize his passion for sharing ideas through art.</p>\n<p>“My experiences as an undocumented immigrant really shaped what I want to do in my art, which is why I wanted to share some of my experiences through poster work, through comic strips and political editorial cartoons,” Salgado said.</p>\n<p>The event aims to provide an environment for queer students and students of color to feel comfortable interacting with their peers and sharing experiences with one another, according to Salgado.</p>\n<p>“When you are a person of color who’s queer, you have to sort of bring this identity with you, so [I am] creating these spaces for a queer person of color because you feel like you’re not alone,” Salgado said. “There’s this feeling of relief that really takes away the pressure of wanting to show how perfect you are, because nobody’s perfect.”</p>\n<p>Salgado said he appreciates students’ interest in his work, and though people “tend to glorify artists who are dead,” he believes it is important for artists to talk about their own work.</p>\n<p>“A lot of students … were doing their thesis about me and writing about my artwork,” Salgado said. “I’m still alive, I’m an artist, so I should be talking about my work.”</p>\n<p>Richard Moreno, fourth-year communication major and RCSGD graphic designer and marketing coordinator, said Salgado’s talk will address issues faced by the undocumented and queer, or “undocu-queer,” community.</p>\n<p>“Julio’s artivist work within the undocu-queer community made him the perfect guest to host an event for our center,” Moreno said in an email. “Students should attend because Julio Salgado sheds light on a very serious issue facing a community that often does not have a voice.”</p>\n<p>Moreno said he looks forward to learning more about Salgado’s past and current work, as well as participating in the art workshop.</p>\n<p>“I am looking forward to hearing Julio speak about his experiences as an activist in the art community,” Moreno said in an email. “I am also interested in [the] art portion of the workshop as well, even though I am not a very talented artist.”</p><div class=\"h5ab-print-button-container\"><div class=\"h5ab-print-button h5ab-print-button-left\" style=\"cursor: pointer; color: #555\"><i class=\"fa fa-print fa-lg\"></i>\n\t\t\t\t\t\t\t<span>Print</span></div></div>\n<div class=\"sharedaddy sd-sharing-enabled\"><div class=\"robots-nocontent sd-block sd-social sd-social-icon sd-sharing\"><h3 class=\"sd-title\">Share this:</h3><div class=\"sd-content\"><ul><li class=\"share-facebook\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-facebook-63011\" class=\"share-facebook sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/?share=facebook\" target=\"_blank\" title=\"Click to share on Facebook\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Facebook (Opens in new window)</span></a></li><li class=\"share-twitter\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"sharing-twitter-63011\" class=\"share-twitter sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/?share=twitter\" target=\"_blank\" title=\"Click to share on Twitter\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Twitter (Opens in new window)</span></a></li><li class=\"share-tumblr\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-tumblr sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/?share=tumblr\" target=\"_blank\" title=\"Click to share on Tumblr\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Tumblr (Opens in new window)</span></a></li><li class=\"share-reddit\"><a rel=\"nofollow noopener noreferrer\" data-shared=\"\" class=\"share-reddit sd-button share-icon no-text\" href=\"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/?share=reddit\" target=\"_blank\" title=\"Click to share on Reddit\"><span></span><span class=\"sharing-screen-reader-text\">Click to share on Reddit (Opens in new window)</span></a></li><li class=\"share-end\"></ul></div></div></div>\n<div id=\"jp-relatedposts\" class=\"jp-relatedposts\">\n\t<h3 class=\"jp-relatedposts-headline\"><em>Related</em></h3>\n</div>          </div>","src_url":"https://dailynexus.com/2015-05-01/artist-to-speak-on-activism-expression/","id":2777,"author":{"id":161,"name":"Cheryl Sun"},"related":[2776,2775,2774],"comments":[],"followers":[]}]},"__N_SSG":true}